-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\05_an_des
> criptive_plots.log
  log type:  text
 opened on:   6 Oct 2020, 13:03:06

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   162,299      1,769 |   164,068 
       HCQ |    30,335        234 |    30,569 
-----------+----------------------+----------
     Total |   192,634      2,003 |   194,637 

. 
. /* Generate KM PLOT==========================================================
> =*/ 
. 
. count if exposure != .u
  194,637

. noi display "RUNNING THE KM PLOT FOR `r(N)' PEOPLE WITH NON-MISSING EXPOSURE"
RUNNING THE KM PLOT FOR 194637 PEOPLE WITH NON-MISSING EXPOSURE

. 
. sts graph, by(exposure) failure ci                                           
>                                    ///     
>                    title("Time to $tableoutcome", justification(left) size(me
> dsmall) )             ///
>                    xtitle("Days since 1 Mar 2020", size(small))              
>                            ///
>                    yscale(range(0, $ymax))                                   
>                                                    ///
>                    ylabel(0 (0.001) $ymax, angle(0) format(%4.3f) labsize(sma
> ll))       ///
>                    xscale(range(30, 84))                                     
>                                                    ///
>                    xlabel(0 (20) 160, labsize(small))                        
>                                    ///                             
>                    legend(size(vsmall) label (1 "No HCQ") label (2 "HCQ") reg
> ion(lwidth(none)) position(12))    ///
>                    graphregion(fcolor(white)) ///       
>                    risktable(,size(vsmall) order (1 "No HCQ" 2 "HCQ") title(,
> size(vsmall))) ///
>                    saving(kmplot1, replace)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
(note: file kmplot1.gph not found)
(file kmplot1.gph saved)
(file kmplot1.gph saved)

. 
. graph export "$Tabfigdir/kmplot1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/sens1/tabfig/kmplot1.svg w
> ritten in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase kmplot1.gph

. 
. 
. 
. 
. 
. 
. 
. /* DAG Adjusted curves ======================================================
> =*/ 
. //stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone, df(4) scale(
> hazard) eform /*strata(stp population) ******************** TO DO: HOW TO HAN
> DLE STRATA ***/       
. 
. *NOTE: this model will not run with stp and population as stratification vari
> ables
. *Moved population to an indicator variable, and will compare model estimates 
> from stcox
. stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone population, df(
> 4) scale(hazard) eform stratify(stp)

Iteration 0:   log likelihood = -11811.795  
Iteration 1:   log likelihood = -11804.918  
Iteration 2:   log likelihood = -11804.803  
Iteration 3:   log likelihood = -11804.802  

Log likelihood = -11804.802                     Number of obs     =    194,637

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
    exposure |   1.002928   .0708678     0.04   0.967     .8732188    1.151905
        male |   1.247738   .0592855     4.66   0.000     1.136787    1.369517
        age1 |   1.062893   .0187623     3.46   0.001     1.026748     1.10031
        age2 |   1.032788   .0268735     1.24   0.215     .9814377    1.086826
        age3 |   .9384489   .0935107    -0.64   0.524     .7719578    1.140848
    dmard_pc |   .6801989    .034591    -7.58   0.000      .615671    .7514899
oral_pred~ne |    2.02599   .0960316    14.90   0.000      1.84625    2.223228
  population |   .8161613   .0690734    -2.40   0.016     .6914123    .9634182
       _rcs1 |   1.298746   .0156399    21.71   0.000     1.268451    1.329764
       _rcs2 |   .9912196   .0071447    -1.22   0.221     .9773147    1.005322
       _rcs3 |   1.003986   .0038461     1.04   0.299     .9964764    1.011553
       _rcs4 |   .9980201   .0015825    -1.25   0.211     .9949233    1.001126
   _rcs_stp1 |   1.000235   .0006527     0.36   0.719     .9989562    1.001515
   _rcs_stp2 |   1.000965    .000426     2.27   0.023      1.00013      1.0018
   _rcs_stp3 |   1.000076   .0002071     0.37   0.712     .9996705    1.000482
   _rcs_stp4 |   1.000026   .0000818     0.32   0.746     .9998661    1.000187
       _cons |   .0000575   .0000512   -10.96   0.000       .00001    .0003292
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    194,637     131.715    14.76647         .5        134

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range days 0 `tmax' `tmaxplus1'
(194,502 missing values generated)

. stpm2_standsurv if exposure == 1, at1(exposure 0) at2(exposure 1) timevar(day
> s) ci contrast(difference) fail

. 
. gen date = d(1/3/2020)+ days
(194,502 missing values generated)

. format date %tddd_Month

. 
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci _contrast2_1 _contrast2
> _1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(134 real changes made)

->  replace _at2=100*_at2
(134 real changes made)

->  replace _at1_lci=100*_at1_lci
(134 real changes made)

->  replace _at1_uci=100*_at1_uci
(134 real changes made)

->  replace _at2_lci=100*_at2_lci
(134 real changes made)

->  replace _at2_uci=100*_at2_uci
(134 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(134 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(134 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(134 real changes made)

. 
. *cumulative mortality at last day of follow-up
. list _at1* if days==`tmax', noobs

  +----------------------------------+
  |      _at1   _at1_lci    _at1_uci |
  |----------------------------------|
  | .76632192   .7274996   .80721596 |
  +----------------------------------+

. list _at2* if days==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .76853406   .67733541   .87201199 |
  +-----------------------------------+

. list _contrast* if days==`tmax', noobs

  +----------------------------------+
  | _contra~1   _con~lci   _cont~uci |
  |----------------------------------|
  | .00221214   -.102677   .10710127 |
  +----------------------------------+

. 
. *l date days _at1 _at1_lci _at1_uci _at2 _at2_lci _at2_uci if days<.
. 
. twoway  (rarea _at1_lci _at1_uci days, color(red%25)) ///
>                  (rarea _at2_lci _at2_uci days if _at2_uci<1, color(blue%25))
>  ///
>                  (line _at1 days, sort lcolor(red)) ///
>                  (line _at2 days, sort lcolor(blue) lpattern(dash)) ///
>                  , legend(order(1 "No HCQ" 2 "HCQ") ring(0) cols(1) pos(11) r
> egion(lwidth(none))) ///
>                                  title("Time to $tableoutcome", justification
> (left) size(med) )            ///
>                                  yscale(range(0, 1))                         
>                                                            ///
>                                  ylabel(0 (0.1) 1, angle(0) format(%4.1f) lab
> size(small))       ///
>                                  xlabel(0 (20) 160, labsize(small))          
>                                                    ///                     
>                  ytitle("Cumulative mortality (%)", size(medsmall)) ///
>                  xtitle("Days since 1 Mar 2020", size(medsmall))             
>    ///
>                                  graphregion(fcolor(white)) saving(adjcurv1, 
> replace)
(note:  named style med not found in class gsize, default attributes used)
(note: file adjcurv1.gph not found)
(file adjcurv1.gph saved)

. 
. graph export "$Tabfigdir/adjcurv1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/sens1/tabfig/adjcurv1.svg 
> written in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adjcurv1.gph

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\05_an_des
> criptive_plots.log
  log type:  text
 closed on:   6 Oct 2020, 13:04:57
-------------------------------------------------------------------------------
