-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\05_an_des
> criptive_plots.log
  log type:  text
 opened on:  21 Jul 2020, 22:06:04

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   162,198      1,576 |   163,774 
       HCQ |    30,299        213 |    30,512 
-----------+----------------------+----------
     Total |   192,497      1,789 |   194,286 

. 
. /* Generate KM PLOT==========================================================
> =*/ 
. 
. count if exposure != .u
  194,286

. noi display "RUNNING THE KM PLOT FOR `r(N)' PEOPLE WITH NON-MISSING EXPOSURE"
RUNNING THE KM PLOT FOR 194286 PEOPLE WITH NON-MISSING EXPOSURE

. 
. sts graph, by(exposure) failure ci                                           
>                                    ///     
>                    title("Time to $tableoutcome", justification(left) size(me
> dsmall) )             ///
>                    xtitle("Days since 1 Mar 2020", size(small))              
>                            ///
>                    yscale(range(0, $ymax))                                   
>                                                    ///
>                    ylabel(0 (0.001) $ymax, angle(0) format(%4.3f) labsize(sma
> ll))       ///
>                    xscale(range(30, 84))                                     
>                                                    ///
>                    xlabel(0 (20) 160, labsize(small))                        
>                                    ///                             
>                    legend(size(vsmall) label (1 "No HCQ") label (2 "HCQ") reg
> ion(lwidth(none)) position(12))    ///
>                    graphregion(fcolor(white)) ///       
>                    risktable(,size(vsmall) order (1 "No HCQ" 2 "HCQ") title(,
> size(vsmall))) ///
>                    saving(kmplot1, replace)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
(note: file kmplot1.gph not found)
(file kmplot1.gph saved)
(file kmplot1.gph saved)

. 
. graph export "$Tabfigdir/kmplot1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/sens1/tabfig/kmplot1.svg w
> ritten in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase kmplot1.gph

. 
. 
. 
. 
. 
. 
. 
. /* DAG Adjusted curves ======================================================
> =*/ 
. //stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone, df(4) scale(
> hazard) eform /*strata(stp population) ******************** TO DO: HOW TO HAN
> DLE STRATA ***/       
. 
. *NOTE: this model will not run with stp and population as stratification vari
> ables
. *Moved population to an indicator variable, and will compare model estimates 
> from stcox
. stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone population, df(
> 4) scale(hazard) eform stratify(stp)

Iteration 0:   log likelihood = -10683.319  
Iteration 1:   log likelihood = -10674.879  
Iteration 2:   log likelihood = -10674.819  
Iteration 3:   log likelihood = -10674.819  

Log likelihood = -10674.819                     Number of obs     =    194,286

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
    exposure |   1.035863   .0768386     0.48   0.635     .8956983    1.197962
        male |    1.27849   .0640415     4.90   0.000     1.158935    1.410377
        age1 |   1.059504   .0190533     3.21   0.001      1.02281    1.097514
        age2 |   1.032671   .0276356     1.20   0.230     .9799021    1.088281
        age3 |   .9493974   .0978776    -0.50   0.614     .7757002    1.161989
    dmard_pc |   .6562649   .0355268    -7.78   0.000     .5902004    .7297244
oral_pred~ne |   2.008969   .1008982    13.89   0.000     1.820634    2.216787
  population |   .7687429   .0701872    -2.88   0.004     .6427843     .919384
       _rcs1 |    1.30548   .0171843    20.25   0.000     1.272231    1.339599
       _rcs2 |   1.002502   .0089025     0.28   0.778     .9852046    1.020103
       _rcs3 |    1.00372   .0041618     0.90   0.371     .9955959     1.01191
       _rcs4 |   .9975574    .001624    -1.50   0.133     .9943794    1.000746
   _rcs_stp1 |   .9996992   .0006933    -0.43   0.664     .9983413    1.001059
   _rcs_stp2 |    1.00078    .000485     1.61   0.108     .9998296    1.001731
   _rcs_stp3 |   1.000044   .0002163     0.20   0.838     .9996205    1.000468
   _rcs_stp4 |   1.000113   .0000834     1.35   0.177     .9999491    1.000276
       _cons |   .0000639   .0000578   -10.67   0.000     .0000108    .0003763
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    194,286    118.1086    12.64545          1        120

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range days 0 `tmax' `tmaxplus1'
(194,165 missing values generated)

. stpm2_standsurv if exposure == 1, at1(exposure 0) at2(exposure 1) timevar(day
> s) ci contrast(difference) fail

. 
. gen date = d(1/3/2020)+ days
(194,165 missing values generated)

. format date %tddd_Month

. 
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci: replace X=100*X

->  replace _at1=100*_at1
(120 real changes made)

->  replace _at2=100*_at2
(120 real changes made)

->  replace _at1_lci=100*_at1_lci
(120 real changes made)

->  replace _at1_uci=100*_at1_uci
(120 real changes made)

->  replace _at2_lci=100*_at2_lci
(120 real changes made)

->  replace _at2_uci=100*_at2_uci
(120 real changes made)

. 
. *l date days _at1 _at1_lci _at1_uci _at2 _at2_lci _at2_uci if days<.
. 
. twoway  (rarea _at1_lci _at1_uci days, color(red%25)) ///
>                  (rarea _at2_lci _at2_uci days if _at2_uci<1, color(blue%25))
>  ///
>                  (line _at1 days, sort lcolor(red)) ///
>                  (line _at2  days, sort lcolor(blue)) ///
>                  , legend(order(1 "No HCQ" 2 "HCQ") ring(0) cols(1) pos(11) r
> egion(lwidth(none))) ///
>                                  title("Time to $tableoutcome", justification
> (left) size(med) )            ///
>                                  yscale(range(0, 1))                         
>                                                            ///
>                                  ylabel(0 (0.1) 1, angle(0) format(%4.1f) lab
> size(small))       ///
>                                  xlabel(0 (20) 160, labsize(small))          
>                                                    ///                     
>                  ytitle("Cumulative mortality (%)", size(medsmall)) ///
>                  xtitle("Days since 1 Mar 2020", size(medsmall))             
>    ///
>                                  graphregion(fcolor(white)) saving(adjcurv1, 
> replace)
(note:  named style med not found in class gsize, default attributes used)
(note: file adjcurv1.gph not found)
(file adjcurv1.gph saved)

. 
. graph export "$Tabfigdir/adjcurv1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/sens1/tabfig/adjcurv1.svg 
> written in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adjcurv1.gph

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\05_an_des
> criptive_plots.log
  log type:  text
 closed on:  21 Jul 2020, 22:07:26
-------------------------------------------------------------------------------
