-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\06_an_mod
> els.log
  log type:  text
 opened on:  21 Jul 2020, 22:07:26

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   162,198      1,576 |   163,774 
           |     99.04       0.96 |    100.00 
-----------+----------------------+----------
       HCQ |    30,299        213 |    30,512 
           |     99.30       0.70 |    100.00 
-----------+----------------------+----------
     Total |   192,497      1,789 |   194,286 
           |     99.08       0.92 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood = -21746.725
Iteration 2:   log likelihood = -21746.598
Iteration 3:   log likelihood = -21746.598
Refining estimates:
Iteration 0:   log likelihood = -21746.598

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(1)       =       22.72
Log likelihood  =   -21746.598                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7163493   .0522953    -4.57   0.000     .6208475    .8265416
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar.ster 
> saved

. parmest, label eform format(estimate p lb ub) saving("$Tempdir/parmest_univar
> _$outcome", replace) idstr("parmest_univar_$outcome") 
(note: file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/parme
> st_univar_onsnoncoviddeath.dta not found)
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/parmest_univ
> ar_onsnoncoviddeath.dta saved

. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. * Age fit as spline 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood =  -20723.95
Iteration 2:   log likelihood = -20538.307
Iteration 3:   log likelihood = -20527.592
Iteration 4:   log likelihood = -20526.483
Iteration 5:   log likelihood = -20526.452
Iteration 6:   log likelihood = -20526.452
Refining estimates:
Iteration 0:   log likelihood = -20526.452

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(5)       =     2463.01
Log likelihood  =   -20526.452                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.024395   .0754126     0.33   0.743     .8867576    1.183396
      1.male |    1.27644   .0637907     4.88   0.000     1.157341    1.407796
        age1 |   1.057986   .0190198     3.14   0.002     1.021357    1.095929
        age2 |   1.038836   .0277873     1.42   0.154     .9857772    1.094751
        age3 |   .9322155   .0959716    -0.68   0.495     .7618775    1.140637
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1.st
> er saved

. parmest, label eform format(estimate p lb ub) saving("$Tempdir/parmest_multiv
> ar1_$outcome", replace) idstr("parmest_multivar1_$outcome") 
(note: file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/parme
> st_multivar1_onsnoncoviddeath.dta not found)
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/parmest_mult
> ivar1_onsnoncoviddeath.dta saved

. 
. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
.         *Note: ethnicity missing for ~20-25%. will model ethnicity in several
>  ways in separate do file
. 
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14390.891
Iteration 2:   log likelihood =  -14207.05
Iteration 3:   log likelihood = -14195.819
Iteration 4:   log likelihood = -14194.759
Iteration 5:   log likelihood = -14194.732
Iteration 6:   log likelihood = -14194.731
Refining estimates:
Iteration 0:   log likelihood = -14194.731

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(7)       =     2615.86
Log likelihood  =   -14194.731                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.033065   .0768491     0.44   0.662      .892909     1.19522
      1.male |   1.279127   .0641422     4.91   0.000     1.159391    1.411228
        age1 |    1.05885   .0190048     3.19   0.001     1.022249    1.096761
        age2 |   1.032725   .0276019     1.20   0.228     .9800187    1.088265
        age3 |   .9506465   .0979431    -0.49   0.623     .7768221    1.163367
  1.dmard_pc |   .6521608   .0354253    -7.87   0.000     .5862968    .7254239
1.oral_pr~ne |   2.006974   .1011223    13.83   0.000      1.81825    2.215287
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2.st
> er saved

. parmest, label eform format(estimate p lb ub) saving("$Tempdir/parmest_multiv
> ar2_$outcome", replace) idstr("parmest_multivar2_$outcome") 
(note: file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/parme
> st_multivar2_onsnoncoviddeath.dta not found)
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/parmest_mult
> ivar2_onsnoncoviddeath.dta saved

. 
. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. 
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine, strata(stp population) 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14191.791
Iteration 2:   log likelihood = -13888.489
Iteration 3:   log likelihood = -13873.148
Iteration 4:   log likelihood = -13872.559
Iteration 5:   log likelihood = -13872.554
Iteration 6:   log likelihood = -13872.554
Refining estimates:
Iteration 0:   log likelihood = -13872.554

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(20)      =     3260.22
Log likelihood  =   -13872.554                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.037805   .0773053     0.50   0.618     .8968307     1.20094
      1.male |   1.098825    .056073     1.85   0.065     .9942414     1.21441
        age1 |   1.059656   .0192294     3.19   0.001     1.022629    1.098023
        age2 |   1.006897   .0272468     0.25   0.800     .9548852    1.061741
        age3 |   1.052339   .1099639     0.49   0.625     .8574513    1.291522
  1.dmard_pc |   .7327973   .0401532    -5.67   0.000     .6581772    .8158774
1.oral_pr~ne |   1.711379   .0892135    10.31   0.000      1.54516    1.895479
    1.nsaids |   .9395526   .0835733    -0.70   0.483     .7892355    1.118499
1.~c_disease |   1.701427   .0873622    10.35   0.000     1.538534    1.881566
1.resp_exc~a |   1.621046   .0874936     8.95   0.000     1.458321    1.801929
             |
egfr_cat_n~s |
      30-59  |   1.006756    .057272     0.12   0.906     .9005369    1.125504
        <30  |   2.371349   .2355778     8.69   0.000     1.951795    2.881089
             |
1.~r_disease |   1.918616   .2823385     4.43   0.000     1.437896    2.560051
             |
   obese4cat |
Obese I ..)  |   .7014798   .0518982    -4.79   0.000     .6067921    .8109432
Obese II..)  |   .9223755    .096911    -0.77   0.442     .7507145    1.133289
Obese II..)  |   1.022752   .1588708     0.14   0.885     .7543064    1.386734
             |
1.hyperten~n |   1.096333   .0591077     1.71   0.088     .9863946    1.218524
1.cancer_e~r |   2.140288   .1125077    14.48   0.000     1.930756    2.372558
1.neuro_co~s |   1.765312   .1045888     9.59   0.000     1.571776    1.982678
1.flu_vacc~e |   .7518129   .0428931    -5.00   0.000      .672274    .8407624
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3.st
> er saved

. parmest, label eform format(estimate p lb ub) saving("$Tempdir/parmest_multiv
> ar3_$outcome", replace) idstr("parmest_multivar3_$outcome") 
(note: file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/parme
> st_multivar3_onsnoncoviddeath.dta not found)
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/parmest_mult
> ivar3_onsnoncoviddeath.dta saved

. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table2.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between HCQ use and $tableoutc
> ome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  163,774

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  1,576

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  30,512

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  213

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7163493   .0522953    -4.57   0.000     .6208475    .8265416
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.024395   .0754126     0.33   0.743     .8867576    1.183396
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.033065   .0768491     0.44   0.662      .892909     1.19522
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.037805   .0773053     0.50   0.618     .8968307     1.20094
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\06_an_mod
> els.log
  log type:  text
 closed on:  21 Jul 2020, 22:07:55
-------------------------------------------------------------------------------
