-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\07_an_mod
> els_interact.log
  log type:  text
 opened on:  19 Jul 2020, 18:21:00

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* So few deaths occuring below 60 years this cannot be used as a category, s
> o combining 18-59 */ 
. gen agegroup2 = agegroup

. recode agegroup2(1 = 2)
(agegroup2: 13683 changes made)

. recode agegroup2(2 = 3)
(agegroup2: 33089 changes made)

. tab agegroup2, nolabel 

  agegroup2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     70,113       36.10       36.10
          4 |     45,617       23.49       59.58
          5 |     49,101       25.28       84.86
          6 |     29,405       15.14      100.00
------------+-----------------------------------
      Total |    194,236      100.00

. 
. label define agegroup2  3 "18-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup2 agegroup2

. tab agegroup agegroup2 , m

   Grouped |                  agegroup2
       age |    18-<60     60-<70     70-<80        80+ |     Total
-----------+--------------------------------------------+----------
    18-<40 |    13,683          0          0          0 |    13,683 
    40-<50 |    19,406          0          0          0 |    19,406 
    50-<60 |    37,024          0          0          0 |    37,024 
    60-<70 |         0     45,617          0          0 |    45,617 
    70-<80 |         0          0     49,101          0 |    49,101 
       80+ |         0          0          0     29,405 |    29,405 
-----------+--------------------------------------------+----------
     Total |    70,113     45,617     49,101     29,405 |   194,236 

. 
. 
. foreach intvar of varlist agegroup2 dmard_pc oral_prednisolone nsaids {
  2. /* Check Counts */ 
. 
. bysort `intvar': tab exposure $outcome, row
  3. 
. /* Univariable model */ 
. stcox i.exposure
  4. estimates store A
  5. 
. stcox i.exposure##i.`intvar'
  6. estimates store B
  7. estimates save $Tempdir/univar_int_`intvar', replace 
  8. 
. lrtest A B
  9. global univar_p_`intvar' = round(r(p),0.001)
 10. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. stcox i.exposure i.agegroup2 i.male
 11. estimates store A
 12. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male
 13. estimates store B
 14. estimates save $Tempdir/multivar1_int_`intvar', replace 
 15. 
. lrtest A B
 16. global multivar1_p_`intvar' = round(r(p),0.001)
 17. 
. * DAG Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone, strata(st
> p population)                                      
 18.                                                                           
>       
. estimates store A
 19. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e, strata(stp population)                  
 20. estimates store B
 21. estimates save $Tempdir/multivar2_int_`intvar', replace 
 22. 
. lrtest A B
 23. global multivar2_p_`intvar' = round(r(p),0.001)
 24. 
. * Fully Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone i.nsaids i
> .chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_liver
> _disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu_va
> ccine, strata(stp population)
 25. estimates store A
 26. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.c
> hronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditi
> ons i.flu_vaccine, strata(stp population)
 27. estimates store B
 28. estimates save $Tempdir/multivar3_int_`intvar', replace 
 29. 
. lrtest A B
 30. global multivar3_p_`intvar' = round(r(p),0.001)
 31. 
. }

-------------------------------------------------------------------------------
-> agegroup2 = 18-<60

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    57,554         67 |    57,621 
           |     99.88       0.12 |    100.00 
-----------+----------------------+----------
       HCQ |    12,480         12 |    12,492 
           |     99.90       0.10 |    100.00 
-----------+----------------------+----------
     Total |    70,034         79 |    70,113 
           |     99.89       0.11 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 60-<70

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    37,493        162 |    37,655 
           |     99.57       0.43 |    100.00 
-----------+----------------------+----------
       HCQ |     7,928         34 |     7,962 
           |     99.57       0.43 |    100.00 
-----------+----------------------+----------
     Total |    45,421        196 |    45,617 
           |     99.57       0.43 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 70-<80

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    41,513        463 |    41,976 
           |     98.90       1.10 |    100.00 
-----------+----------------------+----------
       HCQ |     7,048         77 |     7,125 
           |     98.92       1.08 |    100.00 
-----------+----------------------+----------
     Total |    48,561        540 |    49,101 
           |     98.90       1.10 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 80+

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    25,598        885 |    26,483 
           |     96.66       3.34 |    100.00 
-----------+----------------------+----------
       HCQ |     2,832         90 |     2,922 
           |     96.92       3.08 |    100.00 
-----------+----------------------+----------
     Total |    28,430        975 |    29,405 
           |     96.68       3.32 |    100.00 


         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -21758.386
Iteration 2:   log likelihood = -21758.258
Iteration 3:   log likelihood = -21758.258
Refining estimates:
Iteration 0:   log likelihood = -21758.258

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(1)       =       22.79
Log likelihood  =   -21758.258                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7159809   .0522665    -4.58   0.000     .6205316     .826112
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -21042.342
Iteration 2:   log likelihood = -20805.851
Iteration 3:   log likelihood = -20734.073
Iteration 4:   log likelihood =  -20733.84
Iteration 5:   log likelihood =  -20733.84
Refining estimates:
Iteration 0:   log likelihood =  -20733.84

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(7)       =     2071.63
Log likelihood  =    -20733.84                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8113946   .2543418    -0.67   0.505     .4389472    1.499864
             |
   agegroup2 |
     60-<70  |   3.677769   .5342042     8.97   0.000     2.766594    4.889037
     70-<80  |   9.432734   1.232956    17.17   0.000     7.300906    12.18705
        80+  |    28.9175   3.664128    26.55   0.000     22.55824    37.06946
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   1.210795   .4429645     0.52   0.601     .5911013    2.480158
 HCQ#70-<80  |    1.19935   .4038902     0.54   0.589     .6198658    2.320569
    HCQ#80+  |   1.129945   .3756107     0.37   0.713     .5889861    2.167751
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_int_a
> gegroup2.ster saved

Likelihood-ratio test                                 LR chi2(6)  =   2048.84
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood =   -21031.3
Iteration 2:   log likelihood = -20797.391
Iteration 3:   log likelihood =  -20726.65
Iteration 4:   log likelihood = -20726.433
Iteration 5:   log likelihood = -20726.433
Refining estimates:
Iteration 0:   log likelihood = -20726.433

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(5)       =     2086.44
Log likelihood  =   -20726.433                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9429719   .0691041    -0.80   0.423     .8168077    1.088623
             |
   agegroup2 |
     60-<70  |   3.765518   .5018808     9.95   0.000     2.899838    4.889627
     70-<80  |   9.596306   1.156512    18.76   0.000     7.577403    12.15312
        80+  |   29.36723   3.439347    28.86   0.000     23.34395    36.94465
             |
      1.male |    1.21727    .060668     3.94   0.000     1.103986    1.342178
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -21034.686
Iteration 2:   log likelihood = -20798.175
Iteration 3:   log likelihood =  -20726.47
Iteration 4:   log likelihood = -20726.238
Iteration 5:   log likelihood = -20726.238
Refining estimates:
Iteration 0:   log likelihood = -20726.238

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(8)       =     2086.83
Log likelihood  =   -20726.238                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .830716   .2604504    -0.59   0.554     .4493445    1.535768
             |
   agegroup2 |
     60-<70  |   3.658907   .5314874     8.93   0.000     2.752372    4.864023
     70-<80  |   9.355627   1.223043    17.10   0.000     7.240973    12.08784
        80+  |   28.85432   3.656159    26.53   0.000      22.5089    36.98856
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |    1.19269   .4363675     0.48   0.630      .582237    2.443179
 HCQ#70-<80  |   1.177023   .3964155     0.48   0.628     .6082816    2.277537
    HCQ#80+  |   1.102884   .3666845     0.29   0.768     .5748101    2.116097
             |
      1.male |   1.217147    .060674     3.94   0.000     1.103852    1.342069
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.39
(Assumption: A nested in B)                           Prob > chi2 =    0.9422

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood =  -14649.87
Iteration 2:   log likelihood = -14419.709
Iteration 3:   log likelihood = -14376.477
Iteration 4:   log likelihood = -14376.366
Iteration 5:   log likelihood = -14376.366
Refining estimates:
Iteration 0:   log likelihood = -14376.366

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(7)       =     2264.94
Log likelihood  =   -14376.366                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9744176   .0722233    -0.35   0.727     .8426642    1.126771
             |
   agegroup2 |
     60-<70  |   3.660907    .488814     9.72   0.000     2.817955    4.756017
     70-<80  |   8.983984    1.08758    18.14   0.000     7.086381    11.38973
        80+  |   26.14429    3.08087    27.70   0.000      20.7525    32.93694
             |
      1.male |   1.222468   .0611452     4.02   0.000     1.108312    1.348381
  1.dmard_pc |   .6034411   .0325238    -9.37   0.000     .5429471    .6706752
1.oral_pr~ne |   1.982758   .0998375    13.59   0.000     1.796426    2.188417
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood = -14650.539
Iteration 2:   log likelihood = -14419.829
Iteration 3:   log likelihood = -14376.285
Iteration 4:   log likelihood = -14376.168
Iteration 5:   log likelihood = -14376.168
Refining estimates:
Iteration 0:   log likelihood = -14376.168

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(10)      =     2265.33
Log likelihood  =   -14376.168                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8886128   .2793078    -0.38   0.707     .4799145    1.645361
             |
   agegroup2 |
     60-<70  |   3.566544   .5187815     8.74   0.000     2.681845    4.743091
     70-<80  |   8.814033   1.156378    16.59   0.000     6.815524    11.39856
        80+  |   25.85537    3.29167    25.55   0.000     20.14575    33.18318
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   1.174401   .4299168     0.44   0.661     .5730784    2.406681
 HCQ#70-<80  |   1.132575   .3818298     0.37   0.712     .5849216    2.192987
    HCQ#80+  |   1.057114   .3518955     0.17   0.867     .5505175     2.02989
             |
      1.male |   1.222583    .061163     4.02   0.000     1.108395    1.348534
  1.dmard_pc |   .6034642   .0325349    -9.37   0.000     .5429504    .6707225
1.oral_pr~ne |   1.983492   .0998811    13.60   0.000     1.797079    2.189242
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.40
(Assumption: A nested in B)                           Prob > chi2 =    0.9408

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood = -14310.204
Iteration 2:   log likelihood = -14031.365
Iteration 3:   log likelihood = -14016.674
Iteration 4:   log likelihood = -14016.425
Iteration 5:   log likelihood = -14016.425
Refining estimates:
Iteration 0:   log likelihood = -14016.425

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(20)      =     2984.82
Log likelihood  =   -14016.425                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9897097   .0734818    -0.14   0.889     .8556765    1.144738
             |
   agegroup2 |
     60-<70  |     3.0262   .4099461     8.17   0.000      2.32054    3.946446
     70-<80  |   6.053373   .7694652    14.17   0.000     4.718438    7.765986
        80+  |   14.15345   1.808947    20.73   0.000     11.01718    18.18252
             |
      1.male |   1.050353   .0534138     0.97   0.334     .9507115    1.160437
  1.dmard_pc |   .6907991   .0376426    -6.79   0.000     .6208243    .7686611
1.oral_pr~ne |   1.686257   .0880527    10.01   0.000     1.522214    1.867978
    1.nsaids |   .8902641   .0788424    -1.31   0.189     .7484036    1.059015
1.~c_disease |   1.769205   .0908499    11.11   0.000     1.599809    1.956536
1.resp_exc~a |   1.535653   .0827059     7.96   0.000     1.381815    1.706618
             |
egfr_cat_n~s |
      30-59  |   1.111913   .0628962     1.88   0.061     .9952264     1.24228
        <30  |   2.804712   .2769685    10.44   0.000     2.311166    3.403654
             |
1.~r_disease |   1.796178   .2641392     3.98   0.000     1.346402    2.396204
             |
   obese4cat |
Obese I ..)  |   .6426573   .0473217    -6.00   0.000     .5562905    .7424329
Obese II..)  |   .8226482    .086055    -1.87   0.062     .6701504    1.009848
Obese II..)  |   .8981707   .1390515    -0.69   0.488     .6630999    1.216575
             |
1.hyperten~n |   1.144138   .0616895     2.50   0.013     1.029399    1.271667
1.cancer_e~r |   2.148766   .1129004    14.56   0.000     1.938498    2.381842
1.neuro_co~s |   1.858554   .1098407    10.49   0.000     1.655271    2.086802
1.flu_vacc~e |   .7556385   .0431206    -4.91   0.000     .6756786    .8450609
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood =  -14310.22
Iteration 2:   log likelihood = -14031.259
Iteration 3:   log likelihood =  -14016.51
Iteration 4:   log likelihood = -14016.252
Iteration 5:   log likelihood = -14016.251
Iteration 6:   log likelihood = -14016.251
Refining estimates:
Iteration 0:   log likelihood = -14016.251

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(23)      =     2985.17
Log likelihood  =   -14016.251                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8946131   .2813321    -0.35   0.723     .4830086    1.656973
             |
   agegroup2 |
     60-<70  |   2.950797   .4346854     7.35   0.000     2.210792      3.9385
     70-<80  |   5.928603   .8121346    12.99   0.000     4.532625     7.75452
        80+  |   13.96921   1.910257    19.28   0.000     10.68494    18.26298
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   1.167926   .4275849     0.42   0.672     .5698827    2.393566
 HCQ#70-<80  |   1.144261   .3858552     0.40   0.689     .5908707     2.21594
    HCQ#80+  |   1.071464   .3568289     0.21   0.836     .5578311    2.058034
             |
      1.male |   1.050337   .0534247     0.97   0.334     .9506762    1.160444
  1.dmard_pc |   .6908569    .037655    -6.79   0.000     .6208597    .7687457
1.oral_pr~ne |   1.686931   .0880978    10.01   0.000     1.522806    1.868746
    1.nsaids |   .8902694    .078856    -1.31   0.189     .7483865    1.059051
1.~c_disease |   1.769495   .0908673    11.11   0.000     1.600068    1.956863
1.resp_exc~a |   1.535573    .082704     7.96   0.000     1.381738    1.706534
             |
egfr_cat_n~s |
      30-59  |   1.112102   .0629063     1.88   0.060     .9953963     1.24249
        <30  |   2.803491   .2768753    10.44   0.000     2.310116    3.402237
             |
1.~r_disease |   1.796502   .2641913     3.98   0.000     1.346639    2.396649
             |
   obese4cat |
Obese I ..)  |   .6426105   .0473183    -6.01   0.000       .55625     .742379
Obese II..)  |   .8227341   .0860649    -1.87   0.062     .6702188    1.009956
Obese II..)  |   .8977674   .1389965    -0.70   0.486     .6627914    1.216048
             |
1.hyperten~n |   1.144372   .0617063     2.50   0.012     1.029602    1.271937
1.cancer_e~r |   2.148961   .1129126    14.56   0.000     1.938671    2.382063
1.neuro_co~s |    1.85813   .1098327    10.48   0.000     1.654863    2.086363
1.flu_vacc~e |    .755554   .0431332    -4.91   0.000     .6755726    .8450046
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.35
(Assumption: A nested in B)                           Prob > chi2 =    0.9511

-------------------------------------------------------------------------------
-> dmard_pc = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   106,922      1,175 |   108,097 
           |     98.91       1.09 |    100.00 
-----------+----------------------+----------
       HCQ |    14,680        117 |    14,797 
           |     99.21       0.79 |    100.00 
-----------+----------------------+----------
     Total |   121,602      1,292 |   122,894 
           |     98.95       1.05 |    100.00 

-------------------------------------------------------------------------------
-> dmard_pc = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    55,236        402 |    55,638 
           |     99.28       0.72 |    100.00 
-----------+----------------------+----------
       HCQ |    15,608         96 |    15,704 
           |     99.39       0.61 |    100.00 
-----------+----------------------+----------
     Total |    70,844        498 |    71,342 
           |     99.30       0.70 |    100.00 


         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -21758.386
Iteration 2:   log likelihood = -21758.258
Iteration 3:   log likelihood = -21758.258
Refining estimates:
Iteration 0:   log likelihood = -21758.258

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(1)       =       22.79
Log likelihood  =   -21758.258                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7159809   .0522665    -4.58   0.000     .6205316     .826112
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -21729.411
Iteration 2:   log likelihood =  -21729.22
Iteration 3:   log likelihood =  -21729.22
Refining estimates:
Iteration 0:   log likelihood =  -21729.22

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(3)       =       80.87
Log likelihood  =    -21729.22                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7176878   .0695754    -3.42   0.001     .5934947    .8678691
  1.dmard_pc |   .6613637   .0382142    -7.16   0.000     .5905507    .7406679
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   1.167065    .174289     1.03   0.301     .8709176    1.563915
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_int_d
> mard_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     58.08
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood =   -21031.3
Iteration 2:   log likelihood = -20797.391
Iteration 3:   log likelihood =  -20726.65
Iteration 4:   log likelihood = -20726.433
Iteration 5:   log likelihood = -20726.433
Refining estimates:
Iteration 0:   log likelihood = -20726.433

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(5)       =     2086.44
Log likelihood  =   -20726.433                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9429719   .0691041    -0.80   0.423     .8168077    1.088623
             |
   agegroup2 |
     60-<70  |   3.765518   .5018808     9.95   0.000     2.899838    4.889627
     70-<80  |   9.596306   1.156512    18.76   0.000     7.577403    12.15312
        80+  |   29.36723   3.439347    28.86   0.000     23.34395    36.94465
             |
      1.male |    1.21727    .060668     3.94   0.000     1.103986    1.342178
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -20990.522
Iteration 2:   log likelihood = -20756.589
Iteration 3:   log likelihood =   -20686.3
Iteration 4:   log likelihood = -20686.086
Iteration 5:   log likelihood = -20686.086
Refining estimates:
Iteration 0:   log likelihood = -20686.086

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(7)       =     2167.14
Log likelihood  =   -20686.086                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .919307   .0893051    -0.87   0.386     .7599264    1.112115
  1.dmard_pc |   .6122036   .0354595    -8.47   0.000      .546504    .6858015
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   1.258879   .1880292     1.54   0.123      .939391    1.687025
             |
   agegroup2 |
     60-<70  |   3.919456    .522641    10.24   0.000      3.01802    5.090137
     70-<80  |   10.06307   1.213649    19.14   0.000     7.944604    12.74645
        80+  |   29.99582   3.513034    29.04   0.000     23.84351     37.7356
             |
      1.male |   1.242077   .0619741     4.34   0.000      1.12636    1.369682
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     80.69
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood =  -14649.87
Iteration 2:   log likelihood = -14419.709
Iteration 3:   log likelihood = -14376.477
Iteration 4:   log likelihood = -14376.366
Iteration 5:   log likelihood = -14376.366
Refining estimates:
Iteration 0:   log likelihood = -14376.366

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(7)       =     2264.94
Log likelihood  =   -14376.366                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9744176   .0722233    -0.35   0.727     .8426642    1.126771
             |
   agegroup2 |
     60-<70  |   3.660907    .488814     9.72   0.000     2.817955    4.756017
     70-<80  |   8.983984    1.08758    18.14   0.000     7.086381    11.38973
        80+  |   26.14429    3.08087    27.70   0.000      20.7525    32.93694
             |
      1.male |   1.222468   .0611452     4.02   0.000     1.108312    1.348381
  1.dmard_pc |   .6034411   .0325238    -9.37   0.000     .5429471    .6706752
1.oral_pr~ne |   1.982758   .0998375    13.59   0.000     1.796426    2.188417
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood =  -14648.57
Iteration 2:   log likelihood = -14418.233
Iteration 3:   log likelihood = -14374.878
Iteration 4:   log likelihood = -14374.767
Iteration 5:   log likelihood = -14374.767
Refining estimates:
Iteration 0:   log likelihood = -14374.767

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(8)       =     2268.13
Log likelihood  =   -14374.767                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8749844    .085565    -1.37   0.172     .7223721    1.059838
  1.dmard_pc |   .5803343   .0339896    -9.29   0.000     .5173974    .6509269
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   1.308113   .1957277     1.80   0.073     .9756261    1.753909
             |
   agegroup2 |
     60-<70  |    3.66433   .4892715     9.73   0.000     2.820588    4.760464
     70-<80  |   9.004656   1.090108    18.15   0.000     7.102647      11.416
        80+  |   26.19515   3.086961    27.71   0.000     20.79272    33.00126
             |
      1.male |   1.221423   .0610924     4.00   0.000     1.107366    1.347227
1.oral_pr~ne |   1.988052   .1001304    13.64   0.000     1.801176    2.194317
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      3.20
(Assumption: A nested in B)                           Prob > chi2 =    0.0737

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood = -14310.204
Iteration 2:   log likelihood = -14031.365
Iteration 3:   log likelihood = -14016.674
Iteration 4:   log likelihood = -14016.425
Iteration 5:   log likelihood = -14016.425
Refining estimates:
Iteration 0:   log likelihood = -14016.425

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(20)      =     2984.82
Log likelihood  =   -14016.425                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9897097   .0734818    -0.14   0.889     .8556765    1.144738
             |
   agegroup2 |
     60-<70  |     3.0262   .4099461     8.17   0.000      2.32054    3.946446
     70-<80  |   6.053373   .7694652    14.17   0.000     4.718438    7.765986
        80+  |   14.15345   1.808947    20.73   0.000     11.01718    18.18252
             |
      1.male |   1.050353   .0534138     0.97   0.334     .9507115    1.160437
  1.dmard_pc |   .6907991   .0376426    -6.79   0.000     .6208243    .7686611
1.oral_pr~ne |   1.686257   .0880527    10.01   0.000     1.522214    1.867978
    1.nsaids |   .8902641   .0788424    -1.31   0.189     .7484036    1.059015
1.~c_disease |   1.769205   .0908499    11.11   0.000     1.599809    1.956536
1.resp_exc~a |   1.535653   .0827059     7.96   0.000     1.381815    1.706618
             |
egfr_cat_n~s |
      30-59  |   1.111913   .0628962     1.88   0.061     .9952264     1.24228
        <30  |   2.804712   .2769685    10.44   0.000     2.311166    3.403654
             |
1.~r_disease |   1.796178   .2641392     3.98   0.000     1.346402    2.396204
             |
   obese4cat |
Obese I ..)  |   .6426573   .0473217    -6.00   0.000     .5562905    .7424329
Obese II..)  |   .8226482    .086055    -1.87   0.062     .6701504    1.009848
Obese II..)  |   .8981707   .1390515    -0.69   0.488     .6630999    1.216575
             |
1.hyperten~n |   1.144138   .0616895     2.50   0.013     1.029399    1.271667
1.cancer_e~r |   2.148766   .1129004    14.56   0.000     1.938498    2.381842
1.neuro_co~s |   1.858554   .1098407    10.49   0.000     1.655271    2.086802
1.flu_vacc~e |   .7556385   .0431206    -4.91   0.000     .6756786    .8450609
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood = -14308.796
Iteration 2:   log likelihood = -14030.125
Iteration 3:   log likelihood = -14015.445
Iteration 4:   log likelihood = -14015.197
Iteration 5:   log likelihood = -14015.196
Refining estimates:
Iteration 0:   log likelihood = -14015.196

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(21)      =     2987.28
Log likelihood  =   -14015.196                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8999672   .0881129    -1.08   0.282      .742828    1.090348
  1.dmard_pc |   .6673709   .0394656    -6.84   0.000      .594334    .7493831
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   1.265296   .1893879     1.57   0.116     .9435941    1.696676
             |
   agegroup2 |
     60-<70  |   3.028067   .4101942     8.18   0.000     2.321979    3.948869
     70-<80  |   6.061663   .7705113    14.18   0.000     4.724912    7.776602
        80+  |   14.17068   1.811125    20.74   0.000     11.03063    18.20459
             |
      1.male |   1.049487   .0533677     0.95   0.342     .9499321    1.159476
1.oral_pr~ne |   1.689905   .0882767    10.04   0.000     1.525448    1.872091
    1.nsaids |   .8910914   .0789189    -1.30   0.193     .7490938    1.060006
1.~c_disease |   1.768547   .0908196    11.10   0.000     1.599209    1.955817
1.resp_exc~a |   1.535637   .0827182     7.96   0.000     1.381777    1.706629
             |
egfr_cat_n~s |
      30-59  |   1.112875   .0629493     1.89   0.059     .9960899    1.243352
        <30  |   2.803092    .276817    10.44   0.000     2.309818    3.401708
             |
1.~r_disease |   1.796755   .2642266     3.98   0.000     1.346831    2.396981
             |
   obese4cat |
Obese I ..)  |   .6427591   .0473297    -6.00   0.000     .5563778    .7425517
Obese II..)  |   .8220583   .0859904    -1.87   0.061     .6696745    1.009117
Obese II..)  |   .8973547   .1389257    -0.70   0.484     .6624968    1.215471
             |
1.hyperten~n |   1.144337   .0617055     2.50   0.012     1.029568      1.2719
1.cancer_e~r |   2.148566   .1128904    14.56   0.000     1.938316    2.381621
1.neuro_co~s |   1.857336    .109782    10.47   0.000     1.654163    2.085464
1.flu_vacc~e |   .7569799   .0432042    -4.88   0.000     .6768657    .8465765
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      2.46
(Assumption: A nested in B)                           Prob > chi2 =    0.1170

-------------------------------------------------------------------------------
-> oral_prednisolone = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   135,934      1,074 |   137,008 
           |     99.22       0.78 |    100.00 
-----------+----------------------+----------
       HCQ |    23,526        109 |    23,635 
           |     99.54       0.46 |    100.00 
-----------+----------------------+----------
     Total |   159,460      1,183 |   160,643 
           |     99.26       0.74 |    100.00 

-------------------------------------------------------------------------------
-> oral_prednisolone = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,224        503 |    26,727 
           |     98.12       1.88 |    100.00 
-----------+----------------------+----------
       HCQ |     6,762        104 |     6,866 
           |     98.49       1.51 |    100.00 
-----------+----------------------+----------
     Total |    32,986        607 |    33,593 
           |     98.19       1.81 |    100.00 


         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -21758.386
Iteration 2:   log likelihood = -21758.258
Iteration 3:   log likelihood = -21758.258
Refining estimates:
Iteration 0:   log likelihood = -21758.258

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(1)       =       22.79
Log likelihood  =   -21758.258                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7159809   .0522665    -4.58   0.000     .6205316     .826112
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -21623.532
Iteration 2:   log likelihood = -21604.335
Iteration 3:   log likelihood =   -21604.3
Refining estimates:
Iteration 0:   log likelihood =   -21604.3

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(3)       =      330.71
Log likelihood  =     -21604.3                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .5811065   .0584162    -5.40   0.000     .4771864     .707658
1.oral_pr~ne |   2.425504   .1310489    16.40   0.000     2.181785    2.696448
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   1.362508    .200751     2.10   0.036      1.02076    1.818673
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_int_o
> ral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    307.92
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood =   -21031.3
Iteration 2:   log likelihood = -20797.391
Iteration 3:   log likelihood =  -20726.65
Iteration 4:   log likelihood = -20726.433
Iteration 5:   log likelihood = -20726.433
Refining estimates:
Iteration 0:   log likelihood = -20726.433

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(5)       =     2086.44
Log likelihood  =   -20726.433                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9429719   .0691041    -0.80   0.423     .8168077    1.088623
             |
   agegroup2 |
     60-<70  |   3.765518   .5018808     9.95   0.000     2.899838    4.889627
     70-<80  |   9.596306   1.156512    18.76   0.000     7.577403    12.15312
        80+  |   29.36723   3.439347    28.86   0.000     23.34395    36.94465
             |
      1.male |    1.21727    .060668     3.94   0.000     1.103986    1.342178
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -20961.585
Iteration 2:   log likelihood =  -20709.19
Iteration 3:   log likelihood = -20638.058
Iteration 4:   log likelihood = -20637.846
Iteration 5:   log likelihood = -20637.846
Refining estimates:
Iteration 0:   log likelihood = -20637.846

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(7)       =     2263.62
Log likelihood  =   -20637.846                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7573688    .076315    -2.76   0.006     .6216379    .9227358
1.oral_pr~ne |   1.878525   .1017476    11.64   0.000     1.689324    2.088916
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   1.483563   .2186034     2.68   0.007     1.111428    1.980299
             |
   agegroup2 |
     60-<70  |   3.642217   .4856187     9.69   0.000     2.804624    4.729955
     70-<80  |   8.984599     1.0842    18.19   0.000     7.092209    11.38193
        80+  |   27.05508   3.174621    28.11   0.000     21.49659    34.05086
             |
      1.male |   1.210377   .0603263     3.83   0.000     1.097731    1.334582
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    177.17
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood =  -14649.87
Iteration 2:   log likelihood = -14419.709
Iteration 3:   log likelihood = -14376.477
Iteration 4:   log likelihood = -14376.366
Iteration 5:   log likelihood = -14376.366
Refining estimates:
Iteration 0:   log likelihood = -14376.366

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(7)       =     2264.94
Log likelihood  =   -14376.366                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9744176   .0722233    -0.35   0.727     .8426642    1.126771
             |
   agegroup2 |
     60-<70  |   3.660907    .488814     9.72   0.000     2.817955    4.756017
     70-<80  |   8.983984    1.08758    18.14   0.000     7.086381    11.38973
        80+  |   26.14429    3.08087    27.70   0.000      20.7525    32.93694
             |
      1.male |   1.222468   .0611452     4.02   0.000     1.108312    1.348381
  1.dmard_pc |   .6034411   .0325238    -9.37   0.000     .5429471    .6706752
1.oral_pr~ne |   1.982758   .0998375    13.59   0.000     1.796426    2.188417
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood = -14647.064
Iteration 2:   log likelihood =  -14416.26
Iteration 3:   log likelihood = -14373.265
Iteration 4:   log likelihood = -14373.154
Iteration 5:   log likelihood = -14373.154
Refining estimates:
Iteration 0:   log likelihood = -14373.154

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(8)       =     2271.36
Log likelihood  =   -14373.154                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8284508   .0840225    -1.86   0.064     .6791048     1.01064
1.oral_pr~ne |   1.886987   .1025901    11.68   0.000     1.696256    2.099163
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   1.454804   .2146182     2.54   0.011     1.089512    1.942571
             |
   agegroup2 |
     60-<70  |   3.667885   .4897647     9.73   0.000     2.823298    4.765131
     70-<80  |   8.991228   1.088449    18.14   0.000     7.092107    11.39889
        80+  |    26.1541   3.081676    27.70   0.000     20.76083    32.94844
             |
      1.male |   1.220844   .0610652     3.99   0.000     1.106838    1.346592
  1.dmard_pc |    .605853   .0326503    -9.30   0.000     .5451233    .6733484
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      6.42
(Assumption: A nested in B)                           Prob > chi2 =    0.0113

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood = -14310.204
Iteration 2:   log likelihood = -14031.365
Iteration 3:   log likelihood = -14016.674
Iteration 4:   log likelihood = -14016.425
Iteration 5:   log likelihood = -14016.425
Refining estimates:
Iteration 0:   log likelihood = -14016.425

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(20)      =     2984.82
Log likelihood  =   -14016.425                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9897097   .0734818    -0.14   0.889     .8556765    1.144738
             |
   agegroup2 |
     60-<70  |     3.0262   .4099461     8.17   0.000      2.32054    3.946446
     70-<80  |   6.053373   .7694652    14.17   0.000     4.718438    7.765986
        80+  |   14.15345   1.808947    20.73   0.000     11.01718    18.18252
             |
      1.male |   1.050353   .0534138     0.97   0.334     .9507115    1.160437
  1.dmard_pc |   .6907991   .0376426    -6.79   0.000     .6208243    .7686611
1.oral_pr~ne |   1.686257   .0880527    10.01   0.000     1.522214    1.867978
    1.nsaids |   .8902641   .0788424    -1.31   0.189     .7484036    1.059015
1.~c_disease |   1.769205   .0908499    11.11   0.000     1.599809    1.956536
1.resp_exc~a |   1.535653   .0827059     7.96   0.000     1.381815    1.706618
             |
egfr_cat_n~s |
      30-59  |   1.111913   .0628962     1.88   0.061     .9952264     1.24228
        <30  |   2.804712   .2769685    10.44   0.000     2.311166    3.403654
             |
1.~r_disease |   1.796178   .2641392     3.98   0.000     1.346402    2.396204
             |
   obese4cat |
Obese I ..)  |   .6426573   .0473217    -6.00   0.000     .5562905    .7424329
Obese II..)  |   .8226482    .086055    -1.87   0.062     .6701504    1.009848
Obese II..)  |   .8981707   .1390515    -0.69   0.488     .6630999    1.216575
             |
1.hyperten~n |   1.144138   .0616895     2.50   0.013     1.029399    1.271667
1.cancer_e~r |   2.148766   .1129004    14.56   0.000     1.938498    2.381842
1.neuro_co~s |   1.858554   .1098407    10.49   0.000     1.655271    2.086802
1.flu_vacc~e |   .7556385   .0431206    -4.91   0.000     .6756786    .8450609
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood = -14309.389
Iteration 2:   log likelihood = -14028.274
Iteration 3:   log likelihood = -14013.478
Iteration 4:   log likelihood = -14013.227
Iteration 5:   log likelihood = -14013.227
Refining estimates:
Iteration 0:   log likelihood = -14013.227

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(21)      =     2991.21
Log likelihood  =   -14013.227                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8415628   .0854692    -1.70   0.089     .6896653    1.026915
1.oral_pr~ne |   1.604077   .0901137     8.41   0.000     1.436833    1.790787
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   1.453715   .2145081     2.54   0.011     1.088622     1.94125
             |
   agegroup2 |
     60-<70  |   3.029933   .4104696     8.18   0.000     2.323376     3.95136
     70-<80  |   6.053585   .7695147    14.17   0.000     4.718569    7.766315
        80+  |   14.14473   1.807723    20.73   0.000     11.01056    18.17104
             |
      1.male |   1.048256   .0533153     0.93   0.354     .9487993    1.158138
  1.dmard_pc |   .6934826   .0377889    -6.72   0.000     .6232356    .7716473
    1.nsaids |   .8915144   .0789483    -1.30   0.195     .7494626     1.06049
1.~c_disease |   1.769759   .0908691    11.12   0.000     1.600328     1.95713
1.resp_exc~a |   1.538677   .0828906     8.00   0.000     1.384497    1.710026
             |
egfr_cat_n~s |
      30-59  |   1.111376   .0628716     1.87   0.062     .9947352    1.241693
        <30  |   2.808748   .2773678    10.46   0.000     2.314491    3.408554
             |
1.~r_disease |   1.799951   .2646971     4.00   0.000     1.349226    2.401246
             |
   obese4cat |
Obese I ..)  |   .6429132   .0473431    -6.00   0.000     .5565077    .7427343
Obese II..)  |   .8240029   .0861989    -1.85   0.064     .6712505    1.011516
Obese II..)  |   .8965608   .1388113    -0.71   0.481     .6618982    1.214418
             |
1.hyperten~n |   1.144521   .0617147     2.50   0.012     1.029734    1.272102
1.cancer_e~r |   2.147409   .1128254    14.55   0.000      1.93728     2.38033
1.neuro_co~s |   1.857962   .1098147    10.48   0.000     1.654728    2.086157
1.flu_vacc~e |   .7561209   .0431561    -4.90   0.000      .676096    .8456179
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      6.40
(Assumption: A nested in B)                           Prob > chi2 =    0.0114

-------------------------------------------------------------------------------
-> nsaids = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   135,669      1,452 |   137,121 
           |     98.94       1.06 |    100.00 
-----------+----------------------+----------
       HCQ |    23,667        192 |    23,859 
           |     99.20       0.80 |    100.00 
-----------+----------------------+----------
     Total |   159,336      1,644 |   160,980 
           |     98.98       1.02 |    100.00 

-------------------------------------------------------------------------------
-> nsaids = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,489        125 |    26,614 
           |     99.53       0.47 |    100.00 
-----------+----------------------+----------
       HCQ |     6,621         21 |     6,642 
           |     99.68       0.32 |    100.00 
-----------+----------------------+----------
     Total |    33,110        146 |    33,256 
           |     99.56       0.44 |    100.00 


         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -21758.386
Iteration 2:   log likelihood = -21758.258
Iteration 3:   log likelihood = -21758.258
Refining estimates:
Iteration 0:   log likelihood = -21758.258

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(1)       =       22.79
Log likelihood  =   -21758.258                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7159809   .0522665    -4.58   0.000     .6205316     .826112
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -21703.258
Iteration 2:   log likelihood = -21699.613
Iteration 3:   log likelihood = -21699.559
Iteration 4:   log likelihood = -21699.559
Refining estimates:
Iteration 0:   log likelihood = -21699.559

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(3)       =      140.19
Log likelihood  =   -21699.559                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7507992   .0576556    -3.73   0.000     .6458893    .8727494
    1.nsaids |   .4430362   .0412968    -8.73   0.000     .3690592    .5318418
             |
    exposure#|
      nsaids |
      HCQ#1  |   .8840761   .2192724    -0.50   0.619     .5437145    1.437502
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_int_n
> saids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    117.40
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood =   -21031.3
Iteration 2:   log likelihood = -20797.391
Iteration 3:   log likelihood =  -20726.65
Iteration 4:   log likelihood = -20726.433
Iteration 5:   log likelihood = -20726.433
Refining estimates:
Iteration 0:   log likelihood = -20726.433

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(5)       =     2086.44
Log likelihood  =   -20726.433                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9429719   .0691041    -0.80   0.423     .8168077    1.088623
             |
   agegroup2 |
     60-<70  |   3.765518   .5018808     9.95   0.000     2.899838    4.889627
     70-<80  |   9.596306   1.156512    18.76   0.000     7.577403    12.15312
        80+  |   29.36723   3.439347    28.86   0.000     23.34395    36.94465
             |
      1.male |    1.21727    .060668     3.94   0.000     1.103986    1.342178
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21769.655
Iteration 1:   log likelihood = -21025.615
Iteration 2:   log likelihood = -20790.915
Iteration 3:   log likelihood = -20720.221
Iteration 4:   log likelihood = -20720.005
Iteration 5:   log likelihood = -20720.005
Refining estimates:
Iteration 0:   log likelihood = -20720.005

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(7)       =     2099.30
Log likelihood  =   -20720.005                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9596923    .073921    -0.53   0.593     .8252158    1.116083
    1.nsaids |   .7542752   .0710503    -2.99   0.003     .6271181    .9072152
             |
    exposure#|
      nsaids |
      HCQ#1  |    .891247   .2210734    -0.46   0.643     .5480976    1.449233
             |
   agegroup2 |
     60-<70  |   3.747759   .4995534     9.91   0.000     2.886102    4.866667
     70-<80  |   9.375368   1.131281    18.55   0.000     7.400786    11.87678
        80+  |   28.14081   3.309776    28.37   0.000     22.34717    35.43647
             |
      1.male |   1.216425   .0606264     3.93   0.000     1.103219    1.341248
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     12.86
(Assumption: A nested in B)                           Prob > chi2 =    0.0016

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood =  -14649.87
Iteration 2:   log likelihood = -14419.709
Iteration 3:   log likelihood = -14376.477
Iteration 4:   log likelihood = -14376.366
Iteration 5:   log likelihood = -14376.366
Refining estimates:
Iteration 0:   log likelihood = -14376.366

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(7)       =     2264.94
Log likelihood  =   -14376.366                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9744176   .0722233    -0.35   0.727     .8426642    1.126771
             |
   agegroup2 |
     60-<70  |   3.660907    .488814     9.72   0.000     2.817955    4.756017
     70-<80  |   8.983984    1.08758    18.14   0.000     7.086381    11.38973
        80+  |   26.14429    3.08087    27.70   0.000      20.7525    32.93694
             |
      1.male |   1.222468   .0611452     4.02   0.000     1.108312    1.348381
  1.dmard_pc |   .6034411   .0325238    -9.37   0.000     .5429471    .6706752
1.oral_pr~ne |   1.982758   .0998375    13.59   0.000     1.796426    2.188417
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood = -14645.248
Iteration 2:   log likelihood = -14413.859
Iteration 3:   log likelihood = -14370.693
Iteration 4:   log likelihood = -14370.582
Iteration 5:   log likelihood = -14370.582
Refining estimates:
Iteration 0:   log likelihood = -14370.582

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(9)       =     2276.50
Log likelihood  =   -14370.582                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .992423   .0772527    -0.10   0.922     .8519952    1.155996
    1.nsaids |   .7663845   .0724748    -2.81   0.005     .6367237     .922449
             |
    exposure#|
      nsaids |
      HCQ#1  |   .8817393   .2187823    -0.51   0.612     .5421696    1.433987
             |
   agegroup2 |
     60-<70  |   3.633391   .4852512     9.66   0.000     2.796606    4.720553
     70-<80  |   8.751153   1.061509    17.88   0.000      6.89946    11.09981
        80+  |   24.99973   2.962399    27.16   0.000     19.81848    31.53555
             |
      1.male |   1.221352   .0610894     4.00   0.000       1.1073     1.34715
  1.dmard_pc |   .6076706   .0327756    -9.24   0.000     .5467106    .6754279
1.oral_pr~ne |   1.981925   .0998142    13.58   0.000     1.795638    2.187538
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     11.57
(Assumption: A nested in B)                           Prob > chi2 =    0.0031

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood = -14310.204
Iteration 2:   log likelihood = -14031.365
Iteration 3:   log likelihood = -14016.674
Iteration 4:   log likelihood = -14016.425
Iteration 5:   log likelihood = -14016.425
Refining estimates:
Iteration 0:   log likelihood = -14016.425

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(20)      =     2984.82
Log likelihood  =   -14016.425                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9897097   .0734818    -0.14   0.889     .8556765    1.144738
             |
   agegroup2 |
     60-<70  |     3.0262   .4099461     8.17   0.000      2.32054    3.946446
     70-<80  |   6.053373   .7694652    14.17   0.000     4.718438    7.765986
        80+  |   14.15345   1.808947    20.73   0.000     11.01718    18.18252
             |
      1.male |   1.050353   .0534138     0.97   0.334     .9507115    1.160437
  1.dmard_pc |   .6907991   .0376426    -6.79   0.000     .6208243    .7686611
1.oral_pr~ne |   1.686257   .0880527    10.01   0.000     1.522214    1.867978
    1.nsaids |   .8902641   .0788424    -1.31   0.189     .7484036    1.059015
1.~c_disease |   1.769205   .0908499    11.11   0.000     1.599809    1.956536
1.resp_exc~a |   1.535653   .0827059     7.96   0.000     1.381815    1.706618
             |
egfr_cat_n~s |
      30-59  |   1.111913   .0628962     1.88   0.061     .9952264     1.24228
        <30  |   2.804712   .2769685    10.44   0.000     2.311166    3.403654
             |
1.~r_disease |   1.796178   .2641392     3.98   0.000     1.346402    2.396204
             |
   obese4cat |
Obese I ..)  |   .6426573   .0473217    -6.00   0.000     .5562905    .7424329
Obese II..)  |   .8226482    .086055    -1.87   0.062     .6701504    1.009848
Obese II..)  |   .8981707   .1390515    -0.69   0.488     .6630999    1.216575
             |
1.hyperten~n |   1.144138   .0616895     2.50   0.013     1.029399    1.271667
1.cancer_e~r |   2.148766   .1129004    14.56   0.000     1.938498    2.381842
1.neuro_co~s |   1.858554   .1098407    10.49   0.000     1.655271    2.086802
1.flu_vacc~e |   .7556385   .0431206    -4.91   0.000     .6756786    .8450609
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15508.834
Iteration 1:   log likelihood = -14310.176
Iteration 2:   log likelihood = -14031.202
Iteration 3:   log likelihood = -14016.477
Iteration 4:   log likelihood = -14016.227
Iteration 5:   log likelihood = -14016.226
Refining estimates:
Iteration 0:   log likelihood = -14016.226

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,790
Time at risk    =     22940752
                                                LR chi2(21)      =     2985.22
Log likelihood  =   -14016.226                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.005214   .0783542     0.07   0.947      .862798    1.171137
    1.nsaids |   .9109282   .0867319    -0.98   0.327     .7558558    1.097815
             |
    exposure#|
      nsaids |
      HCQ#1  |   .8572934    .212743    -0.62   0.535     .5271063    1.394314
             |
   agegroup2 |
     60-<70  |   3.023601   .4096132     8.17   0.000     2.318519    3.943106
     70-<80  |   6.047256   .7687212    14.16   0.000     4.713619    7.758223
        80+  |   14.14179   1.807358    20.73   0.000     11.00826    18.16729
             |
      1.male |   1.050038   .0533999     0.96   0.337     .9504231    1.160094
  1.dmard_pc |   .6907082   .0376358    -6.79   0.000     .6207458    .7685559
1.oral_pr~ne |   1.685883    .088035    10.00   0.000     1.521874    1.867568
1.~c_disease |   1.769203   .0908507    11.11   0.000     1.599807    1.956536
1.resp_exc~a |   1.535845   .0827175     7.97   0.000     1.381985    1.706834
             |
egfr_cat_n~s |
      30-59  |   1.111918   .0628978     1.88   0.061     .9952283    1.242289
        <30  |   2.805799   .2770799    10.45   0.000     2.312055    3.404982
             |
1.~r_disease |   1.796711   .2642172     3.98   0.000     1.346803    2.396915
             |
   obese4cat |
Obese I ..)  |   .6428244   .0473347    -6.00   0.000     .5564341    .7426275
Obese II..)  |   .8224211   .0860321    -1.87   0.062      .669964    1.009571
Obese II..)  |   .8985899   .1391159    -0.69   0.490     .6634101    1.217141
             |
1.hyperten~n |   1.144093   .0616858     2.50   0.013      1.02936    1.271614
1.cancer_e~r |   2.148858   .1129061    14.56   0.000      1.93858    2.381946
1.neuro_co~s |     1.8589   .1098622    10.49   0.000     1.655577    2.087193
1.flu_vacc~e |   .7554983   .0431153    -4.91   0.000     .6755484      .84491
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.40
(Assumption: A nested in B)                           Prob > chi2 =    0.5290

. 
. 
. 
. 
. 
. 
. /* Print interaction table===================================================
> =*/ 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table3.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 3: Interactions with HCQ use on risk of $tabl
> eoutcome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab _tab ("Age/
> Sex Adjusted") _tab _tab _tab  ///
>                                                 ("DAG Adjusted") _tab _tab _t
> ab ("Fully Adjusted") _tab _tab _tab _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("p (interactio
> n)") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("p (interact
> ion)") _tab ("HR") _tab ("95% CI") _tab ("p (interaction)") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab (
> "p (interaction)") _tab _n

. 
.                                                 
. * Generic program to print model for a level of another variable 
. cap prog drop printinteraction

. prog define printinteraction 
  1. syntax, variable(varname) min(real) max(real) 
  2. 
. * Overall p-values 
. 
. file write tablecontent ("`variable'") _tab _tab _tab _tab ("${univar_p_`vari
> able'}") ///
>                                                 _tab _tab _tab ("${multivar1_
> p_`variable'}") /// 
>                                                 _tab _tab _tab ("${multivar2_
> p_`variable'}") ///
>                                                 _tab _tab _tab ("${multivar3_
> p_`variable'}") _n
  3.         forvalues varlevel = `min'/`max'{ 
  4. 
.                 * Row headings 
.                                                         
.                 file write tablecontent ("`varlevel'") _n       
  5. 
.                 local lab0: label exposure 0
  6.                 local lab1: label exposure 1
  7.                  
.                 /* Counts */
.                         
.                 * First row, exposure = 0 (reference)
.                 
.         file write tablecontent ("`lab0'") _tab
  8. 
.                         cou if exposure == 0 & `variable' == `varlevel'
  9.                         local rowdenom = r(N)
 10.                         cou if exposure == 0  & `variable' == `varlevel' &
>  $outcome == 1
 11.                         local pct = 100*(r(N)/`rowdenom')
 12.                         
.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 13.                 file write tablecontent ("1.00 (ref)") _tab _tab _tab ("1.
> 00 (ref)") _tab _tab _tab ("1.00 (ref)") _tab _tab _tab ("1.00 (ref)") _n
 14.                         
.                 * Second row, exposure = 1 (comparator)
. 
.                 file write tablecontent ("`lab1'") _tab  
 15. 
.                         cou if exposure == 1 & `variable' == `varlevel'
 16.                         local rowdenom = r(N)
 17.                         cou if exposure == 1 & `variable' == `varlevel' & 
> $outcome == 1
 18.                         local pct = 100*(r(N)/`rowdenom')
 19.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 20. 
.                 * Print models 
.                 estimates use $Tempdir/univar_int_`variable' 
 21.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 22.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 23. 
.                 estimates use $Tempdir/multivar1_int_`variable'
 24.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 25.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 26. 
.                 estimates use $Tempdir/multivar2_int_`variable'
 27.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 28.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab 
 29.         
.                 estimates use $Tempdir/multivar3_int_`variable'
 30.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 31.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _n
 32.         } 
 33.                 
. end

. 
. printinteraction, variable(agegroup2) min(3) max(6) 
  57,621
  67
  12,492
  12
  37,655
  162
  7,962
  34
  41,976
  463
  7,125
  77
  26,483
  885
  2,922
  90

. file write tablecontent _n _n

. 
. printinteraction, variable(dmard_pc) min(0) max(1) 
  108,097
  1,175
  14,797
  117
  55,638
  402
  15,704
  96

. file write tablecontent _n _n

.   
. printinteraction, variable(oral_prednisolone) min(0) max(1) 
  137,008
  1,074
  23,635
  109
  26,727
  503
  6,866
  104

. file write tablecontent _n _n

. 
. printinteraction, variable(nsaids) min(0) max(1) 
  137,121
  1,452
  23,859
  192
  26,614
  125
  6,642
  21

. 
. 
. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\07_an_mod
> els_interact.log
  log type:  text
 closed on:  19 Jul 2020, 18:25:10
-------------------------------------------------------------------------------
