-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\07_an_mod
> els_interact.log
  log type:  text
 opened on:  21 Jul 2020, 13:26:46

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* So few deaths occuring below 60 years this cannot be used as a category, s
> o combining 18-59 */ 
. gen agegroup2 = agegroup

. recode agegroup2(1 = 2)
(agegroup2: 13686 changes made)

. recode agegroup2(2 = 3)
(agegroup2: 33097 changes made)

. tab agegroup2, nolabel 

  agegroup2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     70,116       36.09       36.09
          4 |     45,635       23.49       59.58
          5 |     49,115       25.28       84.86
          6 |     29,420       15.14      100.00
------------+-----------------------------------
      Total |    194,286      100.00

. 
. label define agegroup2  3 "18-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup2 agegroup2

. tab agegroup agegroup2 , m

   Grouped |                  agegroup2
       age |    18-<60     60-<70     70-<80        80+ |     Total
-----------+--------------------------------------------+----------
    18-<40 |    13,686          0          0          0 |    13,686 
    40-<50 |    19,411          0          0          0 |    19,411 
    50-<60 |    37,019          0          0          0 |    37,019 
    60-<70 |         0     45,635          0          0 |    45,635 
    70-<80 |         0          0     49,115          0 |    49,115 
       80+ |         0          0          0     29,420 |    29,420 
-----------+--------------------------------------------+----------
     Total |    70,116     45,635     49,115     29,420 |   194,286 

. 
. 
. foreach intvar of varlist agegroup2 dmard_pc oral_prednisolone nsaids {
  2. /* Check Counts */ 
. 
. bysort `intvar': tab exposure $outcome, row
  3. 
. /* Univariable model */ 
. stcox i.exposure
  4. estimates store A
  5. 
. stcox i.exposure##i.`intvar'
  6. estimates store B
  7. estimates save $Tempdir/univar_int_`intvar', replace 
  8. 
. lrtest A B
  9. global univar_p_`intvar' = round(r(p),0.001)
 10. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. stcox i.exposure i.agegroup2 i.male
 11. estimates store A
 12. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male
 13. estimates store B
 14. estimates save $Tempdir/multivar1_int_`intvar', replace 
 15. 
. lrtest A B
 16. global multivar1_p_`intvar' = round(r(p),0.001)
 17. 
. * DAG Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone, strata(st
> p population)                                      
 18.                                                                           
>       
. estimates store A
 19. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e, strata(stp population)                  
 20. estimates store B
 21. estimates save $Tempdir/multivar2_int_`intvar', replace 
 22. 
. lrtest A B
 23. global multivar2_p_`intvar' = round(r(p),0.001)
 24. 
. * Fully Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone i.nsaids i
> .chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_liver
> _disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu_va
> ccine, strata(stp population)
 25. estimates store A
 26. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.c
> hronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditi
> ons i.flu_vaccine, strata(stp population)
 27. estimates store B
 28. estimates save $Tempdir/multivar3_int_`intvar', replace 
 29. 
. lrtest A B
 30. global multivar3_p_`intvar' = round(r(p),0.001)
 31. 
. }

-------------------------------------------------------------------------------
-> agegroup2 = 18-<60

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    57,556         67 |    57,623 
           |     99.88       0.12 |    100.00 
-----------+----------------------+----------
       HCQ |    12,481         12 |    12,493 
           |     99.90       0.10 |    100.00 
-----------+----------------------+----------
     Total |    70,037         79 |    70,116 
           |     99.89       0.11 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 60-<70

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    37,507        162 |    37,669 
           |     99.57       0.43 |    100.00 
-----------+----------------------+----------
       HCQ |     7,932         34 |     7,966 
           |     99.57       0.43 |    100.00 
-----------+----------------------+----------
     Total |    45,439        196 |    45,635 
           |     99.57       0.43 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 70-<80

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    41,525        463 |    41,988 
           |     98.90       1.10 |    100.00 
-----------+----------------------+----------
       HCQ |     7,050         77 |     7,127 
           |     98.92       1.08 |    100.00 
-----------+----------------------+----------
     Total |    48,575        540 |    49,115 
           |     98.90       1.10 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 80+

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    25,610        884 |    26,494 
           |     96.66       3.34 |    100.00 
-----------+----------------------+----------
       HCQ |     2,836         90 |     2,926 
           |     96.92       3.08 |    100.00 
-----------+----------------------+----------
     Total |    28,446        974 |    29,420 
           |     96.69       3.31 |    100.00 


         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood = -21746.725
Iteration 2:   log likelihood = -21746.598
Iteration 3:   log likelihood = -21746.598
Refining estimates:
Iteration 0:   log likelihood = -21746.598

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(1)       =       22.72
Log likelihood  =   -21746.598                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7163493   .0522953    -4.57   0.000     .6208475    .8265416
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood = -21031.289
Iteration 2:   log likelihood = -20794.967
Iteration 3:   log likelihood = -20723.958
Iteration 4:   log likelihood = -20723.729
Iteration 5:   log likelihood = -20723.729
Refining estimates:
Iteration 0:   log likelihood = -20723.729

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(7)       =     2068.46
Log likelihood  =   -20723.729                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8113525   .2543286    -0.67   0.505     .4389245    1.499786
             |
   agegroup2 |
     60-<70  |   3.676505   .5340206     8.96   0.000     2.765643    4.887357
     70-<80  |   9.430327   1.232642    17.17   0.000     7.299043    12.18394
        80+  |   28.87269   3.658595    26.54   0.000     22.52306    37.01238
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   1.210699   .4429296     0.52   0.601     .5910546    2.479962
 HCQ#70-<80  |   1.199417   .4039126     0.54   0.589     .6199002    2.320698
    HCQ#80+  |   1.130221   .3757047     0.37   0.713     .5891278    2.168289
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_int_a
> gegroup2.ster saved

Likelihood-ratio test                                 LR chi2(6)  =   2045.74
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood =  -21020.22
Iteration 2:   log likelihood = -20786.473
Iteration 3:   log likelihood = -20716.486
Iteration 4:   log likelihood = -20716.274
Iteration 5:   log likelihood = -20716.273
Refining estimates:
Iteration 0:   log likelihood = -20716.273

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(5)       =     2083.37
Log likelihood  =   -20716.273                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9430205   .0691094    -0.80   0.423     .8168468    1.088683
             |
   agegroup2 |
     60-<70  |   3.763992   .5016778     9.94   0.000     2.898662    4.887646
     70-<80  |   9.593493   1.156174    18.76   0.000      7.57518    12.14956
        80+  |   29.32052   3.434006    28.84   0.000     23.30662    36.88621
             |
      1.male |   1.218076   .0607167     3.96   0.000     1.104702    1.343086
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood = -21023.585
Iteration 2:   log likelihood = -20787.243
Iteration 3:   log likelihood = -20716.307
Iteration 4:   log likelihood = -20716.079
Iteration 5:   log likelihood = -20716.079
Refining estimates:
Iteration 0:   log likelihood = -20716.079

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(8)       =     2083.76
Log likelihood  =   -20716.079                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8307218   .2604522    -0.59   0.554     .4493477    1.535779
             |
   agegroup2 |
     60-<70  |   3.657489   .5312818     8.93   0.000     2.751305     4.86214
     70-<80  |   9.352895   1.222687    17.10   0.000     7.238858    12.08432
        80+  |   28.80802    3.65044    26.52   0.000     22.47255    36.92957
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   1.192561   .4363202     0.48   0.630     .5821741    2.442914
 HCQ#70-<80  |   1.177003   .3964086     0.48   0.628     .6082708    2.277497
    HCQ#80+  |   1.103044   .3667398     0.29   0.768      .574891    2.116412
             |
      1.male |   1.217953   .0607228     3.95   0.000     1.104568    1.342976
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.39
(Assumption: A nested in B)                           Prob > chi2 =    0.9424

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14644.332
Iteration 2:   log likelihood = -14414.601
Iteration 3:   log likelihood = -14371.973
Iteration 4:   log likelihood = -14371.864
Iteration 5:   log likelihood = -14371.864
Refining estimates:
Iteration 0:   log likelihood = -14371.864

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(7)       =     2261.60
Log likelihood  =   -14371.864                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9744199   .0722212    -0.35   0.727       .84267    1.126769
             |
   agegroup2 |
     60-<70  |   3.656358   .4882036     9.71   0.000     2.814457    4.750099
     70-<80  |   8.974226   1.086388    18.13   0.000       7.0787    11.37733
        80+  |   26.07472   3.072706    27.67   0.000     20.69722    32.84938
             |
      1.male |    1.22333   .0611967     4.03   0.000      1.10908    1.349351
  1.dmard_pc |   .6033449   .0325194    -9.37   0.000     .5428591    .6705701
1.oral_pr~ne |   1.985275   .0999802    13.62   0.000     1.798678     2.19123
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14644.997
Iteration 2:   log likelihood = -14414.716
Iteration 3:   log likelihood = -14371.778
Iteration 4:   log likelihood = -14371.664
Iteration 5:   log likelihood = -14371.664
Refining estimates:
Iteration 0:   log likelihood = -14371.664

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(10)      =     2262.00
Log likelihood  =   -14371.664                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8903637   .2798559    -0.37   0.712     .4808624    1.648595
             |
   agegroup2 |
     60-<70  |   3.562848   .5182433     8.73   0.000     2.679067    4.738174
     70-<80  |   8.807045   1.155458    16.58   0.000     6.810126    11.38952
        80+  |   25.79633   3.284243    25.53   0.000     20.09961    33.10763
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   1.172908   .4293697     0.44   0.663      .572351    2.403619
 HCQ#70-<80  |   1.130551   .3811456     0.36   0.716     .5838786    2.189062
    HCQ#80+  |   1.054399   .3509928     0.16   0.874     .5491027    2.024681
             |
      1.male |   1.223455    .061215     4.03   0.000     1.109171    1.349514
  1.dmard_pc |   .6033593   .0325302    -9.37   0.000     .5428545    .6706079
1.oral_pr~ne |    1.98602   .1000243    13.62   0.000     1.799341    2.192066
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.40
(Assumption: A nested in B)                           Prob > chi2 =    0.9401

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14304.706
Iteration 2:   log likelihood = -14026.404
Iteration 3:   log likelihood = -14011.729
Iteration 4:   log likelihood =  -14011.48
Iteration 5:   log likelihood =  -14011.48
Refining estimates:
Iteration 0:   log likelihood =  -14011.48

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(20)      =     2982.37
Log likelihood  =    -14011.48                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9900537   .0735051    -0.13   0.893     .8559778     1.14513
             |
   agegroup2 |
     60-<70  |   3.024362   .4096862     8.17   0.000     2.319147    3.944021
     70-<80  |   6.051178   .7691664    14.16   0.000     4.716758    7.763121
        80+  |   14.12756   1.805642    20.72   0.000     10.99703    18.14927
             |
      1.male |   1.051902   .0534976     0.99   0.320     .9521051    1.162159
  1.dmard_pc |   .6908775   .0376485    -6.79   0.000     .6208918    .7687518
1.oral_pr~ne |   1.687837   .0881607    10.02   0.000     1.523596    1.869784
    1.nsaids |   .8893454   .0787577    -1.32   0.185     .7476367    1.057914
1.~c_disease |   1.771613   .0909952    11.13   0.000     1.601949    1.959247
1.resp_exc~a |   1.535518   .0827212     7.96   0.000     1.381654    1.706517
             |
egfr_cat_n~s |
      30-59  |   1.109816   .0628173     1.84   0.066     .9932795    1.240024
        <30  |   2.810287   .2774863    10.46   0.000     2.315813    3.410342
             |
1.~r_disease |   1.797404   .2643134     3.99   0.000      1.34733    2.397824
             |
   obese4cat |
Obese I ..)  |   .6436158   .0473961    -5.98   0.000     .5571138    .7435488
Obese II..)  |   .8242868   .0862343    -1.85   0.065     .6714726    1.011879
Obese II..)  |   .8981616   .1390592    -0.69   0.488       .66308    1.216587
             |
1.hyperten~n |   1.142983   .0616365     2.48   0.013     1.028342    1.270403
1.cancer_e~r |   2.148125   .1128937    14.55   0.000     1.937871    2.381189
1.neuro_co~s |   1.860555    .109967    10.50   0.000      1.65704    2.089067
1.flu_vacc~e |   .7545449   .0430625    -4.93   0.000     .6746931    .8438473
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14304.721
Iteration 2:   log likelihood = -14026.296
Iteration 3:   log likelihood = -14011.566
Iteration 4:   log likelihood = -14011.308
Iteration 5:   log likelihood = -14011.308
Iteration 6:   log likelihood = -14011.308
Refining estimates:
Iteration 0:   log likelihood = -14011.308

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(23)      =     2982.71
Log likelihood  =   -14011.308                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8964712   .2819153    -0.35   0.728      .484013    1.660411
             |
   agegroup2 |
     60-<70  |   2.949685   .4345111     7.34   0.000     2.209974    3.936988
     70-<80  |   5.928323   .8120746    12.99   0.000     4.532444    7.754098
        80+  |   13.94803   1.907396    19.27   0.000     10.66868    18.23538
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   1.166321   .4269963     0.42   0.674     .5691001    2.390273
 HCQ#70-<80  |    1.14208   .3851193     0.39   0.694     .5897447    2.211715
    HCQ#80+  |   1.069408   .3561458     0.20   0.840     .5567584    2.054091
             |
      1.male |   1.051895   .0535091     0.99   0.320     .9520777    1.162177
  1.dmard_pc |   .6909281   .0376606    -6.78   0.000     .6209207    .7688286
1.oral_pr~ne |   1.688521   .0882065    10.03   0.000     1.524195    1.870563
    1.nsaids |   .8893467   .0787709    -1.32   0.186     .7476163    1.057946
1.~c_disease |   1.771901   .0910124    11.14   0.000     1.602205     1.95957
1.resp_exc~a |   1.535428   .0827189     7.96   0.000     1.381568    1.706423
             |
egfr_cat_n~s |
      30-59  |       1.11   .0628271     1.84   0.065     .9934458    1.240229
        <30  |   2.809053   .2773918    10.46   0.000     2.314752     3.40891
             |
1.~r_disease |    1.79773   .2643658     3.99   0.000     1.347569    2.398271
             |
   obese4cat |
Obese I ..)  |   .6435726    .047393    -5.98   0.000     .5570764     .743499
Obese II..)  |   .8243909   .0862463    -1.85   0.065     .6715557    1.012009
Obese II..)  |   .8977429    .139002    -0.70   0.486     .6627598     1.21604
             |
1.hyperten~n |   1.143217   .0616533     2.48   0.013     1.028546    1.270673
1.cancer_e~r |   2.148319   .1129059    14.55   0.000     1.938043    2.381409
1.neuro_co~s |   1.860119   .1099583    10.50   0.000     1.656621    2.088615
1.flu_vacc~e |   .7544512   .0430745    -4.94   0.000      .674579    .8437805
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.34
(Assumption: A nested in B)                           Prob > chi2 =    0.9515

-------------------------------------------------------------------------------
-> dmard_pc = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   106,940      1,174 |   108,114 
           |     98.91       1.09 |    100.00 
-----------+----------------------+----------
       HCQ |    14,683        117 |    14,800 
           |     99.21       0.79 |    100.00 
-----------+----------------------+----------
     Total |   121,623      1,291 |   122,914 
           |     98.95       1.05 |    100.00 

-------------------------------------------------------------------------------
-> dmard_pc = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    55,258        402 |    55,660 
           |     99.28       0.72 |    100.00 
-----------+----------------------+----------
       HCQ |    15,616         96 |    15,712 
           |     99.39       0.61 |    100.00 
-----------+----------------------+----------
     Total |    70,874        498 |    71,372 
           |     99.30       0.70 |    100.00 


         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood = -21746.725
Iteration 2:   log likelihood = -21746.598
Iteration 3:   log likelihood = -21746.598
Refining estimates:
Iteration 0:   log likelihood = -21746.598

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(1)       =       22.72
Log likelihood  =   -21746.598                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7163493   .0522953    -4.57   0.000     .6208475    .8265416
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood = -21717.837
Iteration 2:   log likelihood = -21717.647
Iteration 3:   log likelihood = -21717.647
Refining estimates:
Iteration 0:   log likelihood = -21717.647

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(3)       =       80.62
Log likelihood  =   -21717.647                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7182695   .0696344    -3.41   0.001     .5939715     .868579
  1.dmard_pc |   .6617716   .0382419    -7.14   0.000     .5909077    .7411338
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   1.165987   .1741307     1.03   0.304     .8701085    1.562477
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_int_d
> mard_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     57.90
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood =  -21020.22
Iteration 2:   log likelihood = -20786.473
Iteration 3:   log likelihood = -20716.486
Iteration 4:   log likelihood = -20716.274
Iteration 5:   log likelihood = -20716.273
Refining estimates:
Iteration 0:   log likelihood = -20716.273

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(5)       =     2083.37
Log likelihood  =   -20716.273                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9430205   .0691094    -0.80   0.423     .8168468    1.088683
             |
   agegroup2 |
     60-<70  |   3.763992   .5016778     9.94   0.000     2.898662    4.887646
     70-<80  |   9.593493   1.156174    18.76   0.000      7.57518    12.14956
        80+  |   29.32052   3.434006    28.84   0.000     23.30662    36.88621
             |
      1.male |   1.218076   .0607167     3.96   0.000     1.104702    1.343086
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood = -20979.538
Iteration 2:   log likelihood = -20745.771
Iteration 3:   log likelihood = -20676.232
Iteration 4:   log likelihood = -20676.022
Iteration 5:   log likelihood = -20676.022
Refining estimates:
Iteration 0:   log likelihood = -20676.022

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(7)       =     2163.87
Log likelihood  =   -20676.022                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9196123   .0893372    -0.86   0.388     .7601747     1.11249
  1.dmard_pc |   .6125407   .0354828    -8.46   0.000     .5467982    .6861874
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   1.257782   .1878682     1.54   0.125     .9385684    1.685562
             |
   agegroup2 |
     60-<70  |   3.917764   .5224161    10.24   0.000     3.016716    5.087942
     70-<80  |    10.0594   1.213206    19.14   0.000     7.941702     12.7418
        80+  |   29.94766   3.507527    29.02   0.000     23.80502    37.67535
             |
      1.male |   1.242891   .0620234     4.36   0.000     1.127083    1.370598
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     80.50
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14644.332
Iteration 2:   log likelihood = -14414.601
Iteration 3:   log likelihood = -14371.973
Iteration 4:   log likelihood = -14371.864
Iteration 5:   log likelihood = -14371.864
Refining estimates:
Iteration 0:   log likelihood = -14371.864

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(7)       =     2261.60
Log likelihood  =   -14371.864                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9744199   .0722212    -0.35   0.727       .84267    1.126769
             |
   agegroup2 |
     60-<70  |   3.656358   .4882036     9.71   0.000     2.814457    4.750099
     70-<80  |   8.974226   1.086388    18.13   0.000       7.0787    11.37733
        80+  |   26.07472   3.072706    27.67   0.000     20.69722    32.84938
             |
      1.male |    1.22333   .0611967     4.03   0.000      1.10908    1.349351
  1.dmard_pc |   .6033449   .0325194    -9.37   0.000     .5428591    .6705701
1.oral_pr~ne |   1.985275   .0999802    13.62   0.000     1.798678     2.19123
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14643.029
Iteration 2:   log likelihood = -14413.127
Iteration 3:   log likelihood = -14370.379
Iteration 4:   log likelihood = -14370.271
Iteration 5:   log likelihood = -14370.271
Refining estimates:
Iteration 0:   log likelihood = -14370.271

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(8)       =     2264.79
Log likelihood  =   -14370.271                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8751574   .0855816    -1.36   0.173     .7225155    1.060047
  1.dmard_pc |   .5802782   .0339882    -9.29   0.000     .5173441    .6508681
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   1.307427   .1956299     1.79   0.073     .9751076    1.753002
             |
   agegroup2 |
     60-<70  |   3.659761   .4886586     9.72   0.000     2.817076    4.754522
     70-<80  |   8.994825   1.088907    18.15   0.000     7.094909    11.40351
        80+  |   26.12566   3.078807    27.69   0.000      20.7375     32.9138
             |
      1.male |   1.222295   .0611444     4.01   0.000     1.108142    1.348208
1.oral_pr~ne |   1.990618   .1002762    13.67   0.000     1.803471    2.197185
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      3.19
(Assumption: A nested in B)                           Prob > chi2 =    0.0742

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14304.706
Iteration 2:   log likelihood = -14026.404
Iteration 3:   log likelihood = -14011.729
Iteration 4:   log likelihood =  -14011.48
Iteration 5:   log likelihood =  -14011.48
Refining estimates:
Iteration 0:   log likelihood =  -14011.48

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(20)      =     2982.37
Log likelihood  =    -14011.48                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9900537   .0735051    -0.13   0.893     .8559778     1.14513
             |
   agegroup2 |
     60-<70  |   3.024362   .4096862     8.17   0.000     2.319147    3.944021
     70-<80  |   6.051178   .7691664    14.16   0.000     4.716758    7.763121
        80+  |   14.12756   1.805642    20.72   0.000     10.99703    18.14927
             |
      1.male |   1.051902   .0534976     0.99   0.320     .9521051    1.162159
  1.dmard_pc |   .6908775   .0376485    -6.79   0.000     .6208918    .7687518
1.oral_pr~ne |   1.687837   .0881607    10.02   0.000     1.523596    1.869784
    1.nsaids |   .8893454   .0787577    -1.32   0.185     .7476367    1.057914
1.~c_disease |   1.771613   .0909952    11.13   0.000     1.601949    1.959247
1.resp_exc~a |   1.535518   .0827212     7.96   0.000     1.381654    1.706517
             |
egfr_cat_n~s |
      30-59  |   1.109816   .0628173     1.84   0.066     .9932795    1.240024
        <30  |   2.810287   .2774863    10.46   0.000     2.315813    3.410342
             |
1.~r_disease |   1.797404   .2643134     3.99   0.000      1.34733    2.397824
             |
   obese4cat |
Obese I ..)  |   .6436158   .0473961    -5.98   0.000     .5571138    .7435488
Obese II..)  |   .8242868   .0862343    -1.85   0.065     .6714726    1.011879
Obese II..)  |   .8981616   .1390592    -0.69   0.488       .66308    1.216587
             |
1.hyperten~n |   1.142983   .0616365     2.48   0.013     1.028342    1.270403
1.cancer_e~r |   2.148125   .1128937    14.55   0.000     1.937871    2.381189
1.neuro_co~s |   1.860555    .109967    10.50   0.000      1.65704    2.089067
1.flu_vacc~e |   .7545449   .0430625    -4.93   0.000     .6746931    .8438473
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14303.303
Iteration 2:   log likelihood = -14025.169
Iteration 3:   log likelihood = -14010.506
Iteration 4:   log likelihood = -14010.258
Iteration 5:   log likelihood = -14010.258
Refining estimates:
Iteration 0:   log likelihood = -14010.258

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(21)      =     2984.81
Log likelihood  =   -14010.258                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .900476   .0881614    -1.07   0.284     .7432501    1.090961
  1.dmard_pc |    .667494   .0394757    -6.84   0.000     .5944389    .7495275
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   1.264578   .1892843     1.57   0.117     .9430531    1.695723
             |
   agegroup2 |
     60-<70  |   3.026224   .4099334     8.17   0.000     2.320582    3.946437
     70-<80  |    6.05944   .7702077    14.17   0.000      4.72321    7.773697
        80+  |   14.14488   1.807828    20.73   0.000     11.01055    18.17145
             |
      1.male |   1.051051    .053452     0.98   0.328     .9513387    1.161214
1.oral_pr~ne |   1.691513    .088387    10.06   0.000     1.526854     1.87393
    1.nsaids |   .8901438   .0788313    -1.31   0.189     .7483032     1.05887
1.~c_disease |   1.770933   .0909638    11.13   0.000     1.601328    1.958502
1.resp_exc~a |   1.535498   .0827336     7.96   0.000     1.381611    1.706524
             |
egfr_cat_n~s |
      30-59  |   1.110744   .0628685     1.86   0.064     .9941132    1.241059
        <30  |   2.808675   .2773356    10.46   0.000     2.314471    3.408405
             |
1.~r_disease |   1.797966   .2643987     3.99   0.000     1.347748    2.398581
             |
   obese4cat |
Obese I ..)  |   .6437137   .0474038    -5.98   0.000     .5571976    .7436631
Obese II..)  |   .8236699    .086167    -1.85   0.064     .6709745    1.011115
Obese II..)  |   .8973072   .1389273    -0.70   0.484     .6624486     1.21543
             |
1.hyperten~n |   1.143197   .0616534     2.48   0.013     1.028526    1.270653
1.cancer_e~r |   2.147924   .1128836    14.55   0.000      1.93769    2.380969
1.neuro_co~s |   1.859335   .1099083    10.49   0.000     1.655929    2.087726
1.flu_vacc~e |   .7558817   .0431459    -4.90   0.000     .6758761    .8453579
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      2.44
(Assumption: A nested in B)                           Prob > chi2 =    0.1179

-------------------------------------------------------------------------------
-> oral_prednisolone = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   135,969      1,073 |   137,042 
           |     99.22       0.78 |    100.00 
-----------+----------------------+----------
       HCQ |    23,534        109 |    23,643 
           |     99.54       0.46 |    100.00 
-----------+----------------------+----------
     Total |   159,503      1,182 |   160,685 
           |     99.26       0.74 |    100.00 

-------------------------------------------------------------------------------
-> oral_prednisolone = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,229        503 |    26,732 
           |     98.12       1.88 |    100.00 
-----------+----------------------+----------
       HCQ |     6,765        104 |     6,869 
           |     98.49       1.51 |    100.00 
-----------+----------------------+----------
     Total |    32,994        607 |    33,601 
           |     98.19       1.81 |    100.00 


         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood = -21746.725
Iteration 2:   log likelihood = -21746.598
Iteration 3:   log likelihood = -21746.598
Refining estimates:
Iteration 0:   log likelihood = -21746.598

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(1)       =       22.72
Log likelihood  =   -21746.598                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7163493   .0522953    -4.57   0.000     .6208475    .8265416
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood = -21611.714
Iteration 2:   log likelihood = -21592.455
Iteration 3:   log likelihood = -21592.419
Refining estimates:
Iteration 0:   log likelihood = -21592.419

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(3)       =      331.08
Log likelihood  =   -21592.419                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .5815981   .0584681    -5.39   0.000      .477586    .7082626
1.oral_pr~ne |   2.427942   .1312001    16.42   0.000     2.183944    2.699201
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   1.361006   .2005337     2.09   0.036     1.019629    1.816678
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_int_o
> ral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    308.36
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood =  -21020.22
Iteration 2:   log likelihood = -20786.473
Iteration 3:   log likelihood = -20716.486
Iteration 4:   log likelihood = -20716.274
Iteration 5:   log likelihood = -20716.273
Refining estimates:
Iteration 0:   log likelihood = -20716.273

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(5)       =     2083.37
Log likelihood  =   -20716.273                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9430205   .0691094    -0.80   0.423     .8168468    1.088683
             |
   agegroup2 |
     60-<70  |   3.763992   .5016778     9.94   0.000     2.898662    4.887646
     70-<80  |   9.593493   1.156174    18.76   0.000      7.57518    12.14956
        80+  |   29.32052   3.434006    28.84   0.000     23.30662    36.88621
             |
      1.male |   1.218076   .0607167     3.96   0.000     1.104702    1.343086
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood = -20950.323
Iteration 2:   log likelihood = -20698.013
Iteration 3:   log likelihood = -20627.646
Iteration 4:   log likelihood = -20627.438
Iteration 5:   log likelihood = -20627.438
Refining estimates:
Iteration 0:   log likelihood = -20627.438

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(7)       =     2261.04
Log likelihood  =   -20627.438                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7577874   .0763602    -2.75   0.006     .6219767     .923253
1.oral_pr~ne |   1.881312   .1019129    11.67   0.000     1.691805    2.092047
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   1.480865   .2182101     2.66   0.008       1.1094    1.976709
             |
   agegroup2 |
     60-<70  |   3.640367   .4853732     9.69   0.000     2.803198    4.727555
     70-<80  |   8.980616   1.083724    18.19   0.000     7.089058    11.37689
        80+  |   27.00861   3.169285    28.09   0.000     21.45948    33.99266
             |
      1.male |   1.211366   .0603842     3.85   0.000     1.098613    1.335691
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    177.67
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14644.332
Iteration 2:   log likelihood = -14414.601
Iteration 3:   log likelihood = -14371.973
Iteration 4:   log likelihood = -14371.864
Iteration 5:   log likelihood = -14371.864
Refining estimates:
Iteration 0:   log likelihood = -14371.864

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(7)       =     2261.60
Log likelihood  =   -14371.864                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9744199   .0722212    -0.35   0.727       .84267    1.126769
             |
   agegroup2 |
     60-<70  |   3.656358   .4882036     9.71   0.000     2.814457    4.750099
     70-<80  |   8.974226   1.086388    18.13   0.000       7.0787    11.37733
        80+  |   26.07472   3.072706    27.67   0.000     20.69722    32.84938
             |
      1.male |    1.22333   .0611967     4.03   0.000      1.10908    1.349351
  1.dmard_pc |   .6033449   .0325194    -9.37   0.000     .5428591    .6705701
1.oral_pr~ne |   1.985275   .0999802    13.62   0.000     1.798678     2.19123
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14641.569
Iteration 2:   log likelihood = -14411.197
Iteration 3:   log likelihood = -14368.799
Iteration 4:   log likelihood = -14368.691
Iteration 5:   log likelihood = -14368.691
Refining estimates:
Iteration 0:   log likelihood = -14368.691

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(8)       =     2267.95
Log likelihood  =   -14368.691                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8291834   .0841003    -1.85   0.065     .6796997    1.011543
1.oral_pr~ne |   1.889917   .1027643    11.71   0.000     1.698864    2.102455
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   1.451506   .2141386     2.53   0.012     1.087032    1.938186
             |
   agegroup2 |
     60-<70  |   3.663248   .4891423     9.72   0.000     2.819733    4.759098
     70-<80  |   8.981311   1.087237    18.13   0.000     7.084302    11.38629
        80+  |    26.0834   3.073378    27.68   0.000     20.70466    32.85945
             |
      1.male |   1.221749   .0611187     4.00   0.000     1.107644    1.347609
  1.dmard_pc |   .6057683   .0326469    -9.30   0.000      .545045    .6732568
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      6.35
(Assumption: A nested in B)                           Prob > chi2 =    0.0118

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14304.706
Iteration 2:   log likelihood = -14026.404
Iteration 3:   log likelihood = -14011.729
Iteration 4:   log likelihood =  -14011.48
Iteration 5:   log likelihood =  -14011.48
Refining estimates:
Iteration 0:   log likelihood =  -14011.48

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(20)      =     2982.37
Log likelihood  =    -14011.48                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9900537   .0735051    -0.13   0.893     .8559778     1.14513
             |
   agegroup2 |
     60-<70  |   3.024362   .4096862     8.17   0.000     2.319147    3.944021
     70-<80  |   6.051178   .7691664    14.16   0.000     4.716758    7.763121
        80+  |   14.12756   1.805642    20.72   0.000     10.99703    18.14927
             |
      1.male |   1.051902   .0534976     0.99   0.320     .9521051    1.162159
  1.dmard_pc |   .6908775   .0376485    -6.79   0.000     .6208918    .7687518
1.oral_pr~ne |   1.687837   .0881607    10.02   0.000     1.523596    1.869784
    1.nsaids |   .8893454   .0787577    -1.32   0.185     .7476367    1.057914
1.~c_disease |   1.771613   .0909952    11.13   0.000     1.601949    1.959247
1.resp_exc~a |   1.535518   .0827212     7.96   0.000     1.381654    1.706517
             |
egfr_cat_n~s |
      30-59  |   1.109816   .0628173     1.84   0.066     .9932795    1.240024
        <30  |   2.810287   .2774863    10.46   0.000     2.315813    3.410342
             |
1.~r_disease |   1.797404   .2643134     3.99   0.000      1.34733    2.397824
             |
   obese4cat |
Obese I ..)  |   .6436158   .0473961    -5.98   0.000     .5571138    .7435488
Obese II..)  |   .8242868   .0862343    -1.85   0.065     .6714726    1.011879
Obese II..)  |   .8981616   .1390592    -0.69   0.488       .66308    1.216587
             |
1.hyperten~n |   1.142983   .0616365     2.48   0.013     1.028342    1.270403
1.cancer_e~r |   2.148125   .1128937    14.55   0.000     1.937871    2.381189
1.neuro_co~s |   1.860555    .109967    10.50   0.000      1.65704    2.089067
1.flu_vacc~e |   .7545449   .0430625    -4.93   0.000     .6746931    .8438473
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14303.906
Iteration 2:   log likelihood = -14023.349
Iteration 3:   log likelihood = -14008.571
Iteration 4:   log likelihood =  -14008.32
Iteration 5:   log likelihood =  -14008.32
Refining estimates:
Iteration 0:   log likelihood =  -14008.32

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(21)      =     2988.69
Log likelihood  =    -14008.32                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .842585   .0855766    -1.69   0.092     .6904973    1.028171
1.oral_pr~ne |    1.60601   .0902484     8.43   0.000     1.438519    1.793002
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |    1.45048   .2140372     2.52   0.012      1.08619    1.936947
             |
   agegroup2 |
     60-<70  |   3.028002    .410197     8.18   0.000     2.321911    3.948813
     70-<80  |   6.051076   .7691762    14.16   0.000     4.716643    7.763047
        80+  |   14.11759   1.804257    20.72   0.000     10.98943    18.13618
             |
      1.male |   1.049812   .0533996     0.96   0.339     .9501986    1.159868
  1.dmard_pc |   .6935671   .0377954    -6.71   0.000     .6233082    .7717455
    1.nsaids |   .8905911   .0788631    -1.31   0.191     .7486921    1.059384
1.~c_disease |   1.772182    .091015    11.14   0.000      1.60248    1.959855
1.resp_exc~a |   1.538571   .0829074     8.00   0.000     1.384362    1.709958
             |
egfr_cat_n~s |
      30-59  |   1.109339   .0627957     1.83   0.067     .9928434    1.239503
        <30  |   2.814216   .2778747    10.48   0.000      2.31905     3.41511
             |
1.~r_disease |   1.801292    .264888     4.00   0.000      1.35024    2.403018
             |
   obese4cat |
Obese I ..)  |   .6439198   .0474212    -5.98   0.000     .5573724     .743906
Obese II..)  |   .8256161   .0863754    -1.83   0.067     .6725523    1.013515
Obese II..)  |   .8963498   .1387883    -0.71   0.480     .6617285    1.214158
             |
1.hyperten~n |   1.143348   .0616607     2.48   0.013     1.028664    1.270819
1.cancer_e~r |   2.146858    .112823    14.54   0.000     1.936736    2.379777
1.neuro_co~s |   1.860011   .1099431    10.50   0.000      1.65654    2.088474
1.flu_vacc~e |   .7550493   .0430992    -4.92   0.000     .6751304    .8444286
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      6.32
(Assumption: A nested in B)                           Prob > chi2 =    0.0119

-------------------------------------------------------------------------------
-> nsaids = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   135,697      1,451 |   137,148 
           |     98.94       1.06 |    100.00 
-----------+----------------------+----------
       HCQ |    23,675        192 |    23,867 
           |     99.20       0.80 |    100.00 
-----------+----------------------+----------
     Total |   159,372      1,643 |   161,015 
           |     98.98       1.02 |    100.00 

-------------------------------------------------------------------------------
-> nsaids = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,501        125 |    26,626 
           |     99.53       0.47 |    100.00 
-----------+----------------------+----------
       HCQ |     6,624         21 |     6,645 
           |     99.68       0.32 |    100.00 
-----------+----------------------+----------
     Total |    33,125        146 |    33,271 
           |     99.56       0.44 |    100.00 


         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood = -21746.725
Iteration 2:   log likelihood = -21746.598
Iteration 3:   log likelihood = -21746.598
Refining estimates:
Iteration 0:   log likelihood = -21746.598

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(1)       =       22.72
Log likelihood  =   -21746.598                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7163493   .0522953    -4.57   0.000     .6208475    .8265416
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood =  -21691.65
Iteration 2:   log likelihood = -21688.012
Iteration 3:   log likelihood = -21687.958
Iteration 4:   log likelihood = -21687.958
Refining estimates:
Iteration 0:   log likelihood = -21687.958

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(3)       =      140.00
Log likelihood  =   -21687.958                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .751215   .0576898    -3.73   0.000      .646243    .8732379
    1.nsaids |   .4432297    .041316    -8.73   0.000     .3692185    .5320767
             |
    exposure#|
      nsaids |
      HCQ#1  |    .883587    .219152    -0.50   0.618     .5434127    1.436709
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_int_n
> saids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    117.28
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood =  -21020.22
Iteration 2:   log likelihood = -20786.473
Iteration 3:   log likelihood = -20716.486
Iteration 4:   log likelihood = -20716.274
Iteration 5:   log likelihood = -20716.273
Refining estimates:
Iteration 0:   log likelihood = -20716.273

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(5)       =     2083.37
Log likelihood  =   -20716.273                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9430205   .0691094    -0.80   0.423     .8168468    1.088683
             |
   agegroup2 |
     60-<70  |   3.763992   .5016778     9.94   0.000     2.898662    4.887646
     70-<80  |   9.593493   1.156174    18.76   0.000      7.57518    12.14956
        80+  |   29.32052   3.434006    28.84   0.000     23.30662    36.88621
             |
      1.male |   1.218076   .0607167     3.96   0.000     1.104702    1.343086
------------------------------------------------------------------------------

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -21757.957
Iteration 1:   log likelihood =  -21014.52
Iteration 2:   log likelihood = -20779.979
Iteration 3:   log likelihood = -20710.041
Iteration 4:   log likelihood = -20709.829
Iteration 5:   log likelihood = -20709.829
Refining estimates:
Iteration 0:   log likelihood = -20709.829

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(7)       =     2096.26
Log likelihood  =   -20709.829                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |     .95984    .073935    -0.53   0.595     .8253385    1.116261
    1.nsaids |   .7541048   .0710359    -3.00   0.003     .6269738    .9070141
             |
    exposure#|
      nsaids |
      HCQ#1  |   .8905701   .2209063    -0.47   0.640     .5476804    1.448135
             |
   agegroup2 |
     60-<70  |   3.746308   .4993602     9.91   0.000     2.884985    4.864784
     70-<80  |    9.37245   1.130928    18.55   0.000     7.398485    11.87308
        80+  |   28.09539   3.304534    28.36   0.000     22.31095    35.37952
             |
      1.male |    1.21726   .0606766     3.94   0.000      1.10396    1.342187
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     12.89
(Assumption: A nested in B)                           Prob > chi2 =    0.0016

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14644.332
Iteration 2:   log likelihood = -14414.601
Iteration 3:   log likelihood = -14371.973
Iteration 4:   log likelihood = -14371.864
Iteration 5:   log likelihood = -14371.864
Refining estimates:
Iteration 0:   log likelihood = -14371.864

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(7)       =     2261.60
Log likelihood  =   -14371.864                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9744199   .0722212    -0.35   0.727       .84267    1.126769
             |
   agegroup2 |
     60-<70  |   3.656358   .4882036     9.71   0.000     2.814457    4.750099
     70-<80  |   8.974226   1.086388    18.13   0.000       7.0787    11.37733
        80+  |   26.07472   3.072706    27.67   0.000     20.69722    32.84938
             |
      1.male |    1.22333   .0611967     4.03   0.000      1.10908    1.349351
  1.dmard_pc |   .6033449   .0325194    -9.37   0.000     .5428591    .6705701
1.oral_pr~ne |   1.985275   .0999802    13.62   0.000     1.798678     2.19123
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14639.674
Iteration 2:   log likelihood = -14408.709
Iteration 3:   log likelihood = -14366.146
Iteration 4:   log likelihood = -14366.038
Iteration 5:   log likelihood = -14366.038
Refining estimates:
Iteration 0:   log likelihood = -14366.038

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(9)       =     2273.25
Log likelihood  =   -14366.038                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9923624   .0772462    -0.10   0.922     .8519461    1.155922
    1.nsaids |   .7655089   .0723898    -2.83   0.005     .6359998      .92139
             |
    exposure#|
      nsaids |
      HCQ#1  |   .8823227   .2189261    -0.50   0.614     .5425294    1.434933
             |
   agegroup2 |
     60-<70  |   3.628854   .4846423     9.65   0.000     2.793119    4.714651
     70-<80  |   8.740981   1.060262    17.87   0.000     6.891461    11.08687
        80+  |   24.93012   2.954153    27.14   0.000     19.76329    31.44775
             |
      1.male |   1.222238   .0611419     4.01   0.000     1.108089    1.348145
  1.dmard_pc |   .6075917    .032772    -9.24   0.000     .5466384    .6753417
1.oral_pr~ne |   1.984408   .0999555    13.61   0.000     1.797859    2.190314
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     11.65
(Assumption: A nested in B)                           Prob > chi2 =    0.0029

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14304.706
Iteration 2:   log likelihood = -14026.404
Iteration 3:   log likelihood = -14011.729
Iteration 4:   log likelihood =  -14011.48
Iteration 5:   log likelihood =  -14011.48
Refining estimates:
Iteration 0:   log likelihood =  -14011.48

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(20)      =     2982.37
Log likelihood  =    -14011.48                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9900537   .0735051    -0.13   0.893     .8559778     1.14513
             |
   agegroup2 |
     60-<70  |   3.024362   .4096862     8.17   0.000     2.319147    3.944021
     70-<80  |   6.051178   .7691664    14.16   0.000     4.716758    7.763121
        80+  |   14.12756   1.805642    20.72   0.000     10.99703    18.14927
             |
      1.male |   1.051902   .0534976     0.99   0.320     .9521051    1.162159
  1.dmard_pc |   .6908775   .0376485    -6.79   0.000     .6208918    .7687518
1.oral_pr~ne |   1.687837   .0881607    10.02   0.000     1.523596    1.869784
    1.nsaids |   .8893454   .0787577    -1.32   0.185     .7476367    1.057914
1.~c_disease |   1.771613   .0909952    11.13   0.000     1.601949    1.959247
1.resp_exc~a |   1.535518   .0827212     7.96   0.000     1.381654    1.706517
             |
egfr_cat_n~s |
      30-59  |   1.109816   .0628173     1.84   0.066     .9932795    1.240024
        <30  |   2.810287   .2774863    10.46   0.000     2.315813    3.410342
             |
1.~r_disease |   1.797404   .2643134     3.99   0.000      1.34733    2.397824
             |
   obese4cat |
Obese I ..)  |   .6436158   .0473961    -5.98   0.000     .5571138    .7435488
Obese II..)  |   .8242868   .0862343    -1.85   0.065     .6714726    1.011879
Obese II..)  |   .8981616   .1390592    -0.69   0.488       .66308    1.216587
             |
1.hyperten~n |   1.142983   .0616365     2.48   0.013     1.028342    1.270403
1.cancer_e~r |   2.148125   .1128937    14.55   0.000     1.937871    2.381189
1.neuro_co~s |   1.860555    .109967    10.50   0.000      1.65704    2.089067
1.flu_vacc~e |   .7545449   .0430625    -4.93   0.000     .6746931    .8438473
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15502.664
Iteration 1:   log likelihood = -14304.679
Iteration 2:   log likelihood = -14026.242
Iteration 3:   log likelihood = -14011.534
Iteration 4:   log likelihood = -14011.285
Iteration 5:   log likelihood = -14011.284
Refining estimates:
Iteration 0:   log likelihood = -14011.284

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =        1,789
Time at risk    =     22946851
                                                LR chi2(21)      =     2982.76
Log likelihood  =   -14011.284                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.005446   .0783707     0.07   0.944     .8629998    1.171404
    1.nsaids |   .9098293    .086624    -0.99   0.321     .7549494    1.096483
             |
    exposure#|
      nsaids |
      HCQ#1  |   .8582434   .2129787    -0.62   0.538     .5276905    1.395859
             |
   agegroup2 |
     60-<70  |   3.021783   .4093559     8.16   0.000     2.317141    3.940707
     70-<80  |   6.045094   .7684274    14.15   0.000     4.711963    7.755402
        80+  |   14.11598   1.804065    20.71   0.000     10.98816    18.13415
             |
      1.male |   1.051586   .0534837     0.99   0.323     .9518156    1.161815
  1.dmard_pc |   .6907921   .0376419    -6.79   0.000     .6208184    .7686528
1.oral_pr~ne |   1.687462    .088143    10.02   0.000     1.523254    1.869372
1.~c_disease |   1.771615   .0909962    11.13   0.000     1.601949     1.95925
1.resp_exc~a |   1.535709   .0827327     7.96   0.000     1.381823    1.706732
             |
egfr_cat_n~s |
      30-59  |   1.109821    .062819     1.84   0.066     .9932824    1.240034
        <30  |   2.811361   .2775964    10.47   0.000     2.316692    3.411655
             |
1.~r_disease |   1.797949   .2643932     3.99   0.000     1.347739     2.39855
             |
   obese4cat |
Obese I ..)  |   .6437829   .0474091    -5.98   0.000     .5572574    .7437434
Obese II..)  |   .8240503   .0862105    -1.85   0.064     .6712785    1.011591
Obese II..)  |   .8985761   .1391228    -0.69   0.490     .6633868    1.217147
             |
1.hyperten~n |   1.142935   .0616326     2.48   0.013     1.028302    1.270347
1.cancer_e~r |   2.148213   .1128993    14.55   0.000     1.937949     2.38129
1.neuro_co~s |   1.860897   .1099881    10.51   0.000     1.657342    2.089452
1.flu_vacc~e |   .7544043   .0430572    -4.94   0.000     .6745627    .8436961
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.39
(Assumption: A nested in B)                           Prob > chi2 =    0.5320

. 
. 
. 
. 
. 
. 
. /* Print interaction table===================================================
> =*/ 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table3.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 3: Interactions with HCQ use on risk of $tabl
> eoutcome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab _tab ("Age/
> Sex Adjusted") _tab _tab _tab  ///
>                                                 ("DAG Adjusted") _tab _tab _t
> ab ("Fully Adjusted") _tab _tab _tab _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("p (interactio
> n)") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("p (interact
> ion)") _tab ("HR") _tab ("95% CI") _tab ("p (interaction)") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab (
> "p (interaction)") _tab _n

. 
.                                                 
. * Generic program to print model for a level of another variable 
. cap prog drop printinteraction

. prog define printinteraction 
  1. syntax, variable(varname) min(real) max(real) 
  2. 
. * Overall p-values 
. 
. file write tablecontent ("`variable'") _tab _tab _tab _tab ("${univar_p_`vari
> able'}") ///
>                                                 _tab _tab _tab ("${multivar1_
> p_`variable'}") /// 
>                                                 _tab _tab _tab ("${multivar2_
> p_`variable'}") ///
>                                                 _tab _tab _tab ("${multivar3_
> p_`variable'}") _n
  3.         forvalues varlevel = `min'/`max'{ 
  4. 
.                 * Row headings 
.                                                         
.                 file write tablecontent ("`varlevel'") _n       
  5. 
.                 local lab0: label exposure 0
  6.                 local lab1: label exposure 1
  7.                  
.                 /* Counts */
.                         
.                 * First row, exposure = 0 (reference)
.                 
.         file write tablecontent ("`lab0'") _tab
  8. 
.                         cou if exposure == 0 & `variable' == `varlevel'
  9.                         local rowdenom = r(N)
 10.                         cou if exposure == 0  & `variable' == `varlevel' &
>  $outcome == 1
 11.                         local pct = 100*(r(N)/`rowdenom')
 12.                         
.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 13.                 file write tablecontent ("1.00 (ref)") _tab _tab _tab ("1.
> 00 (ref)") _tab _tab _tab ("1.00 (ref)") _tab _tab _tab ("1.00 (ref)") _n
 14.                         
.                 * Second row, exposure = 1 (comparator)
. 
.                 file write tablecontent ("`lab1'") _tab  
 15. 
.                         cou if exposure == 1 & `variable' == `varlevel'
 16.                         local rowdenom = r(N)
 17.                         cou if exposure == 1 & `variable' == `varlevel' & 
> $outcome == 1
 18.                         local pct = 100*(r(N)/`rowdenom')
 19.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 20. 
.                 * Print models 
.                 estimates use $Tempdir/univar_int_`variable' 
 21.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 22.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 23. 
.                 estimates use $Tempdir/multivar1_int_`variable'
 24.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 25.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 26. 
.                 estimates use $Tempdir/multivar2_int_`variable'
 27.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 28.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab 
 29.         
.                 estimates use $Tempdir/multivar3_int_`variable'
 30.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 31.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _n
 32.         } 
 33.                 
. end

. 
. printinteraction, variable(agegroup2) min(3) max(6) 
  57,623
  67
  12,493
  12
  37,669
  162
  7,966
  34
  41,988
  463
  7,127
  77
  26,494
  884
  2,926
  90

. file write tablecontent _n _n

. 
. printinteraction, variable(dmard_pc) min(0) max(1) 
  108,114
  1,174
  14,800
  117
  55,660
  402
  15,712
  96

. file write tablecontent _n _n

.   
. printinteraction, variable(oral_prednisolone) min(0) max(1) 
  137,042
  1,073
  23,643
  109
  26,732
  503
  6,869
  104

. file write tablecontent _n _n

. 
. printinteraction, variable(nsaids) min(0) max(1) 
  137,148
  1,451
  23,867
  192
  26,626
  125
  6,645
  21

. 
. 
. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\07_an_mod
> els_interact.log
  log type:  text
 closed on:  21 Jul 2020, 13:31:21
-------------------------------------------------------------------------------
