-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\10_an_mod
> els_ethnicity.log
  log type:  text
 opened on:  19 Jul 2020, 18:28:08

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. drop if ethnicity == .u
(45,240 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   124,371      1,176 |   125,547 
           |     99.06       0.94 |    100.00 
-----------+----------------------+----------
       HCQ |    23,295        154 |    23,449 
           |     99.34       0.66 |    100.00 
-----------+----------------------+----------
     Total |   147,666      1,330 |   148,996 
           |     99.11       0.89 |    100.00 

. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15822.442
Iteration 1:   log likelihood = -15812.447
Iteration 2:   log likelihood = -15812.312
Iteration 3:   log likelihood = -15812.312
Refining estimates:
Iteration 0:   log likelihood = -15812.312

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,330
Time at risk    =     17596539
                                                LR chi2(1)       =       20.26
Log likelihood  =   -15812.312                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .692086   .0593093    -4.29   0.000     .5850799    .8186627
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar.ster 
> saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15822.442
Iteration 1:   log likelihood = -15043.002
Iteration 2:   log likelihood = -14888.676
Iteration 3:   log likelihood = -14882.228
Iteration 4:   log likelihood =  -14881.57
Iteration 5:   log likelihood = -14881.556
Iteration 6:   log likelihood = -14881.556
Refining estimates:
Iteration 0:   log likelihood = -14881.556

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,330
Time at risk    =     17596539
                                                LR chi2(5)       =     1881.77
Log likelihood  =   -14881.556                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9872515   .0852609    -0.15   0.882     .8335208    1.169336
      1.male |   1.290831   .0747245     4.41   0.000     1.152376     1.44592
        age1 |   1.064519   .0221853     3.00   0.003     1.021913    1.108902
        age2 |   1.025888   .0317031     0.83   0.408      .965595    1.089945
        age3 |   .9903303   .1175609    -0.08   0.935     .7847567    1.249756
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1.st
> er saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11189.634
Iteration 1:   log likelihood = -10347.021
Iteration 2:   log likelihood = -10200.536
Iteration 3:   log likelihood = -10193.563
Iteration 4:   log likelihood = -10192.895
Iteration 5:   log likelihood = -10192.881
Iteration 6:   log likelihood = -10192.881
Refining estimates:
Iteration 0:   log likelihood = -10192.881

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,330
Time at risk    =     17596539
                                                LR chi2(7)       =     1993.51
Log likelihood  =   -10192.881                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9964122   .0869623    -0.04   0.967     .8397501    1.182301
      1.male |   1.292655   .0751607     4.41   0.000     1.153427     1.44869
        age1 |   1.065481   .0221545     3.05   0.002     1.022932      1.1098
        age2 |   1.019834   .0314823     0.64   0.525     .9599597    1.083444
        age3 |   1.008929   .1198692     0.07   0.940     .7993382    1.273475
  1.dmard_pc |     .64071   .0407775    -6.99   0.000     .5655714    .7258311
1.oral_pr~ne |   2.007389   .1174927    11.91   0.000     1.789825    2.251399
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2.st
> er saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine, strata(stp population) 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11189.634
Iteration 1:   log likelihood = -10218.689
Iteration 2:   log likelihood = -9949.9517
Iteration 3:   log likelihood =  -9935.888
Iteration 4:   log likelihood = -9935.4372
Iteration 5:   log likelihood = -9935.4357
Iteration 6:   log likelihood = -9935.4357
Refining estimates:
Iteration 0:   log likelihood = -9935.4357

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,330
Time at risk    =     17596539
                                                LR chi2(20)      =     2508.40
Log likelihood  =   -9935.4357                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.003248   .0876931     0.04   0.970     .8452894    1.190724
      1.male |   1.113099   .0658397     1.81   0.070     .9912552     1.24992
        age1 |   1.066608   .0223861     3.07   0.002     1.023622    1.111398
        age2 |   .9936875    .031004    -0.20   0.839     .9347415    1.056351
        age3 |   1.117889   .1345043     0.93   0.354     .8830437    1.415191
  1.dmard_pc |   .7169839   .0460192    -5.18   0.000     .6322306    .8130987
1.oral_pr~ne |   1.708013   .1035379     8.83   0.000     1.516674    1.923491
    1.nsaids |   .8639874   .0925071    -1.37   0.172     .7004374    1.065726
1.~c_disease |   1.722229   .1029705     9.09   0.000     1.531787    1.936348
1.resp_exc~a |   1.636238   .1017913     7.92   0.000     1.448414    1.848418
             |
egfr_cat_n~s |
      30-59  |   .9260596   .0624048    -1.14   0.254     .8114816    1.056816
        <30  |   2.308485   .2633653     7.33   0.000     1.845938    2.886935
             |
1.~r_disease |   2.121931   .3389006     4.71   0.000     1.551612     2.90188
             |
   obese4cat |
Obese I ..)  |   .6899235   .0588412    -4.35   0.000     .5837205    .8154493
Obese II..)  |   .9344472    .111413    -0.57   0.570     .7397195    1.180436
Obese II..)  |   .9735919   .1801907    -0.14   0.885     .6773888    1.399316
             |
1.hyperten~n |   1.090924    .068539     1.39   0.166     .9645317    1.233879
1.cancer_e~r |   2.217915   .1345775    13.13   0.000     1.969229    2.498007
1.neuro_co~s |   1.753643   .1200491     8.21   0.000     1.533453     2.00545
1.flu_vacc~e |   .7474353   .0495563    -4.39   0.000     .6563529    .8511572
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3.st
> er saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15822.442
Iteration 1:   log likelihood = -15812.447
Iteration 2:   log likelihood = -15812.312
Iteration 3:   log likelihood = -15812.312
Refining estimates:
Iteration 0:   log likelihood = -15812.312

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,330
Time at risk    =     17596539
                                                LR chi2(1)       =       20.26
Log likelihood  =   -15812.312                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .692086   .0593093    -4.29   0.000     .5850799    .8186627
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_eth.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15822.442
Iteration 1:   log likelihood = -15043.002
Iteration 2:   log likelihood = -14888.676
Iteration 3:   log likelihood = -14882.228
Iteration 4:   log likelihood =  -14881.57
Iteration 5:   log likelihood = -14881.556
Iteration 6:   log likelihood = -14881.556
Refining estimates:
Iteration 0:   log likelihood = -14881.556

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,330
Time at risk    =     17596539
                                                LR chi2(5)       =     1881.77
Log likelihood  =   -14881.556                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9872515   .0852609    -0.15   0.882     .8335208    1.169336
      1.male |   1.290831   .0747245     4.41   0.000     1.152376     1.44592
        age1 |   1.064519   .0221853     3.00   0.003     1.021913    1.108902
        age2 |   1.025888   .0317031     0.83   0.408      .965595    1.089945
        age3 |   .9903303   .1175609    -0.08   0.935     .7847567    1.249756
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_et
> h.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp population)                               

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11189.634
Iteration 1:   log likelihood = -10345.395
Iteration 2:   log likelihood = -10197.471
Iteration 3:   log likelihood = -10190.435
Iteration 4:   log likelihood = -10189.768
Iteration 5:   log likelihood = -10189.754
Iteration 6:   log likelihood = -10189.754
Refining estimates:
Iteration 0:   log likelihood = -10189.754

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,330
Time at risk    =     17596539
                                                LR chi2(11)      =     1999.76
Log likelihood  =   -10189.754                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9989164   .0872037    -0.01   0.990     .8418228    1.185326
      1.male |   1.292733   .0751849     4.41   0.000     1.153462     1.44882
        age1 |   1.064527    .022113     3.01   0.003     1.022056    1.108762
        age2 |   1.019754   .0314409     0.63   0.526     .9599557    1.083277
        age3 |    1.01079   .1199533     0.09   0.928      .801026    1.275485
             |
   ethnicity |
South Asian  |   .6751972   .1184123    -2.24   0.025     .4787973    .9521592
      Black  |   .7916048   .2249915    -0.82   0.411      .453501    1.381779
      Mixed  |   1.124576   .4630293     0.29   0.776     .5017853    2.520344
      Other  |   .8807617   .3365792    -0.33   0.740     .4164621    1.862693
             |
  1.dmard_pc |   .6388137   .0406647    -7.04   0.000     .5638838    .7237003
1.oral_pr~ne |   2.007022   .1174998    11.90   0.000     1.789448     2.25105
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_et
> h.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine, strata(stp population)     

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11189.634
Iteration 1:   log likelihood = -10218.152
Iteration 2:   log likelihood = -9947.3001
Iteration 3:   log likelihood = -9933.2651
Iteration 4:   log likelihood = -9932.8159
Iteration 5:   log likelihood = -9932.8144
Iteration 6:   log likelihood = -9932.8144
Refining estimates:
Iteration 0:   log likelihood = -9932.8144

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,330
Time at risk    =     17596539
                                                LR chi2(24)      =     2513.64
Log likelihood  =   -9932.8144                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.005896   .0879552     0.07   0.946     .8474695    1.193938
      1.male |    1.11487   .0659474     1.84   0.066     .9928266    1.251915
        age1 |   1.065616   .0223384     3.03   0.002     1.022721     1.11031
        age2 |   .9939242   .0309679    -0.20   0.845     .9350444    1.056512
        age3 |   1.117729   .1343159     0.93   0.354      .883179    1.414569
             |
   ethnicity |
South Asian  |   .7051298   .1238957    -1.99   0.047      .499698     .995017
      Black  |    .780949   .2220889    -0.87   0.385     .4472549     1.36361
      Mixed  |    1.17688   .4854012     0.39   0.693      .524392    2.641241
      Other  |   .8665144   .3313583    -0.37   0.708     .4095182    1.833489
             |
  1.dmard_pc |   .7152865   .0459178    -5.22   0.000     .6307209    .8111905
1.oral_pr~ne |   1.708867   .1036191     8.84   0.000     1.517381    1.924517
    1.nsaids |   .8628038   .0923875    -1.38   0.168     .6994664    1.064283
1.~c_disease |   1.727095   .1033023     9.14   0.000     1.536044     1.94191
1.resp_exc~a |   1.628227   .1013905     7.83   0.000     1.441153    1.839584
             |
egfr_cat_n~s |
      30-59  |   .9261868   .0624278    -1.14   0.255     .8115682    1.056993
        <30  |   2.312838   .2640959     7.34   0.000     1.849052    2.892953
             |
1.~r_disease |   2.125713    .339481     4.72   0.000     1.554411    2.906989
             |
   obese4cat |
Obese I ..)  |   .6887399   .0587555    -4.37   0.000     .5826936    .8140858
Obese II..)  |   .9301027   .1109195    -0.61   0.543     .7362423    1.175009
Obese II..)  |   .9671552    .179078    -0.18   0.857     .6728032    1.390286
             |
1.hyperten~n |   1.096682   .0689658     1.47   0.142       .96951    1.240536
1.cancer_e~r |   2.206251   .1339957    13.03   0.000     1.958653    2.485148
1.neuro_co~s |   1.754305    .120109     8.21   0.000     1.534007    2.006239
1.flu_vacc~e |   .7448323   .0494195    -4.44   0.000     .6540055    .8482729
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_et
> h.ster saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table6.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 6: Ethnicity adjustments") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. file write tablecontent ("Main Analysis, dropping individuals with missing et
> hnicity") _n                                       

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,547

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  1,176

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,449

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  154

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .692086   .0593093    -4.29   0.000     .5850799    .8186627
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9872515   .0852609    -0.15   0.882     .8335208    1.169336
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9964122   .0869623    -0.04   0.967     .8397501    1.182301
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.003248   .0876931     0.04   0.970     .8452894    1.190724
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. file write tablecontent ("Main Analysis, adjusting for ethnicity") _n        
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,547

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  1,176

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,449

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  154

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .692086   .0593093    -4.29   0.000     .5850799    .8186627
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9872515   .0852609    -0.15   0.882     .8335208    1.169336
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9989164   .0872037    -0.01   0.990     .8418228    1.185326
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.005896   .0879552     0.07   0.946     .8474695    1.193938
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\10_an_mod
> els_ethnicity.log
  log type:  text
 closed on:  19 Jul 2020, 18:28:51
-------------------------------------------------------------------------------
