-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\10_an_mod
> els_ethnicity.log
  log type:  text
 opened on:   6 Aug 2020, 12:44:17

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. drop if ethnicity == .u
(45,328 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   124,483      1,324 |   125,807 
           |     98.95       1.05 |    100.00 
-----------+----------------------+----------
       HCQ |    23,333        169 |    23,502 
           |     99.28       0.72 |    100.00 
-----------+----------------------+----------
     Total |   147,816      1,493 |   149,309 
           |     99.00       1.00 |    100.00 

. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17762.887
Iteration 1:   log likelihood = -17750.161
Iteration 2:   log likelihood = -17749.966
Iteration 3:   log likelihood = -17749.966
Refining estimates:
Iteration 0:   log likelihood = -17749.966

Cox regression -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =        1,493
Time at risk    =     19665328
                                                LR chi2(1)       =       25.84
Log likelihood  =   -17749.966                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .673865   .0550448    -4.83   0.000     .5741724    .7908671
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar.ster 
> saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17762.887
Iteration 1:   log likelihood = -16894.593
Iteration 2:   log likelihood = -16720.131
Iteration 3:   log likelihood = -16712.006
Iteration 4:   log likelihood =  -16711.09
Iteration 5:   log likelihood = -16711.066
Iteration 6:   log likelihood = -16711.066
Refining estimates:
Iteration 0:   log likelihood = -16711.066

Cox regression -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =        1,493
Time at risk    =     19665328
                                                LR chi2(5)       =     2103.64
Log likelihood  =   -16711.066                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9577366   .0788196    -0.52   0.600     .8150685    1.125377
      1.male |   1.237918   .0680573     3.88   0.000     1.111463    1.378759
        age1 |   1.067263   .0216972     3.20   0.001     1.025573    1.110647
        age2 |   1.027404   .0307221     0.90   0.366     .9689204    1.089418
        age3 |   .9711166   .1109946    -0.26   0.798      .776216    1.214955
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1.st
> er saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12559.456
Iteration 1:   log likelihood = -11621.657
Iteration 2:   log likelihood =  -11455.65
Iteration 3:   log likelihood = -11446.916
Iteration 4:   log likelihood = -11445.993
Iteration 5:   log likelihood = -11445.969
Iteration 6:   log likelihood = -11445.968
Refining estimates:
Iteration 0:   log likelihood = -11445.968

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =        1,493
Time at risk    =     19665328
                                                LR chi2(7)       =     2226.98
Log likelihood  =   -11445.968                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9606994   .0798714    -0.48   0.630     .8162433    1.130721
      1.male |    1.24025   .0684839     3.90   0.000     1.113033    1.382009
        age1 |   1.068388   .0216929     3.26   0.001     1.026706    1.111763
        age2 |    1.02085   .0305157     0.69   0.490     .9627584    1.082446
        age3 |   .9925573   .1135954    -0.07   0.948     .7931182    1.242148
  1.dmard_pc |   .6599811   .0394119    -6.96   0.000     .5870844    .7419293
1.oral_pr~ne |   2.019727   .1114864    12.74   0.000     1.812622    2.250494
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2.st
> er saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)  

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12559.456
Iteration 1:   log likelihood = -11435.504
Iteration 2:   log likelihood = -11130.279
Iteration 3:   log likelihood = -11114.934
Iteration 4:   log likelihood = -11114.393
Iteration 5:   log likelihood =  -11114.39
Iteration 6:   log likelihood =  -11114.39
Refining estimates:
Iteration 0:   log likelihood =  -11114.39

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =        1,493
Time at risk    =     19665328
                                                LR chi2(29)      =     2890.13
Log likelihood  =    -11114.39                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9751697   .0812266    -0.30   0.763     .8282845    1.148103
      1.male |   1.037733   .0592224     0.65   0.516     .9279154    1.160547
        age1 |   1.064612   .0216841     3.07   0.002     1.022949    1.107972
        age2 |   1.007246   .0303146     0.24   0.810     .9495494    1.068449
        age3 |   1.053264    .121669     0.45   0.653     .8398652    1.320884
  1.dmard_pc |   .7524054   .0454056    -4.71   0.000     .6684735    .8468755
1.oral_pr~ne |   1.695416   .0970183     9.23   0.000     1.515539    1.896642
    1.nsaids |   .9113674     .09052    -0.93   0.350     .7501521     1.10723
1.~c_disease |   1.629018   .0921718     8.62   0.000     1.458021    1.820069
1.resp_exc~a |   1.523057    .091117     7.03   0.000     1.354543    1.712534
             |
egfr_cat_n~s |
      30-59  |   .9892665   .0621283    -0.17   0.864     .8746934    1.118847
        <30  |   2.277282   .2465158     7.60   0.000     1.841935    2.815525
             |
1.~r_disease |   2.094519   .3104132     4.99   0.000     1.566513    2.800493
             |
   obese4cat |
Obese I ..)  |   .6640987   .0539383    -5.04   0.000     .5663669    .7786951
Obese II..)  |   .9034811   .1026234    -0.89   0.372     .7231592    1.128767
Obese II..)  |   .9394135   .1622847    -0.36   0.718     .6695929    1.317962
             |
1.hyperten~n |   1.021277   .0606573     0.35   0.723     .9090494    1.147359
1.cancer_e~r |   2.186056    .125723    13.60   0.000     1.953024    2.446894
1.neuro_co~s |   1.692363   .1100067     8.09   0.000     1.489923    1.922309
1.flu_vacc~e |    .764728   .0480265    -4.27   0.000     .6761605    .8648967
             |
         imd |
          2  |   1.191547   .1052975     1.98   0.047     1.002052    1.416877
          3  |   1.317759   .1155427     3.15   0.002      1.10969    1.564841
          4  |   1.230565   .1103814     2.31   0.021     1.032172    1.467091
5 most de..  |   1.490162   .1323685     4.49   0.000     1.252053    1.773553
             |
     diabcat |
Controlle..  |   1.154648   .0803494     2.07   0.039     1.007434    1.323375
Uncontrol..  |   1.521746   .1478263     4.32   0.000     1.257923    1.840899
Diabetes,..  |   1.932746   .2633962     4.84   0.000     1.479695    2.524511
             |
smoke_nomiss |
     Former  |    1.16063   .0719766     2.40   0.016     1.027795    1.310634
    Current  |   1.768955   .1627932     6.20   0.000     1.477007     2.11861
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3.st
> er saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17762.887
Iteration 1:   log likelihood = -17750.161
Iteration 2:   log likelihood = -17749.966
Iteration 3:   log likelihood = -17749.966
Refining estimates:
Iteration 0:   log likelihood = -17749.966

Cox regression -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =        1,493
Time at risk    =     19665328
                                                LR chi2(1)       =       25.84
Log likelihood  =   -17749.966                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .673865   .0550448    -4.83   0.000     .5741724    .7908671
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_eth.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17762.887
Iteration 1:   log likelihood = -16894.593
Iteration 2:   log likelihood = -16720.131
Iteration 3:   log likelihood = -16712.006
Iteration 4:   log likelihood =  -16711.09
Iteration 5:   log likelihood = -16711.066
Iteration 6:   log likelihood = -16711.066
Refining estimates:
Iteration 0:   log likelihood = -16711.066

Cox regression -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =        1,493
Time at risk    =     19665328
                                                LR chi2(5)       =     2103.64
Log likelihood  =   -16711.066                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9577366   .0788196    -0.52   0.600     .8150685    1.125377
      1.male |   1.237918   .0680573     3.88   0.000     1.111463    1.378759
        age1 |   1.067263   .0216972     3.20   0.001     1.025573    1.110647
        age2 |   1.027404   .0307221     0.90   0.366     .9689204    1.089418
        age3 |   .9711166   .1109946    -0.26   0.798      .776216    1.214955
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_et
> h.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp population)                               

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12559.456
Iteration 1:   log likelihood = -11619.653
Iteration 2:   log likelihood = -11451.996
Iteration 3:   log likelihood = -11443.203
Iteration 4:   log likelihood = -11442.283
Iteration 5:   log likelihood = -11442.259
Iteration 6:   log likelihood = -11442.259
Refining estimates:
Iteration 0:   log likelihood = -11442.259

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =        1,493
Time at risk    =     19665328
                                                LR chi2(11)      =     2234.39
Log likelihood  =   -11442.259                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9636911   .0801394    -0.44   0.657     .8187531    1.134286
      1.male |    1.23996   .0684848     3.89   0.000     1.112742    1.381722
        age1 |   1.067328   .0216468     3.21   0.001     1.025733     1.11061
        age2 |   1.020783   .0304737     0.69   0.491     .9627695    1.082292
        age3 |   .9945505   .1136878    -0.05   0.962     .7949236    1.244309
             |
   ethnicity |
South Asian  |   .6794653   .1117533    -2.35   0.019       .49223    .9379215
      Black  |   .7078579    .200737    -1.22   0.223      .406031    1.234051
      Mixed  |   .9914241   .4077896    -0.02   0.983      .442737    2.220103
      Other  |   .8956506   .3203187    -0.31   0.758     .4443412    1.805347
             |
  1.dmard_pc |   .6578372   .0392909    -7.01   0.000      .585165    .7395346
1.oral_pr~ne |   2.019192   .1114855    12.73   0.000     1.812092    2.249961
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_et
> h.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)  
>     

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12559.456
Iteration 1:   log likelihood = -11434.087
Iteration 2:   log likelihood =  -11126.57
Iteration 3:   log likelihood = -11111.213
Iteration 4:   log likelihood = -11110.674
Iteration 5:   log likelihood =  -11110.67
Iteration 6:   log likelihood =  -11110.67
Refining estimates:
Iteration 0:   log likelihood =  -11110.67

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =        1,493
Time at risk    =     19665328
                                                LR chi2(33)      =     2897.57
Log likelihood  =    -11110.67                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9801126   .0816692    -0.24   0.809     .8324315    1.153994
      1.male |   1.043695   .0595725     0.75   0.454     .9332296    1.167237
        age1 |    1.06353   .0216188     3.03   0.002      1.02199    1.106757
        age2 |   1.007394     .03026     0.25   0.806     .9497978    1.068483
        age3 |   1.053607   .1215072     0.45   0.651     .8404533    1.320819
             |
   ethnicity |
South Asian  |   .6848057   .1146338    -2.26   0.024     .4932642    .9507256
      Black  |   .6687925   .1901526    -1.41   0.157      .383068    1.167635
      Mixed  |    .959677    .395768    -0.10   0.921     .4276535    2.153566
      Other  |   .8588019   .3076478    -0.42   0.671     .4255669    1.733078
             |
  1.dmard_pc |   .7510784    .045328    -4.74   0.000     .6672903    .8453873
1.oral_pr~ne |   1.696003   .0970882     9.23   0.000     1.516001    1.897378
    1.nsaids |   .9107341   .0904638    -0.94   0.347     .7496201    1.106476
1.~c_disease |   1.631575     .09234     8.65   0.000     1.460269    1.822978
1.resp_exc~a |   1.517811   .0908902     6.97   0.000     1.349726    1.706828
             |
egfr_cat_n~s |
      30-59  |   .9881777   .0620852    -0.19   0.850     .8736868    1.117672
        <30  |   2.277047   .2467142     7.59   0.000      1.84139    2.815777
             |
1.~r_disease |   2.086924   .3092829     4.96   0.000      1.56084    2.790327
             |
   obese4cat |
Obese I ..)  |   .6615854   .0537632    -5.08   0.000     .5641748    .7758149
Obese II..)  |   .8952901   .1017766    -0.97   0.331     .7164719    1.118738
Obese II..)  |   .9277949   .1604234    -0.43   0.665     .6611077    1.302062
             |
1.hyperten~n |     1.0256   .0609377     0.43   0.671     .9128567    1.152268
1.cancer_e~r |   2.173661   .1251037    13.49   0.000     1.941787    2.433225
1.neuro_co~s |   1.692158   .1100026     8.09   0.000     1.489727    1.922097
1.flu_vacc~e |   .7605932   .0478021    -4.35   0.000     .6724433    .8602985
             |
         imd |
          2  |   1.191375   .1052872     1.98   0.048     1.001899    1.416684
          3  |   1.324443   .1161471     3.20   0.001     1.115288    1.572822
          4  |   1.245307   .1118295     2.44   0.015      1.04433    1.484961
5 most de..  |   1.518245   .1352205     4.69   0.000      1.27506    1.807811
             |
     diabcat |
Controlle..  |   1.174613   .0819981     2.31   0.021     1.024409     1.34684
Uncontrol..  |   1.557457   .1518679     4.54   0.000     1.286516    1.885458
Diabetes,..  |   1.962911   .2676844     4.95   0.000     1.502524    2.564366
             |
smoke_nomiss |
     Former  |   1.133398   .0708517     2.00   0.045     1.002701     1.28113
    Current  |   1.710353   .1588155     5.78   0.000     1.425762     2.05175
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_et
> h.ster saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table6.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 6: Ethnicity adjustments") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. file write tablecontent ("Main Analysis, dropping individuals with missing et
> hnicity") _n                                       

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,807

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  1,324

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,502

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  169

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .673865   .0550448    -4.83   0.000     .5741724    .7908671
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9577366   .0788196    -0.52   0.600     .8150685    1.125377
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9606994   .0798714    -0.48   0.630     .8162433    1.130721
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9751697   .0812266    -0.30   0.763     .8282845    1.148103
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. file write tablecontent ("Main Analysis, adjusting for ethnicity") _n        
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,807

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  1,324

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,502

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  169

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .673865   .0550448    -4.83   0.000     .5741724    .7908671
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9577366   .0788196    -0.52   0.600     .8150685    1.125377
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9636911   .0801394    -0.44   0.657     .8187531    1.134286
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9801126   .0816692    -0.24   0.809     .8324315    1.153994
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\10_an_mod
> els_ethnicity.log
  log type:  text
 closed on:   6 Aug 2020, 12:45:10
-------------------------------------------------------------------------------
