-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\10_an_mod
> els_ethnicity.log
  log type:  text
 opened on:  21 Jul 2020, 22:15:13

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. drop if ethnicity == .u
(45,264 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   124,389      1,175 |   125,564 
           |     99.06       0.94 |    100.00 
-----------+----------------------+----------
       HCQ |    23,304        154 |    23,458 
           |     99.34       0.66 |    100.00 
-----------+----------------------+----------
     Total |   147,693      1,329 |   149,022 
           |     99.11       0.89 |    100.00 

. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15810.777
Iteration 1:   log likelihood = -15800.817
Iteration 2:   log likelihood = -15800.683
Iteration 3:   log likelihood = -15800.683
Refining estimates:
Iteration 0:   log likelihood = -15800.683

Cox regression -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =        1,329
Time at risk    =     17599758
                                                LR chi2(1)       =       20.19
Log likelihood  =   -15800.683                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .6925034    .059348    -4.29   0.000     .5854279    .8191632
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar.ster 
> saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15810.777
Iteration 1:   log likelihood = -15033.436
Iteration 2:   log likelihood =  -14879.73
Iteration 3:   log likelihood = -14873.238
Iteration 4:   log likelihood = -14872.576
Iteration 5:   log likelihood = -14872.562
Iteration 6:   log likelihood = -14872.561
Refining estimates:
Iteration 0:   log likelihood = -14872.561

Cox regression -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =        1,329
Time at risk    =     17599758
                                                LR chi2(5)       =     1876.43
Log likelihood  =   -14872.561                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9870921   .0852491    -0.15   0.880      .833383    1.169151
      1.male |    1.29212    .074814     4.43   0.000     1.153501    1.447396
        age1 |   1.064327   .0221656     2.99   0.003     1.021758    1.108669
        age2 |   1.026342   .0317037     0.84   0.400     .9660472      1.0904
        age3 |   .9878428   .1172451    -0.10   0.918     .7828172    1.246566
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1.st
> er saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11183.315
Iteration 1:   log likelihood = -10343.045
Iteration 2:   log likelihood =  -10197.09
Iteration 3:   log likelihood = -10190.084
Iteration 4:   log likelihood = -10189.415
Iteration 5:   log likelihood = -10189.401
Iteration 6:   log likelihood = -10189.401
Refining estimates:
Iteration 0:   log likelihood = -10189.401

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =        1,329
Time at risk    =     17599758
                                                LR chi2(7)       =     1987.83
Log likelihood  =   -10189.401                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9959425   .0869162    -0.05   0.963     .8393627    1.181732
      1.male |   1.293712   .0752362     4.43   0.000     1.154345    1.449905
        age1 |   1.065207   .0221336     3.04   0.002     1.022697    1.109483
        age2 |   1.020337   .0314848     0.65   0.514     .9604572    1.083951
        age3 |   1.006249   .1195298     0.05   0.958     .7972477     1.27004
  1.dmard_pc |   .6401741   .0407439    -7.01   0.000     .5650974    .7252252
1.oral_pr~ne |   2.009844   .1176624    11.92   0.000     1.791968    2.254209
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2.st
> er saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine, strata(stp population) 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11183.315
Iteration 1:   log likelihood = -10213.563
Iteration 2:   log likelihood = -9945.5207
Iteration 3:   log likelihood =  -9931.472
Iteration 4:   log likelihood = -9931.0217
Iteration 5:   log likelihood = -9931.0202
Iteration 6:   log likelihood = -9931.0202
Refining estimates:
Iteration 0:   log likelihood = -9931.0202

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =        1,329
Time at risk    =     17599758
                                                LR chi2(20)      =     2504.59
Log likelihood  =   -9931.0202                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.002813   .0876472     0.03   0.974     .8449355    1.190189
      1.male |   1.114277   .0659219     1.83   0.067     .9922819    1.251271
        age1 |   1.066365   .0223675     3.06   0.002     1.023415    1.111118
        age2 |   .9941101   .0310068    -0.19   0.850     .9351582    1.056778
        age3 |   1.115197   .1341659     0.91   0.365     .8809397    1.411748
  1.dmard_pc |   .7165366   .0459915    -5.19   0.000     .6318344    .8125937
1.oral_pr~ne |   1.709625   .1036604     8.84   0.000     1.518062    1.925361
    1.nsaids |   .8627392   .0923665    -1.38   0.168     .6994365    1.064169
1.~c_disease |   1.725709   .1032047     9.12   0.000     1.534837    1.940319
1.resp_exc~a |   1.637141   .1018707     7.92   0.000     1.449173    1.849489
             |
egfr_cat_n~s |
      30-59  |   .9243603   .0623418    -1.17   0.244     .8099041    1.054992
        <30  |    2.31385    .263967     7.35   0.000     1.850244    2.893619
             |
1.~r_disease |   2.123368   .3391279     4.71   0.000     1.552665    2.903839
             |
   obese4cat |
Obese I ..)  |   .6901812   .0588663    -4.35   0.000     .5839333    .8157612
Obese II..)  |   .9349871   .1114788    -0.56   0.573     .7401447    1.181122
Obese II..)  |   .9728923   .1800653    -0.15   0.882     .6768964    1.398322
             |
1.hyperten~n |   1.089852   .0684819     1.37   0.171     .9635663     1.23269
1.cancer_e~r |   2.218863   .1346641    13.13   0.000     1.970019    2.499139
1.neuro_co~s |   1.757911   .1203427     8.24   0.000     1.537183    2.010335
1.flu_vacc~e |   .7465005   .0494996    -4.41   0.000     .6555229    .8501046
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3.st
> er saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15810.777
Iteration 1:   log likelihood = -15800.817
Iteration 2:   log likelihood = -15800.683
Iteration 3:   log likelihood = -15800.683
Refining estimates:
Iteration 0:   log likelihood = -15800.683

Cox regression -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =        1,329
Time at risk    =     17599758
                                                LR chi2(1)       =       20.19
Log likelihood  =   -15800.683                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .6925034    .059348    -4.29   0.000     .5854279    .8191632
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_eth.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15810.777
Iteration 1:   log likelihood = -15033.436
Iteration 2:   log likelihood =  -14879.73
Iteration 3:   log likelihood = -14873.238
Iteration 4:   log likelihood = -14872.576
Iteration 5:   log likelihood = -14872.562
Iteration 6:   log likelihood = -14872.561
Refining estimates:
Iteration 0:   log likelihood = -14872.561

Cox regression -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =        1,329
Time at risk    =     17599758
                                                LR chi2(5)       =     1876.43
Log likelihood  =   -14872.561                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9870921   .0852491    -0.15   0.880      .833383    1.169151
      1.male |    1.29212    .074814     4.43   0.000     1.153501    1.447396
        age1 |   1.064327   .0221656     2.99   0.003     1.021758    1.108669
        age2 |   1.026342   .0317037     0.84   0.400     .9660472      1.0904
        age3 |   .9878428   .1172451    -0.10   0.918     .7828172    1.246566
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_et
> h.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp population)                               

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11183.315
Iteration 1:   log likelihood = -10341.456
Iteration 2:   log likelihood = -10194.086
Iteration 3:   log likelihood = -10187.017
Iteration 4:   log likelihood = -10186.348
Iteration 5:   log likelihood = -10186.334
Iteration 6:   log likelihood = -10186.334
Refining estimates:
Iteration 0:   log likelihood = -10186.334

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =        1,329
Time at risk    =     17599758
                                                LR chi2(11)      =     1993.96
Log likelihood  =   -10186.334                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9983378    .087146    -0.02   0.985     .8413471    1.184622
      1.male |   1.293785   .0752597     4.43   0.000     1.154377    1.450029
        age1 |   1.064274   .0220931     3.00   0.003     1.021841    1.108468
        age2 |   1.020247   .0314439     0.65   0.515     .9604422    1.083775
        age3 |   1.008115   .1196171     0.07   0.946     .7989346    1.272063
             |
   ethnicity |
South Asian  |   .6770765   .1187562    -2.22   0.026     .4801101     .954849
      Black  |   .7967179   .2265018    -0.80   0.424     .4563661    1.390899
      Mixed  |   1.121949   .4619129     0.28   0.780     .5006431    2.514303
      Other  |   .8805077   .3364676    -0.33   0.739     .4163555    1.862096
             |
  1.dmard_pc |   .6383137   .0406332    -7.05   0.000     .5634419    .7231346
1.oral_pr~ne |   2.009441   .1176681    11.92   0.000     1.791558    2.253822
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_et
> h.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine, strata(stp population)     

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11183.315
Iteration 1:   log likelihood = -10213.053
Iteration 2:   log likelihood = -9942.9191
Iteration 3:   log likelihood =  -9928.901
Iteration 4:   log likelihood = -9928.4522
Iteration 5:   log likelihood = -9928.4507
Iteration 6:   log likelihood = -9928.4507
Refining estimates:
Iteration 0:   log likelihood = -9928.4507

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =        1,329
Time at risk    =     17599758
                                                LR chi2(24)      =     2509.73
Log likelihood  =   -9928.4507                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.005321   .0878944     0.06   0.952      .847003    1.193232
      1.male |   1.116038   .0660291     1.86   0.064     .9938445    1.253254
        age1 |   1.065396   .0223209     3.02   0.002     1.022534    1.110055
        age2 |   .9943366   .0309711    -0.18   0.855       .93545     1.05693
        age3 |   1.115045   .1339822     0.91   0.365     .8810761    1.411145
             |
   ethnicity |
South Asian  |   .7069183   .1242249    -1.97   0.048     .5009448     .997582
      Black  |   .7856142   .2234782    -0.85   0.396     .4498564     1.37197
      Mixed  |   1.176043   .4850298     0.39   0.694     .5240425    2.639248
      Other  |   .8670379   .3315553    -0.37   0.709     .4097685    1.834584
             |
  1.dmard_pc |   .7148776   .0458922    -5.23   0.000     .6303591    .8107283
1.oral_pr~ne |   1.710414   .1037377     8.85   0.000     1.518712    1.926315
    1.nsaids |   .8615877   .0922503    -1.39   0.164     .6984917    1.062766
1.~c_disease |   1.730592   .1035379     9.17   0.000     1.539108      1.9459
1.resp_exc~a |   1.629184   .1014748     7.84   0.000     1.441957     1.84072
             |
egfr_cat_n~s |
      30-59  |    .924477   .0623637    -1.16   0.244     .8099821    1.055156
        <30  |   2.318335   .2647125     7.36   0.000     1.853464    2.899801
             |
1.~r_disease |   2.127325    .339736     4.73   0.000     1.555593    2.909186
             |
   obese4cat |
Obese I ..)  |   .6890073   .0587808    -4.37   0.000     .5829159    .8144075
Obese II..)  |   .9306381    .110985    -0.60   0.547     .7366635    1.175689
Obese II..)  |    .966481    .178957    -0.18   0.854      .672329    1.389328
             |
1.hyperten~n |    1.09553   .0689037     1.45   0.147     .9684737    1.239256
1.cancer_e~r |   2.207308   .1340901    13.03   0.000     1.959539    2.486405
1.neuro_co~s |   1.758565   .1204018     8.24   0.000      1.53773    2.011114
1.flu_vacc~e |   .7439161   .0493646    -4.46   0.000     .6531909    .8472425
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_et
> h.ster saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table6.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 6: Ethnicity adjustments") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. file write tablecontent ("Main Analysis, dropping individuals with missing et
> hnicity") _n                                       

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,564

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  1,175

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,458

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  154

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6925034    .059348    -4.29   0.000     .5854279    .8191632
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9870921   .0852491    -0.15   0.880      .833383    1.169151
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9959425   .0869162    -0.05   0.963     .8393627    1.181732
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.002813   .0876472     0.03   0.974     .8449355    1.190189
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. file write tablecontent ("Main Analysis, adjusting for ethnicity") _n        
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,564

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  1,175

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,458

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  154

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6925034    .059348    -4.29   0.000     .5854279    .8191632
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9870921   .0852491    -0.15   0.880      .833383    1.169151
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9983378    .087146    -0.02   0.985     .8413471    1.184622
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.005321   .0878944     0.06   0.952      .847003    1.193232
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\10_an_mod
> els_ethnicity.log
  log type:  text
 closed on:  21 Jul 2020, 22:15:56
-------------------------------------------------------------------------------
