-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\11_an_mod
> els_sep_pops.log
  log type:  text
 opened on:  19 Aug 2020, 17:39:44

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 0
(26,763 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   142,513      1,638 |   144,151 
           |     98.86       1.14 |    100.00 
-----------+----------------------+----------
       HCQ |    23,516        207 |    23,723 
           |     99.13       0.87 |    100.00 
-----------+----------------------+----------
     Total |   166,029      1,845 |   167,874 
           |     98.90       1.10 |    100.00 

. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -22170.747
Iteration 1:   log likelihood = -22163.382
Iteration 2:   log likelihood =  -22163.32
Iteration 3:   log likelihood =  -22163.32
Refining estimates:
Iteration 0:   log likelihood =  -22163.32

Cox regression -- Breslow method for ties

No. of subjects =      167,874                  Number of obs    =     167,874
No. of failures =        1,845
Time at risk    =   22153032.5
                                                LR chi2(1)       =       14.85
Log likelihood  =    -22163.32                  Prob > chi2      =      0.0001

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7600193   .0560636    -3.72   0.000     .6577106    .8782424
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_ra.st
> er saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -22170.747
Iteration 1:   log likelihood = -21136.658
Iteration 2:   log likelihood = -20960.458
Iteration 3:   log likelihood =  -20947.13
Iteration 4:   log likelihood = -20945.584
Iteration 5:   log likelihood = -20945.518
Iteration 6:   log likelihood = -20945.518
Refining estimates:
Iteration 0:   log likelihood = -20945.518

Cox regression -- Breslow method for ties

No. of subjects =      167,874                  Number of obs    =     167,874
No. of failures =        1,845
Time at risk    =   22153032.5
                                                LR chi2(5)       =     2450.46
Log likelihood  =   -20945.518                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.010555   .0750795     0.14   0.888     .8736139    1.168961
      1.male |   1.226939   .0603589     4.16   0.000     1.114162    1.351131
        age1 |   1.063033   .0212289     3.06   0.002     1.022229    1.105466
        age2 |   1.036282   .0299048     1.23   0.217     .9792962    1.096583
        age3 |   .9303948   .1013581    -0.66   0.508     .7515132    1.151855
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_ra
> .ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp)                              

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16248.119
Iteration 1:   log likelihood = -15118.353
Iteration 2:   log likelihood = -14933.416
Iteration 3:   log likelihood = -14919.956
Iteration 4:   log likelihood = -14918.425
Iteration 5:   log likelihood =  -14918.36
Iteration 6:   log likelihood =  -14918.36
Refining estimates:
Iteration 0:   log likelihood =  -14918.36

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      167,874                  Number of obs    =     167,874
No. of failures =        1,845
Time at risk    =   22153032.5
                                                LR chi2(7)       =     2659.52
Log likelihood  =    -14918.36                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.016762   .0761768     0.22   0.824     .8779031    1.177585
      1.male |   1.235247   .0608436     4.29   0.000     1.121571    1.360445
        age1 |   1.065492   .0212738     3.18   0.001     1.024602    1.108015
        age2 |   1.028724    .029696     0.98   0.327     .9721369    1.088605
        age3 |   .9534582    .104026    -0.44   0.662     .7698964    1.180786
  1.dmard_pc |   .6736285   .0348266    -7.64   0.000     .6087141    .7454655
1.oral_pr~ne |   1.952836   .0968979    13.49   0.000     1.771863    2.152294
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_ra
> .ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp)     

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16248.119
Iteration 1:   log likelihood = -14873.062
Iteration 2:   log likelihood = -14550.792
Iteration 3:   log likelihood = -14534.298
Iteration 4:   log likelihood = -14533.448
Iteration 5:   log likelihood = -14533.432
Iteration 6:   log likelihood = -14533.432
Refining estimates:
Iteration 0:   log likelihood = -14533.432

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      167,874                  Number of obs    =     167,874
No. of failures =        1,845
Time at risk    =   22153032.5
                                                LR chi2(29)      =     3429.37
Log likelihood  =   -14533.432                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.022683   .0767976     0.30   0.765     .8827155    1.184845
      1.male |   1.035835   .0527919     0.69   0.490     .9373645    1.144649
        age1 |   1.061751   .0212814     2.99   0.003     1.020849    1.104292
        age2 |   1.015813   .0295357     0.54   0.589     .9595431    1.075384
        age3 |   1.010796   .1113158     0.10   0.922      .814561    1.254307
  1.dmard_pc |   .7751746    .040592    -4.86   0.000     .6995622    .8589596
1.oral_pr~ne |   1.655825   .0849979     9.82   0.000     1.497339    1.831087
    1.nsaids |   .9663144   .0830106    -0.40   0.690     .8165758    1.143511
1.~c_disease |   1.615501   .0817721     9.48   0.000     1.462924    1.783991
1.resp_exc~a |   1.538094   .0829471     7.98   0.000     1.383818     1.70957
             |
egfr_cat_n~s |
      30-59  |   1.054426   .0582788     0.96   0.338     .9461707    1.175067
        <30  |   2.292906   .2267335     8.39   0.000     1.888927    2.783281
             |
1.~r_disease |   1.893387   .2844709     4.25   0.000     1.410428     2.54172
             |
   obese4cat |
Obese I ..)  |   .6798388   .0498207    -5.27   0.000     .5888807    .7848463
Obese II..)  |    .914075    .094813    -0.87   0.386     .7459168    1.120142
Obese II..)  |   1.017914   .1539945     0.12   0.907     .7567242    1.369256
             |
1.hyperten~n |   1.062362   .0565232     1.14   0.256      .957159    1.179128
1.cancer_e~r |   2.112773    .109756    14.40   0.000     1.908244    2.339223
1.neuro_co~s |    1.68623   .0993843     8.87   0.000      1.50227    1.892716
1.flu_vacc~e |   .7529888   .0423218    -5.05   0.000     .6744452    .8406793
             |
         imd |
          2  |   1.190623   .0929162     2.24   0.025     1.021754    1.387401
          3  |   1.324973   .1026696     3.63   0.000      1.13828    1.542287
          4  |     1.2548   .0999508     2.85   0.004     1.073426    1.466819
5 most de..  |   1.523742   .1210892     5.30   0.000     1.303971    1.780553
             |
     diabcat |
Controlle..  |   1.105955   .0699786     1.59   0.111     .9769631    1.251978
Uncontrol..  |   1.379225   .1247694     3.55   0.000     1.155135    1.646788
Diabetes,..  |   1.845925   .2314148     4.89   0.000     1.443786    2.360071
             |
smoke_nomiss |
     Former  |   1.128225   .0623353     2.18   0.029     1.012433    1.257261
    Current  |   1.836961   .1517071     7.36   0.000     1.562438    2.159719
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_ra
> .ster saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 1
(167,874 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    19,786        131 |    19,917 
           |     99.34       0.66 |    100.00 
-----------+----------------------+----------
       HCQ |     6,819         27 |     6,846 
           |     99.61       0.39 |    100.00 
-----------+----------------------+----------
     Total |    26,605        158 |    26,763 
           |     99.41       0.59 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1606.1733
Iteration 1:   log likelihood = -1602.4807
Iteration 2:   log likelihood = -1602.4198
Iteration 3:   log likelihood = -1602.4198
Refining estimates:
Iteration 0:   log likelihood = -1602.4198

Cox regression -- Breslow method for ties

No. of subjects =       26,763                  Number of obs    =      26,763
No. of failures =          158
Time at risk    =      3483589
                                                LR chi2(1)       =        7.51
Log likelihood  =   -1602.4198                  Prob > chi2      =      0.0061

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .5788808   .1223508    -2.59   0.010     .3825439    .8759857
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_sle.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1606.1733
Iteration 1:   log likelihood = -1521.4844
Iteration 2:   log likelihood = -1483.4381
Iteration 3:   log likelihood = -1482.9201
Iteration 4:   log likelihood = -1482.9183
Iteration 5:   log likelihood = -1482.9183
Refining estimates:
Iteration 0:   log likelihood = -1482.9183

Cox regression -- Breslow method for ties

No. of subjects =       26,763                  Number of obs    =      26,763
No. of failures =          158
Time at risk    =      3483589
                                                LR chi2(5)       =      246.51
Log likelihood  =   -1482.9183                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9618248   .2070596    -0.18   0.857      .630741    1.466699
      1.male |   1.431495    .259232     1.98   0.048     1.003793    2.041435
        age1 |   1.050024   .0405168     1.27   0.206     .9735409    1.132515
        age2 |   1.057838   .0677688     0.88   0.380     .9330143    1.199362
        age3 |    .842041   .2241132    -0.65   0.518     .4997835     1.41868
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_sl
> e.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp)                          

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -766.4492
Iteration 1:   log likelihood = -693.63459
Iteration 2:   log likelihood = -659.02322
Iteration 3:   log likelihood = -658.74295
Iteration 4:   log likelihood = -658.74274
Refining estimates:
Iteration 0:   log likelihood = -658.74274

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,713                  Number of obs    =      20,713
No. of failures =          115
Time at risk    =      2694614
                                                LR chi2(11)      =      215.41
Log likelihood  =   -658.74274                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9177543   .2355086    -0.33   0.738     .5550041    1.517598
      1.male |   1.750512   .3682024     2.66   0.008     1.159107    2.643666
        age1 |   1.043737   .0445845     1.00   0.316     .9599111    1.134883
        age2 |   1.063911   .0773566     0.85   0.394     .9226027    1.226862
        age3 |   .8439295   .2583578    -0.55   0.579     .4631505    1.537766
             |
   ethnicity |
South Asian  |   1.482605    .591579     0.99   0.324     .6782422    3.240904
      Black  |   1.166942   .7093604     0.25   0.800     .3545038    3.841293
      Mixed  |   2.263964   1.650484     1.12   0.262     .5424041    9.449655
      Other  |   1.758477   1.277136     0.78   0.437     .4235759    7.300324
             |
  1.dmard_pc |    .570605   .2299503    -1.39   0.164      .259004    1.257085
1.oral_pr~ne |    3.07299   .6151494     5.61   0.000     2.075717    4.549401
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_sl
> e.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp) 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -766.4492
Iteration 1:   log likelihood =  -666.3222
Iteration 2:   log likelihood = -624.78776
Iteration 3:   log likelihood = -623.10232
Iteration 4:   log likelihood = -623.09782
Iteration 5:   log likelihood = -623.09782
Refining estimates:
Iteration 0:   log likelihood = -623.09782

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,713                  Number of obs    =      20,713
No. of failures =          115
Time at risk    =      2694614
                                                LR chi2(33)      =      286.70
Log likelihood  =   -623.09782                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    1.01998    .263566     0.08   0.939     .6146652    1.692563
      1.male |   1.495436   .3336983     1.80   0.071     .9656659    2.315841
        age1 |   1.039203   .0443625     0.90   0.368     .9557923    1.129893
        age2 |   1.055208   .0775825     0.73   0.465     .9135971    1.218769
        age3 |   .8755061   .2733618    -0.43   0.670      .474773    1.614479
             |
   ethnicity |
South Asian  |   1.492981   .6265959     0.95   0.340     .6558574    3.398591
      Black  |   1.278883   .7937834     0.40   0.692      .378881    4.316769
      Mixed  |   2.306533    1.70789     1.13   0.259      .540357    9.845513
      Other  |   1.592251    1.16659     0.63   0.526     .3787603    6.693585
             |
  1.dmard_pc |   .5199987   .2117813    -1.61   0.108     .2340621    1.155243
1.oral_pr~ne |   2.379435   .5020964     4.11   0.000     1.573467     3.59824
    1.nsaids |   1.043934   .4490106     0.10   0.920     .4493241    2.425419
1.~c_disease |   1.891296   .4080695     2.95   0.003      1.23909    2.886798
1.resp_exc~a |   1.355075   .3087548     1.33   0.182     .8669947    2.117923
             |
egfr_cat_n~s |
      30-59  |   .8572304   .2175594    -0.61   0.544     .5212766    1.409701
        <30  |   2.876254   1.114535     2.73   0.006     1.345831     6.14701
             |
1.~r_disease |   2.950473   1.036164     3.08   0.002     1.482388    5.872481
             |
   obese4cat |
Obese I ..)  |   .6606737   .2016721    -1.36   0.175     .3632084    1.201761
Obese II..)  |   .4535015   .2700467    -1.33   0.184     .1411606    1.456948
Obese II..)  |   1.023663   .6200813     0.04   0.969     .3122795    3.355601
             |
1.hyperten~n |    .732042   .1594237    -1.43   0.152     .4777071    1.121787
1.cancer_e~r |   2.588785   .5501365     4.48   0.000     1.706904    3.926293
1.neuro_co~s |   2.000498   .4529242     3.06   0.002     1.283575    3.117849
1.flu_vacc~e |   .9262465   .2101509    -0.34   0.736      .593748    1.444944
             |
         imd |
          2  |    1.70487   .5285006     1.72   0.085     .9285889    3.130108
          3  |   1.075766   .3727693     0.21   0.833     .5454606    2.121642
          4  |   1.534663   .5023842     1.31   0.191     .8079147    2.915149
5 most de..  |   1.466951   .5041597     1.11   0.265     .7479559    2.877103
             |
     diabcat |
Controlle..  |   .9324921   .2604009    -0.25   0.802     .5394421    1.611927
Uncontrol..  |   1.309388   .4986613     0.71   0.479     .6207268    2.762078
Diabetes,..  |   2.177056   1.152314     1.47   0.142     .7714883    6.143418
             |
smoke_nomiss |
     Former  |   .9757007   .2218417    -0.11   0.914     .6248588    1.523531
    Current  |    1.48721   .4693946     1.26   0.209     .8011527    2.760764
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_sl
> e.ster saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7a_sep.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7a: RA and SLE populations separately") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Rheumatoid arthritis (RA)") _n                     
>                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 0
  144,151

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 0
  1,638

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 0
  23,723

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 0
  207

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7600193   .0560636    -3.72   0.000     .6577106    .8782424
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.010555   .0750795     0.14   0.888     .8736139    1.168961
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.016762   .0761768     0.22   0.824     .8779031    1.177585
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.022683   .0767976     0.30   0.765     .8827155    1.184845
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model  ==========================*/
. file write tablecontent ("Systemic lupus erythematosus (SLE)") _n            
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 1
  19,917

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 1
  131

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 1
  6,846

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 1
  27

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_sle 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5788808   .1223508    -2.59   0.010     .3825439    .8759857
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9618248   .2070596    -0.18   0.857      .630741    1.466699
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9177543   .2355086    -0.33   0.738     .5550041    1.517598
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.01998    .263566     0.08   0.939     .6146652    1.692563
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* INDICATOR VARIABLE========================================================
> */ 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ONS
       HCQ |    non-covid death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   162,299      1,769 |   164,068 
           |     98.92       1.08 |    100.00 
-----------+----------------------+----------
       HCQ |    30,335        234 |    30,569 
           |     99.23       0.77 |    100.00 
-----------+----------------------+----------
     Total |   192,634      2,003 |   194,637 
           |     98.97       1.03 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24361.893
Iteration 1:   log likelihood =  -24347.74
Iteration 2:   log likelihood =  -24347.56
Iteration 3:   log likelihood =  -24347.56
Refining estimates:
Iteration 0:   log likelihood =  -24347.56

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =        2,003
Time at risk    =   25636621.5
                                                LR chi2(1)       =       28.67
Log likelihood  =    -24347.56                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7005092   .0487285    -5.12   0.000     .6112276    .8028322
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_ind.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24361.893
Iteration 1:   log likelihood = -23209.477
Iteration 2:   log likelihood = -22997.781
Iteration 3:   log likelihood = -22984.572
Iteration 4:   log likelihood = -22983.074
Iteration 5:   log likelihood = -22983.023
Iteration 6:   log likelihood = -22983.022
Refining estimates:
Iteration 0:   log likelihood = -22983.022

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =        2,003
Time at risk    =   25636621.5
                                                LR chi2(5)       =     2757.74
Log likelihood  =   -22983.022                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9994149   .0700884    -0.01   0.993     .8710669    1.146674
      1.male |   1.244853   .0590071     4.62   0.000     1.134411    1.366048
        age1 |   1.061167   .0187132     3.37   0.001     1.025116    1.098485
        age2 |   1.039349   .0270178     1.48   0.138     .9877214    1.093675
        age3 |    .919096   .0914212    -0.85   0.396     .7562981    1.116937
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_in
> d.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone, strata(stp)                             

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12990.032
Iteration 1:   log likelihood = -12032.843
Iteration 2:   log likelihood = -11854.842
Iteration 3:   log likelihood = -11846.389
Iteration 4:   log likelihood =  -11845.46
Iteration 5:   log likelihood = -11845.435
Iteration 6:   log likelihood = -11845.435
Iteration 7:   log likelihood = -11845.435
Refining estimates:
Iteration 0:   log likelihood = -11845.435

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =        1,493
Time at risk    =     19665328
                                                LR chi2(12)      =     2289.19
Log likelihood  =   -11845.435                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9623867   .0799914    -0.46   0.645     .8177106     1.13266
             |
  population |
        SLE  |   .7902348   .0783165    -2.38   0.018     .6507251    .9596542
      1.male |   1.237254   .0682993     3.86   0.000     1.110377    1.378628
        age1 |   1.067652   .0216587     3.23   0.001     1.026034    1.110957
        age2 |   1.020189   .0304594     0.67   0.503      .962203     1.08167
        age3 |   .9973171   .1140141    -0.02   0.981      .797119    1.247795
             |
   ethnicity |
South Asian  |   .6783331   .1115598    -2.36   0.018     .4914201    .9363389
      Black  |   .7056912   .1999103    -1.23   0.219     .4050269    1.229548
      Mixed  |   1.005688   .4134348     0.01   0.989     .4493006    2.251071
      Other  |   .8988785   .3213944    -0.30   0.766     .4460192    1.811542
             |
  1.dmard_pc |   .6578599   .0392814    -7.01   0.000     .5852041    .7395362
1.oral_pr~ne |   2.022089   .1116093    12.76   0.000     1.814755    2.253109
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_in
> d.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egf
> r_cat_nomiss i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever
>  i.neuro_conditions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp)
>     

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12990.032
Iteration 1:   log likelihood =  -11838.36
Iteration 2:   log likelihood = -11528.826
Iteration 3:   log likelihood = -11513.571
Iteration 4:   log likelihood = -11513.029
Iteration 5:   log likelihood = -11513.025
Iteration 6:   log likelihood = -11513.025
Refining estimates:
Iteration 0:   log likelihood = -11513.025

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =        1,493
Time at risk    =     19665328
                                                LR chi2(34)      =     2954.01
Log likelihood  =   -11513.025                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9793098    .081568    -0.25   0.802     .8318067     1.15297
             |
  population |
        SLE  |   .7618654   .0757068    -2.74   0.006     .6270383    .9256833
      1.male |   1.041336   .0593692     0.71   0.477     .9312407    1.164448
        age1 |   1.063848   .0216428     3.04   0.002     1.022263    1.107124
        age2 |   1.006869   .0302567     0.23   0.820     .9492791    1.067952
        age3 |    1.05666   .1218837     0.48   0.633     .8428512    1.324707
             |
   ethnicity |
South Asian  |   .6841929   .1145227    -2.27   0.023     .4928348    .9498516
      Black  |   .6697838   .1902278    -1.41   0.158     .3838678    1.168659
      Mixed  |    .974549   .4016038    -0.06   0.950     .4345405    2.185632
      Other  |   .8652056   .3098429    -0.40   0.686     .4288363     1.74561
             |
  1.dmard_pc |   .7518292   .0453516    -4.73   0.000     .6679952    .8461845
1.oral_pr~ne |   1.698584    .097214     9.26   0.000     1.518347    1.900218
    1.nsaids |   .9141594   .0908198    -0.90   0.366     .7524139    1.110675
1.~c_disease |   1.630932   .0922257     8.65   0.000      1.45983    1.822089
1.resp_exc~a |   1.515934   .0907248     6.95   0.000      1.34815    1.704601
             |
egfr_cat_n~s |
      30-59  |   .9851755   .0618724    -0.24   0.812     .8710743    1.114223
        <30  |    2.27038     .24558     7.58   0.000     1.836652    2.806535
             |
1.~r_disease |   2.106106   .3117035     5.03   0.000     1.575805    2.814868
             |
   obese4cat |
Obese I ..)  |   .6608807    .053682    -5.10   0.000      .563614    .7749335
Obese II..)  |   .8914195   .1013109    -1.01   0.312     .7134147    1.113838
Obese II..)  |   .9283838   .1604828    -0.43   0.667     .6615866    1.302772
             |
1.hyperten~n |   1.027158   .0609879     0.45   0.652     .9143172    1.153925
1.cancer_e~r |   2.173032   .1250008    13.49   0.000     1.941342    2.432375
1.neuro_co~s |   1.695478   .1100944     8.13   0.000     1.492864    1.925592
1.flu_vacc~e |   .7579315   .0475992    -4.41   0.000     .6701519    .8572088
             |
         imd |
          2  |   1.200025   .1059949     2.06   0.039     1.009267    1.426838
          3  |   1.326832   .1162817     3.23   0.001     1.117423    1.575484
          4  |   1.251565   .1123147     2.50   0.012     1.049705    1.492244
5 most de..  |   1.519387   .1352534     4.70   0.000     1.276133    1.809011
             |
     diabcat |
Controlle..  |   1.176122   .0820356     2.33   0.020     1.025842    1.348418
Uncontrol..  |   1.563275   .1521863     4.59   0.000     1.291725    1.891911
Diabetes,..  |   1.983014   .2700774     5.03   0.000     1.518434    2.589736
             |
smoke_nomiss |
     Former  |   1.133333   .0708131     2.00   0.045     1.002703     1.28098
    Current  |   1.708314   .1585503     5.77   0.000     1.424186    2.049125
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_in
> d.ster saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7b_ind.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7b: RA and SLE populations as indicator varia
> ble") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Indicator in DAG and Fully Adjusted only") _n      
>                                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  164,068

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 
  1,769

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  30,569

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 
  234

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7005092   .0487285    -5.12   0.000     .6112276    .8028322
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9994149   .0700884    -0.01   0.993     .8710669    1.146674
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9623867   .0799914    -0.46   0.645     .8177106     1.13266
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9793098    .081568    -0.25   0.802     .8318067     1.15297
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n 

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\11_an_mod
> els_sep_pops.log
  log type:  text
 closed on:  19 Aug 2020, 17:41:04
-------------------------------------------------------------------------------
