-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\12_an_mod
> els_sa_exposure.log
  log type:  text
 opened on:  15 Jul 2020, 09:58:21

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure_sa $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
       HCQ |     outcome: ONS
 Exposure, |    non-covid death
     3 mos |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   162,253      1,482 |   163,735 
           |     99.09       0.91 |    100.00 
-----------+----------------------+----------
       HCQ |    30,302        199 |    30,501 
           |     99.35       0.65 |    100.00 
-----------+----------------------+----------
     Total |   192,555      1,681 |   194,236 
           |     99.13       0.87 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure_sa 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20445.231
Iteration 1:   log likelihood = -20434.343
Iteration 2:   log likelihood = -20434.216
Iteration 3:   log likelihood = -20434.216
Refining estimates:
Iteration 0:   log likelihood = -20434.216

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,681
Time at risk    =     21616600
                                                LR chi2(1)       =       22.03
Log likelihood  =   -20434.216                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 exposure_sa |
        HCQ  |   .7121685   .0537671    -4.50   0.000     .6142129    .8257461
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_sa_exposure, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univa
> r_sa_exposure.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/univar_sa_ex
> posure.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. * Age fit as spline 
. 
. stcox i.exposure_sa i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20445.231
Iteration 1:   log likelihood = -19465.851
Iteration 2:   log likelihood = -19291.981
Iteration 3:   log likelihood = -19281.835
Iteration 4:   log likelihood = -19280.648
Iteration 5:   log likelihood =  -19280.61
Iteration 6:   log likelihood =  -19280.61
Iteration 7:   log likelihood =  -19280.61
Refining estimates:
Iteration 0:   log likelihood =  -19280.61

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,681
Time at risk    =     21616600
                                                LR chi2(5)       =     2329.24
Log likelihood  =    -19280.61                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 exposure_sa |
        HCQ  |   1.020973   .0777381     0.27   0.785     .8794333    1.185293
      1.male |    1.29937     .06683     5.09   0.000     1.174772    1.437184
        age1 |   1.067188   .0205504     3.38   0.001     1.027661    1.108236
        age2 |   1.022612    .028945     0.79   0.430     .9674259    1.080946
        age3 |   .9957807   .1076169    -0.04   0.969     .8056973    1.230709
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_sa_exposure, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multi
> var1_sa_exposure.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar1_sa
> _exposure.ster saved

. 
. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
.         *Note: ethnicity missing for ~20-25%. will model ethnicity in several
>  ways in separate do file
. 
. stcox i.exposure_sa i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, str
> ata(stp)                           

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15041.438
Iteration 1:   log likelihood = -13969.356
Iteration 2:   log likelihood = -13789.827
Iteration 3:   log likelihood = -13779.402
Iteration 4:   log likelihood = -13778.205
Iteration 5:   log likelihood = -13778.167
Iteration 6:   log likelihood = -13778.167
Refining estimates:
Iteration 0:   log likelihood = -13778.167

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,681
Time at risk    =     21616600
                                                LR chi2(7)       =     2526.54
Log likelihood  =   -13778.167                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 exposure_sa |
        HCQ  |   1.016153   .0779727     0.21   0.835     .8742659    1.181067
      1.male |   1.313637    .067663     5.30   0.000     1.187495    1.453179
        age1 |   1.069902   .0206052     3.51   0.000     1.030269    1.111059
        age2 |   1.015393   .0287634     0.54   0.590      .960554    1.073362
        age3 |   1.019118   .1103694     0.17   0.861     .8242146    1.260111
  1.dmard_pc |   .6651912   .0369186    -7.35   0.000     .5966288    .7416326
1.oral_pr~ne |   2.014915   .1046884    13.48   0.000     1.819831    2.230912
------------------------------------------------------------------------------
                                                             Stratified by stp

.                                                                              
>    
. estimates save $Tempdir/multivar2_sa_exposure, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multi
> var2_sa_exposure.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar2_sa
> _exposure.ster saved

. 
. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. 
. stcox i.exposure_sa i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.ns
> aids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic
> _liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions, s
> trata(stp)       

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15041.438
Iteration 1:   log likelihood = -13781.771
Iteration 2:   log likelihood = -13502.621
Iteration 3:   log likelihood = -13488.129
Iteration 4:   log likelihood = -13487.457
Iteration 5:   log likelihood = -13487.449
Iteration 6:   log likelihood = -13487.449
Refining estimates:
Iteration 0:   log likelihood = -13487.449

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,681
Time at risk    =     21616600
                                                LR chi2(19)      =     3107.98
Log likelihood  =   -13487.449                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 exposure_sa |
        HCQ  |   1.004133    .077083     0.05   0.957     .8638694    1.167171
      1.male |   1.118365   .0585446     2.14   0.033     1.009309    1.239203
        age1 |   1.068953   .0207942     3.43   0.001     1.028964    1.110496
        age2 |   .9848479   .0282036    -0.53   0.594     .9310926    1.041707
        age3 |   1.167886   .1279414     1.42   0.157     .9422187    1.447602
  1.dmard_pc |   .7341304   .0409972    -5.53   0.000     .6580186    .8190459
1.oral_pr~ne |   1.700421   .0914146     9.87   0.000     1.530368     1.88937
    1.nsaids |   .9423084   .0867167    -0.65   0.518     .7867931    1.128562
1.~c_disease |   1.652264   .0874223     9.49   0.000     1.489505    1.832809
1.resp_exc~a |   1.656191   .0916947     9.11   0.000      1.48588    1.846022
             |
egfr_cat_n~s |
      30-59  |   .9980619   .0585792    -0.03   0.974     .8896065    1.119739
        <30  |   2.309045    .236892     8.16   0.000     1.888448    2.823318
             |
1.~r_disease |   1.910674   .2868961     4.31   0.000     1.423557    2.564473
             |
   obese4cat |
Obese I ..)  |   .7116701   .0539583    -4.49   0.000     .6133964    .8256885
Obese II..)  |   .8687229   .0970078    -1.26   0.208     .6979591    1.081266
Obese II..)  |   1.070513    .168415     0.43   0.665     .7864649    1.457151
             |
1.hyperten~n |   1.091303   .0605359     1.58   0.115     .9788766    1.216641
1.cancer_e~r |   2.152539   .1164459    14.17   0.000     1.935992    2.393307
1.neuro_co~s |   1.736201    .106335     9.01   0.000     1.539811    1.957639
------------------------------------------------------------------------------
                                                             Stratified by stp

.                                                                              
>    
. estimates save $Tempdir/multivar3_sa_exposure, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multi
> var3_sa_exposure.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens1/tempdata/multivar3_sa
> _exposure.ster saved

. 
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table8.txt, write text replace
(note: file E:\analyses\hydroxychloroquine-research/output/sens1/tabfig/table8.
> txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 8: Association between HCQ use and $tableoutc
> ome, 3 month window") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure_sa 0

. local lab1: label exposure_sa 1

.  
. /* Counts */
.  
. * First row, exposure_sa = 0 (reference)
. 
.         cou if exposure_sa == 0 
  163,735

.         local rowdenom = r(N)

.         cou if exposure_sa == 0 & $outcome == 1
  1,482

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure_sa = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure_sa == 1 
  30,501

.         local rowdenom = r(N)

.         cou if exposure_sa == 1 & $outcome == 1
  199

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_sa_exposure 

. lincom 1.exposure_sa, eform

 ( 1)  1.exposure_sa = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7121685   .0537671    -4.50   0.000     .6142129    .8257461
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $Tempdir/multivar1_sa_exposure 

. lincom 1.exposure_sa, eform

 ( 1)  1.exposure_sa = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.020973   .0777381     0.27   0.785     .8794333    1.185293
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $Tempdir/multivar2_sa_exposure 

. lincom 1.exposure_sa, eform

 ( 1)  1.exposure_sa = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.016153   .0779727     0.21   0.835     .8742659    1.181067
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $Tempdir/multivar3_sa_exposure 

. lincom 1.exposure_sa, eform

 ( 1)  1.exposure_sa = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.004133    .077083     0.05   0.957     .8638694    1.167171
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens1/log\12_an_mod
> els_sa_exposure.log
  log type:  text
 closed on:  15 Jul 2020, 09:58:45
-------------------------------------------------------------------------------
