-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\05_an_des
> criptive_plots.log
  log type:  text
 opened on:  19 Jul 2020, 18:30:35

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   162,571      1,164 |   163,735 
       HCQ |    30,327        174 |    30,501 
-----------+----------------------+----------
     Total |   192,898      1,338 |   194,236 

. 
. /* Generate KM PLOT==========================================================
> =*/ 
. 
. count if exposure != .u
  194,236

. noi display "RUNNING THE KM PLOT FOR `r(N)' PEOPLE WITH NON-MISSING EXPOSURE"
RUNNING THE KM PLOT FOR 194236 PEOPLE WITH NON-MISSING EXPOSURE

. 
. sts graph, by(exposure) failure ci                                           
>                                    ///     
>                    title("Time to $tableoutcome", justification(left) size(me
> dsmall) )             ///
>                    xtitle("Days since 1 Mar 2020", size(small))              
>                            ///
>                    yscale(range(0, $ymax))                                   
>                                                    ///
>                    ylabel(0 (0.001) $ymax, angle(0) format(%4.3f) labsize(sma
> ll))       ///
>                    xscale(range(30, 84))                                     
>                                                    ///
>                    xlabel(0 (20) 160, labsize(small))                        
>                                    ///                             
>                    legend(size(vsmall) label (1 "No HCQ") label (2 "HCQ") reg
> ion(lwidth(none)) position(12))    ///
>                    graphregion(fcolor(white)) ///       
>                    risktable(,size(vsmall) order (1 "No HCQ" 2 "HCQ") title(,
> size(vsmall))) ///
>                    saving(kmplot1, replace)

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
(note: file kmplot1.gph not found)
(file kmplot1.gph saved)
(file kmplot1.gph saved)

. 
. graph export "$Tabfigdir/kmplot1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/sens2/tabfig/kmplot1.svg w
> ritten in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase kmplot1.gph

. 
. 
. 
. 
. 
. 
. 
. /* DAG Adjusted curves ======================================================
> =*/ 
. stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone, df(4) scale(ha
> zard) eform /*strata(stp population) ******************** TO DO: HOW TO HANDL
> E STRATA ***/ 

Iteration 0:   log likelihood = -8841.2789  
Iteration 1:   log likelihood = -8670.1094  
Iteration 2:   log likelihood = -8597.9125  
Iteration 3:   log likelihood = -8593.4002  
Iteration 4:   log likelihood = -8593.3897  
Iteration 5:   log likelihood = -8593.3897  

Log likelihood = -8593.3897                     Number of obs     =    194,236

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
    exposure |    .891565   .0735803    -1.39   0.164     .7584096    1.048099
        male |   1.228463   .0715547     3.53   0.000     1.095927    1.377026
        age1 |   1.000864   .0076315     0.11   0.910      .986018    1.015934
        age2 |   1.010509   .0153105     0.69   0.490     .9809421    1.040967
        age3 |    1.15382   .0815238     2.03   0.043     1.004606    1.325196
    dmard_pc |    .959183   .0556342    -0.72   0.472     .8561117    1.074664
oral_pred~ne |   1.969634    .117717    11.34   0.000     1.751913    2.214411
       _rcs1 |   1.919215   .0913289    13.70   0.000     1.748308    2.106829
       _rcs2 |   1.358377   .0622046     6.69   0.000     1.241769    1.485934
       _rcs3 |   1.020035    .009064     2.23   0.026     1.002423    1.037955
       _rcs4 |   1.000371   .0013956     0.27   0.790     .9976393     1.00311
       _cons |   .0032186   .0011371   -16.24   0.000     .0016104    .0064325
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    194,236    126.5102    14.98095          1        129

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range days 0 `tmax' `tmaxplus1'
(194,106 missing values generated)

. stpm2_standsurv if exposure == 1, at1(exposure 0) at2(exposure 1) timevar(day
> s) ci contrast(difference) fail

. 
. gen date = d(1/3/2020)+ days
(194,106 missing values generated)

. format date %tddd_Month

. 
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci: replace X=100*X

->  replace _at1=100*_at1
(129 real changes made)

->  replace _at2=100*_at2
(129 real changes made)

->  replace _at1_lci=100*_at1_lci
(129 real changes made)

->  replace _at1_uci=100*_at1_uci
(129 real changes made)

->  replace _at2_lci=100*_at2_lci
(129 real changes made)

->  replace _at2_uci=100*_at2_uci
(129 real changes made)

. 
. *l date days _at1 _at1_lci _at1_uci _at2 _at2_lci _at2_uci if days<.
. 
. twoway  (rarea _at1_lci _at1_uci days, color(red%25)) ///
>                  (rarea _at2_lci _at2_uci days if _at2_uci<1, color(blue%25))
>  ///
>                  (line _at1 days, sort lcolor(red)) ///
>                  (line _at2  days, sort lcolor(blue)) ///
>                  , legend(order(1 "No HCQ" 2 "HCQ") ring(0) cols(1) pos(11) r
> egion(lwidth(none))) ///
>                                  title("Time to $tableoutcome", justification
> (left) size(medsmall) )       ///
>                                  yscale(range(0, 1))                         
>                                                            ///
>                                  ylabel(0 (0.1) 1, angle(0) format(%4.1f) lab
> size(small))       ///
>                                  xlabel(0 (20) 160, labsize(small))          
>                                                    ///                     
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days since 1 Mar 2020", size(small))                
>    ///
>                                  graphregion(fcolor(white)) saving(adjcurv1, 
> replace)
(note: file adjcurv1.gph not found)
(file adjcurv1.gph saved)

. 
. graph export "$Tabfigdir/adjcurv1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/sens2/tabfig/adjcurv1.svg 
> written in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adjcurv1.gph

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\05_an_des
> criptive_plots.log
  log type:  text
 closed on:  19 Jul 2020, 18:31:26
-------------------------------------------------------------------------------
