-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\06_an_mod
> els.log
  log type:  text
 opened on:  15 Jul 2020, 09:59:32

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   162,571      1,164 |   163,735 
           |     99.29       0.71 |    100.00 
-----------+----------------------+----------
       HCQ |    30,327        174 |    30,501 
           |     99.43       0.57 |    100.00 
-----------+----------------------+----------
     Total |   192,898      1,338 |   194,236 
           |     99.31       0.69 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16269.383
Iteration 1:   log likelihood = -16265.038
Iteration 2:   log likelihood = -16265.013
Iteration 3:   log likelihood = -16265.013
Refining estimates:
Iteration 0:   log likelihood = -16265.013

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24574010
                                                LR chi2(1)       =        8.74
Log likelihood  =   -16265.013                  Prob > chi2      =      0.0031

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7917485   .0643524    -2.87   0.004     .6751537    .9284787
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univa
> r.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar.ster 
> saved

. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. * Age fit as spline 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16269.383
Iteration 1:   log likelihood =  -16175.04
Iteration 2:   log likelihood =   -16033.3
Iteration 3:   log likelihood = -16027.877
Iteration 4:   log likelihood = -16027.861
Iteration 5:   log likelihood = -16027.861
Refining estimates:
Iteration 0:   log likelihood = -16027.861

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24574010
                                                LR chi2(5)       =      483.04
Log likelihood  =   -16027.861                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9373163   .0767394    -0.79   0.429      .798357    1.100462
      1.male |   1.222607   .0711593     3.45   0.001     1.090799    1.370343
        age1 |   1.000367   .0076102     0.05   0.962     .9855622    1.015395
        age2 |   1.016745   .0153658     1.10   0.272     .9870701    1.047312
        age3 |   1.118955   .0787213     1.60   0.110     .9748287    1.284389
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multi
> var1.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1.st
> er saved

. 
. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
.         *Note: ethnicity missing for ~20-25%. will model ethnicity in several
>  ways in separate do file
. 
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp)                              

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11993.384
Iteration 1:   log likelihood = -11847.676
Iteration 2:   log likelihood = -11687.686
Iteration 3:   log likelihood = -11682.119
Iteration 4:   log likelihood = -11682.104
Iteration 5:   log likelihood = -11682.104
Refining estimates:
Iteration 0:   log likelihood = -11682.104

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24574010
                                                LR chi2(7)       =      622.56
Log likelihood  =   -11682.104                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8840351   .0731479    -1.49   0.136     .7516894    1.039682
      1.male |   1.238955   .0721924     3.68   0.000     1.105241    1.388845
        age1 |   1.001727   .0076544     0.23   0.821     .9868366    1.016843
        age2 |   1.010744    .015349     0.70   0.482     .9811038    1.041279
        age3 |   1.155543   .0818752     2.04   0.041     1.005715    1.327693
  1.dmard_pc |   .9877547   .0575305    -0.21   0.832      .881195      1.1072
1.oral_pr~ne |   1.948781   .1167859    11.13   0.000     1.732817    2.191662
------------------------------------------------------------------------------
                                                             Stratified by stp

.                                                                              
>    
. estimates save $Tempdir/multivar2, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multi
> var2.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2.st
> er saved

. 
. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. 
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions, stra
> ta(stp)  

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11993.384
Iteration 1:   log likelihood = -11640.809
Iteration 2:   log likelihood = -11605.024
Iteration 3:   log likelihood = -11604.884
Iteration 4:   log likelihood = -11604.884
Refining estimates:
Iteration 0:   log likelihood = -11604.884

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24574010
                                                LR chi2(19)      =      777.00
Log likelihood  =   -11604.884                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8757294   .0725117    -1.60   0.109      .744542    1.030032
      1.male |   1.195283   .0706622     3.02   0.003      1.06451    1.342121
        age1 |   .9975294   .0076711    -0.32   0.748     .9826071    1.012678
        age2 |   1.005099   .0154718     0.33   0.741     .9752275    1.035885
        age3 |   1.181519   .0847973     2.32   0.020      1.02648    1.359976
  1.dmard_pc |   1.039727   .0609689     0.66   0.506     .9268418    1.166362
1.oral_pr~ne |   1.801517   .1116185     9.50   0.000      1.59551    2.034123
    1.nsaids |    .997245   .0844534    -0.03   0.974      .844727    1.177301
1.~c_disease |    1.29301    .085309     3.89   0.000     1.136166    1.471504
1.resp_exc~a |   1.155552   .0818624     2.04   0.041     1.005746    1.327672
             |
egfr_cat_n~s |
      30-59  |   1.124512   .0830428     1.59   0.112     .9729819    1.299642
        <30  |   2.411783   .3381148     6.28   0.000     1.832339    3.174466
             |
1.~r_disease |     1.1164    .240632     0.51   0.609     .7317271    1.703296
             |
   obese4cat |
Obese I ..)  |   1.243744   .0885765     3.06   0.002     1.081709    1.430051
Obese II..)  |   1.393542   .1409694     3.28   0.001     1.142914    1.699131
Obese II..)  |   1.645806   .2195651     3.73   0.000     1.267129    2.137649
             |
1.hyperten~n |   1.071734   .0670493     1.11   0.268     .9480569    1.211544
1.cancer_e~r |   1.152994    .090286     1.82   0.069     .9889467    1.344252
1.neuro_co~s |   1.757663   .1370855     7.23   0.000     1.508509    2.047969
------------------------------------------------------------------------------
                                                             Stratified by stp

.                                                                              
>    
. estimates save $Tempdir/multivar3, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multi
> var3.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3.st
> er saved

. 
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table2.txt, write text replace
(note: file E:\analyses\hydroxychloroquine-research/output/sens2/tabfig/table2.
> txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between HCQ use and $tableoutc
> ome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  163,735

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  1,164

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  30,501

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  174

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7917485   .0643524    -2.87   0.004     .6751537    .9284787
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9373163   .0767394    -0.79   0.429      .798357    1.100462
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8840351   .0731479    -1.49   0.136     .7516894    1.039682
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8757294   .0725117    -1.60   0.109      .744542    1.030032
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\06_an_mod
> els.log
  log type:  text
 closed on:  15 Jul 2020, 09:59:53
-------------------------------------------------------------------------------
