-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\06_an_mod
> els.log
  log type:  text
 opened on:  17 Aug 2020, 10:20:50

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   163,207      1,204 |   164,411 
           |     99.27       0.73 |    100.00 
-----------+----------------------+----------
       HCQ |    30,428        181 |    30,609 
           |     99.41       0.59 |    100.00 
-----------+----------------------+----------
     Total |   193,635      1,385 |   195,020 
           |     99.29       0.71 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16841.236
Iteration 2:   log likelihood = -16841.213
Iteration 3:   log likelihood = -16841.213
Refining estimates:
Iteration 0:   log likelihood = -16841.213

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(1)       =        8.62
Log likelihood  =   -16841.213                  Prob > chi2      =      0.0033

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7963854   .0634887    -2.86   0.004     .6811843    .9310692
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar.ster 
> saved

. parmest, label eform format(estimate p lb ub) saving("$Tempdir/parmest_univar
> _$outcome", replace) idstr("parmest_univar_$outcome") 
(note: file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/parme
> st_univar_firstpos_sgss.dta not found)
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/parmest_univ
> ar_firstpos_sgss.dta saved

. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. * Age fit as spline 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16748.837
Iteration 2:   log likelihood = -16616.054
Iteration 3:   log likelihood = -16611.085
Iteration 4:   log likelihood = -16611.071
Iteration 5:   log likelihood = -16611.071
Refining estimates:
Iteration 0:   log likelihood = -16611.071

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(5)       =      468.91
Log likelihood  =   -16611.071                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9367614   .0752179    -0.81   0.416     .8003522     1.09642
      1.male |   1.213763   .0695371     3.38   0.001     1.084846       1.358
        age1 |   .9968206   .0071868    -0.44   0.659     .9828339    1.011006
        age2 |   1.019406   .0148317     1.32   0.186     .9907474    1.048895
        age3 |   1.111656   .0759168     1.55   0.121     .9723905    1.270868
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1.st
> er saved

. parmest, label eform format(estimate p lb ub) saving("$Tempdir/parmest_multiv
> ar1_$outcome", replace) idstr("parmest_multivar1_$outcome") 
(note: file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/parme
> st_multivar1_firstpos_sgss.dta not found)
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/parmest_mult
> ivar1_firstpos_sgss.dta saved

. 
. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
.         *Note: ethnicity missing for ~20-25%. will model ethnicity in several
>  ways in separate do file
. 
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11812.025
Iteration 2:   log likelihood = -11676.014
Iteration 3:   log likelihood = -11671.706
Iteration 4:   log likelihood = -11671.696
Iteration 5:   log likelihood = -11671.696
Refining estimates:
Iteration 0:   log likelihood = -11671.696

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(7)       =      587.92
Log likelihood  =   -11671.696                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8917522   .0727633    -1.40   0.160     .7599581    1.046402
      1.male |   1.221612   .0702512     3.48   0.000     1.091398    1.367361
        age1 |   .9974764   .0072286    -0.35   0.727     .9834087    1.011745
        age2 |    1.01385   .0148182     0.94   0.347     .9852185    1.043313
        age3 |   1.146464   .0788427     1.99   0.047     1.001897    1.311891
  1.dmard_pc |   .9779005   .0568646    -0.38   0.701     .8725646    1.095953
1.oral_pr~ne |    1.90472   .1128713    10.87   0.000      1.69586    2.139303
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2.st
> er saved

. parmest, label eform format(estimate p lb ub) saving("$Tempdir/parmest_multiv
> ar2_$outcome", replace) idstr("parmest_multivar2_$outcome") 
(note: file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/parme
> st_multivar2_firstpos_sgss.dta not found)
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/parmest_mult
> ivar2_firstpos_sgss.dta saved

. 
. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. 
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)  

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11588.206
Iteration 2:   log likelihood = -11542.369
Iteration 3:   log likelihood = -11542.092
Iteration 4:   log likelihood = -11542.092
Refining estimates:
Iteration 0:   log likelihood = -11542.092

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(29)      =      847.13
Log likelihood  =   -11542.092                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .891681   .0729784    -1.40   0.161     .7595286    1.046827
      1.male |   1.150915   .0680992     2.38   0.018     1.024892    1.292435
        age1 |   .9931767   .0072737    -0.93   0.350     .9790223    1.007536
        age2 |   1.006655    .015026     0.44   0.657     .9776307     1.03654
        age3 |   1.180714   .0829935     2.36   0.018     1.028757    1.355116
  1.dmard_pc |   1.056903   .0623394     0.94   0.348     .9415181    1.186429
1.oral_pr~ne |    1.75117   .1074094     9.13   0.000     1.552813    1.974865
    1.nsaids |   1.011034   .0838603     0.13   0.895     .8593357    1.189512
1.~c_disease |   1.225906   .0804311     3.10   0.002     1.077979    1.394133
1.resp_exc~a |   1.160693   .0824262     2.10   0.036      1.00988    1.334029
             |
egfr_cat_n~s |
      30-59  |   1.107987   .0805011     1.41   0.158     .9609266    1.277553
        <30  |    2.26795   .3130457     5.93   0.000     1.730382    2.972521
             |
1.~r_disease |   1.033768   .2231862     0.15   0.878     .6770993    1.578316
             |
   obese4cat |
Obese I ..)  |   1.168366   .0820486     2.22   0.027      1.01813    1.340771
Obese II..)  |   1.244399   .1252961     2.17   0.030     1.021537    1.515883
Obese II..)  |   1.442713   .1887231     2.80   0.005     1.116435    1.864347
             |
1.hyperten~n |   1.025214   .0638776     0.40   0.689     .9073585    1.158377
1.cancer_e~r |   1.171215   .0902502     2.05   0.040     1.007037    1.362158
1.neuro_co~s |   1.718887   .1331024     7.00   0.000     1.476843      2.0006
1.flu_vacc~e |   .8821221   .0570577    -1.94   0.052     .7770894    1.001351
             |
         imd |
          2  |   1.081484   .0981936     0.86   0.388     .9051799    1.292126
          3  |   1.237022   .1109418     2.37   0.018     1.037619    1.474745
          4  |   1.219574    .110639     2.19   0.029      1.02091    1.456896
5 most de..  |   1.447852   .1298318     4.13   0.000     1.214494    1.726049
             |
     diabcat |
Controlle..  |   1.294277    .096463     3.46   0.001     1.118373    1.497848
Uncontrol..  |   1.610542   .1632093     4.70   0.000     1.320422    1.964405
Diabetes,..  |   1.853806   .2878157     3.98   0.000     1.367445    2.513154
             |
smoke_nomiss |
     Former  |   1.162318   .0702451     2.49   0.013     1.032482    1.308482
    Current  |   .6103689   .0697083    -4.32   0.000     .4879545    .7634937
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3.st
> er saved

. parmest, label eform format(estimate p lb ub) saving("$Tempdir/parmest_multiv
> ar3_$outcome", replace) idstr("parmest_multivar3_$outcome") 
(note: file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/parme
> st_multivar3_firstpos_sgss.dta not found)
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/parmest_mult
> ivar3_firstpos_sgss.dta saved

. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table2.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between HCQ use and $tableoutc
> ome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  164,411

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  1,204

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  30,609

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  181

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7963854   .0634887    -2.86   0.004     .6811843    .9310692
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9367614   .0752179    -0.81   0.416     .8003522     1.09642
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8917522   .0727633    -1.40   0.160     .7599581    1.046402
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .891681   .0729784    -1.40   0.161     .7595286    1.046827
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\06_an_mod
> els.log
  log type:  text
 closed on:  17 Aug 2020, 10:21:19
-------------------------------------------------------------------------------
