-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\07_an_mod
> els_interact.log
  log type:  text
 opened on:  17 Aug 2020, 10:21:19

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* So few deaths occuring below 60 years this cannot be used as a category, s
> o combining 18-59 */ 
. gen agegroup2 = agegroup

. recode agegroup2(1 = 2)
(agegroup2: 13725 changes made)

. recode agegroup2(2 = 3)
(agegroup2: 33212 changes made)

. tab agegroup2, nolabel 

  agegroup2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     70,361       36.08       36.08
          4 |     45,808       23.49       59.57
          5 |     49,332       25.30       84.86
          6 |     29,519       15.14      100.00
------------+-----------------------------------
      Total |    195,020      100.00

. 
. label define agegroup2  3 "18-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup2 agegroup2

. tab agegroup agegroup2 , m

   Grouped |                  agegroup2
       age |    18-<60     60-<70     70-<80        80+ |     Total
-----------+--------------------------------------------+----------
    18-<40 |    13,725          0          0          0 |    13,725 
    40-<50 |    19,487          0          0          0 |    19,487 
    50-<60 |    37,149          0          0          0 |    37,149 
    60-<70 |         0     45,808          0          0 |    45,808 
    70-<80 |         0          0     49,332          0 |    49,332 
       80+ |         0          0          0     29,519 |    29,519 
-----------+--------------------------------------------+----------
     Total |    70,361     45,808     49,332     29,519 |   195,020 

. 
. 
. foreach intvar of varlist agegroup2 dmard_pc oral_prednisolone nsaids {
  2. /* Check Counts */ 
. 
. bysort `intvar': tab exposure $outcome, row
  3. 
. /* Univariable model */ 
. stcox i.exposure
  4. estimates store A
  5. 
. stcox i.exposure##i.`intvar'
  6. estimates store B
  7. estimates save $Tempdir/univar_int_`intvar', replace 
  8. 
. lrtest A B
  9. global univar_p_`intvar' = round(r(p),0.001)
 10. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. stcox i.exposure i.agegroup2 i.male
 11. estimates store A
 12. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male
 13. estimates store B
 14. estimates save $Tempdir/multivar1_int_`intvar', replace 
 15. 
. cap noi lrtest A B
 16. global multivar1_p_`intvar' = round(r(p),0.001)
 17. 
. * DAG Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone, strata(st
> p population)                                      
 18.                                                                           
>       
. estimates store A
 19. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e, strata(stp population)                  
 20. estimates store B
 21. estimates save $Tempdir/multivar2_int_`intvar', replace 
 22. 
. cap noi lrtest A B
 23. global multivar2_p_`intvar' = round(r(p),0.001)
 24. 
. * Fully Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone i.nsaids i
> .chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_liver
> _disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu_va
> ccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)
 25. estimates store A
 26. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.c
> hronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditi
> ons i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)
 27. estimates store B
 28. estimates save $Tempdir/multivar3_int_`intvar', replace 
 29. 
. cap noi lrtest A B
 30. global multivar3_p_`intvar' = round(r(p),0.001)
 31. 
. }

-------------------------------------------------------------------------------
-> agegroup2 = 18-<60

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    57,565        268 |    57,833 
           |     99.54       0.46 |    100.00 
-----------+----------------------+----------
       HCQ |    12,466         62 |    12,528 
           |     99.51       0.49 |    100.00 
-----------+----------------------+----------
     Total |    70,031        330 |    70,361 
           |     99.53       0.47 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 60-<70

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    37,663        162 |    37,825 
           |     99.57       0.43 |    100.00 
-----------+----------------------+----------
       HCQ |     7,948         35 |     7,983 
           |     99.56       0.44 |    100.00 
-----------+----------------------+----------
     Total |    45,611        197 |    45,808 
           |     99.57       0.43 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 70-<80

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    41,861        316 |    42,177 
           |     99.25       0.75 |    100.00 
-----------+----------------------+----------
       HCQ |     7,106         49 |     7,155 
           |     99.32       0.68 |    100.00 
-----------+----------------------+----------
     Total |    48,967        365 |    49,332 
           |     99.26       0.74 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 80+

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,118        458 |    26,576 
           |     98.28       1.72 |    100.00 
-----------+----------------------+----------
       HCQ |     2,908         35 |     2,943 
           |     98.81       1.19 |    100.00 
-----------+----------------------+----------
     Total |    29,026        493 |    29,519 
           |     98.33       1.67 |    100.00 


         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16841.236
Iteration 2:   log likelihood = -16841.213
Iteration 3:   log likelihood = -16841.213
Refining estimates:
Iteration 0:   log likelihood = -16841.213

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(1)       =        8.62
Log likelihood  =   -16841.213                  Prob > chi2      =      0.0033

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7963854   .0634887    -2.86   0.004     .6811843    .9310692
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16679.293
Iteration 2:   log likelihood = -16638.054
Iteration 3:   log likelihood = -16637.939
Iteration 4:   log likelihood = -16637.939
Refining estimates:
Iteration 0:   log likelihood = -16637.939

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(7)       =      415.17
Log likelihood  =   -16637.939                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.047785    .147661     0.33   0.740     .7949041    1.381113
             |
   agegroup2 |
     60-<70  |   .9180082     .09136    -0.86   0.390     .7553273    1.115727
     70-<80  |   1.607973   .1335286     5.72   0.000      1.36645    1.892187
        80+  |   3.752283   .2885797    17.19   0.000     3.227243    4.362743
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .9663363     .22581    -0.15   0.883     .6112553    1.527686
 HCQ#70-<80  |   .8657893   .1804358    -0.69   0.489     .5754619     1.30259
    HCQ#80+  |   .6535496   .1470344    -1.89   0.059     .4205104    1.015735
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_int_a
> gegroup2.ster saved

Likelihood-ratio test                                 LR chi2(6)  =    406.55
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16671.012
Iteration 2:   log likelihood = -16635.455
Iteration 3:   log likelihood = -16635.387
Iteration 4:   log likelihood = -16635.387
Refining estimates:
Iteration 0:   log likelihood = -16635.387

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(5)       =      420.27
Log likelihood  =   -16635.387                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9128252   .0731202    -1.14   0.255     .7801959    1.068001
             |
   agegroup2 |
     60-<70  |   .9055963   .0815622    -1.10   0.271     .7590519    1.080433
     70-<80  |   1.551878   .1180555     5.78   0.000     1.336917    1.801403
        80+  |   3.557709   .2539439    17.78   0.000     3.093235    4.091927
             |
      1.male |   1.192168   .0682039     3.07   0.002     1.065713    1.333628
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16674.495
Iteration 2:   log likelihood = -16633.247
Iteration 3:   log likelihood = -16633.132
Iteration 4:   log likelihood = -16633.132
Refining estimates:
Iteration 0:   log likelihood = -16633.132

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(8)       =      424.78
Log likelihood  =   -16633.132                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.070426   .1510453     0.48   0.630      .811794    1.411458
             |
   agegroup2 |
     60-<70  |   .9137973   .0909514    -0.91   0.365     .7518456    1.110634
     70-<80  |   1.596106   .1326003     5.63   0.000      1.35627    1.878354
        80+  |   3.745182   .2880431    17.17   0.000     3.221119    4.354508
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .9531661   .2227758    -0.21   0.837     .6028707    1.506999
 HCQ#70-<80  |    .851068   .1774352    -0.77   0.439     .5655893    1.280641
    HCQ#80+  |   .6393768    .143922    -1.99   0.047     .4112953    .9939396
             |
      1.male |   1.196531   .0685146     3.13   0.002     1.069506    1.338642
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      4.51
(Assumption: A nested in B)                           Prob > chi2 =    0.2114

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11739.772
Iteration 2:   log likelihood = -11698.236
Iteration 3:   log likelihood = -11698.165
Iteration 4:   log likelihood = -11698.165
Refining estimates:
Iteration 0:   log likelihood = -11698.165

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(7)       =      534.98
Log likelihood  =   -11698.165                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .875939   .0713409    -1.63   0.104     .7467027    1.027543
             |
   agegroup2 |
     60-<70  |   .8838642   .0800272    -1.36   0.173     .7401432    1.055493
     70-<80  |   1.492554   .1152119     5.19   0.000     1.282995    1.736342
        80+  |   3.383163   .2464404    16.73   0.000     2.933045    3.902359
             |
      1.male |   1.199954   .0689286     3.17   0.002     1.072184    1.342951
  1.dmard_pc |   .9486219   .0548578    -0.91   0.362     .8469719    1.062471
1.oral_pr~ne |   1.896931   .1124208    10.80   0.000     1.688905    2.130578
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11742.756
Iteration 2:   log likelihood = -11695.964
Iteration 3:   log likelihood = -11695.848
Iteration 4:   log likelihood = -11695.848
Refining estimates:
Iteration 0:   log likelihood = -11695.848

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(10)      =      539.62
Log likelihood  =   -11695.848                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.026535   .1469186     0.18   0.855     .7754411    1.358934
             |
   agegroup2 |
     60-<70  |   .8897615    .088917    -1.17   0.242     .7314928    1.082274
     70-<80  |   1.533686   .1289222     5.09   0.000     1.300721    1.808376
        80+  |   3.558976   .2780792    16.25   0.000     3.053633    4.147949
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |    .964951   .2258934    -0.15   0.879     .6098744    1.526758
 HCQ#70-<80  |    .853502   .1784559    -0.76   0.449     .5665388    1.285818
    HCQ#80+  |   .6373313   .1438928    -2.00   0.046     .4094361    .9920746
             |
      1.male |   1.204156   .0692255     3.23   0.001     1.075841    1.347774
  1.dmard_pc |   .9454331   .0547169    -0.97   0.332     .8440488    1.058995
1.oral_pr~ne |   1.895565    .112319    10.79   0.000     1.687726    2.128999
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      4.63
(Assumption: A nested in B)                           Prob > chi2 =    0.2006

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11895.417
Iteration 2:   log likelihood = -11597.611
Iteration 3:   log likelihood = -11564.627
Iteration 4:   log likelihood = -11562.185
Iteration 5:   log likelihood = -11562.155
Iteration 6:   log likelihood = -11562.155
Refining estimates:
Iteration 0:   log likelihood = -11562.155

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(29)      =      807.00
Log likelihood  =   -11562.155                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8768528   .0716344    -1.61   0.108     .7471158    1.029119
             |
   agegroup2 |
     60-<70  |   .7762594   .0728323    -2.70   0.007     .6458671    .9329762
     70-<80  |   1.182244   .1045727     1.89   0.058      .994068    1.406042
        80+  |   2.376068   .2203838     9.33   0.000     1.981111    2.849765
             |
      1.male |   1.129915   .0667631     2.07   0.039     1.006354    1.268646
  1.dmard_pc |   1.029235   .0604613     0.49   0.624     .9173008    1.154829
1.oral_pr~ne |    1.74235   .1069877     9.04   0.000     1.544785    1.965182
    1.nsaids |   1.000691   .0828296     0.01   0.993     .8508326    1.176945
1.~c_disease |   1.247257    .081819     3.37   0.001     1.096775    1.418384
1.resp_exc~a |   1.136535   .0806355     1.80   0.071     .9889886    1.306093
             |
egfr_cat_n~s |
      30-59  |   1.158549    .083514     2.04   0.041     1.005901    1.334361
        <30  |   2.500436   .3428111     6.68   0.000     1.911241    3.271266
             |
1.~r_disease |   1.026002   .2214468     0.12   0.905     .6720928    1.566271
             |
   obese4cat |
Obese I ..)  |   1.129615   .0789515     1.74   0.081     .9850037    1.295457
Obese II..)  |   1.193078   .1196693     1.76   0.078     .9801459    1.452268
Obese II..)  |   1.381801   .1801472     2.48   0.013      1.07022    1.784094
             |
1.hyperten~n |   1.043034   .0646443     0.68   0.497     .9237267    1.177751
1.cancer_e~r |   1.166233   .0898546     2.00   0.046     1.002774    1.356337
1.neuro_co~s |   1.756448   .1358075     7.29   0.000     1.509458    2.043854
1.flu_vacc~e |   .8876387   .0573162    -1.85   0.065      .782119    1.007395
             |
         imd |
          2  |   1.084916   .0984971     0.90   0.369     .9080664    1.296209
          3  |   1.246281   .1117655     2.46   0.014     1.045397    1.485769
          4  |   1.226994   .1113233     2.25   0.024     1.027104    1.465787
5 most de..  |   1.459761    .130849     4.22   0.000     1.224567    1.740128
             |
     diabcat |
Controlle..  |   1.271175   .0947627     3.22   0.001     1.098374     1.47116
Uncontrol..  |    1.55729   .1576893     4.37   0.000     1.276961    1.899158
Diabetes,..  |   1.869757   .2902175     4.03   0.000     1.379318    2.534579
             |
smoke_nomiss |
     Former  |   1.160541   .0700383     2.47   0.014     1.031076    1.306262
    Current  |   .5979777   .0681387    -4.51   0.000     .4782905    .7476154
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11899.521
Iteration 2:   log likelihood = -11595.816
Iteration 3:   log likelihood = -11562.791
Iteration 4:   log likelihood = -11560.351
Iteration 5:   log likelihood = -11560.322
Iteration 6:   log likelihood = -11560.322
Refining estimates:
Iteration 0:   log likelihood = -11560.322

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(32)      =      810.67
Log likelihood  =   -11560.322                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9938732    .142543    -0.04   0.966     .7503263    1.316473
             |
   agegroup2 |
     60-<70  |   .7776109   .0801234    -2.44   0.015     .6354133    .9516305
     70-<80  |    1.20758    .114407     1.99   0.046     1.002934    1.453983
        80+  |   2.482557   .2411951     9.36   0.000     2.052107    3.003299
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .9985211   .2338323    -0.01   0.995     .6309922    1.580121
 HCQ#70-<80  |   .8918634   .1866085    -0.55   0.584      .591831    1.343999
    HCQ#80+  |   .6760991   .1527723    -1.73   0.083     .4341818    1.052808
             |
      1.male |   1.133347    .067016     2.12   0.034     1.009324     1.27261
  1.dmard_pc |   1.026819   .0603581     0.45   0.653     .9150792    1.152202
1.oral_pr~ne |   1.742575   .1069909     9.05   0.000     1.545003    1.965412
    1.nsaids |   .9977869   .0826337    -0.03   0.979     .8482891    1.173631
1.~c_disease |   1.247229   .0818037     3.37   0.001     1.096775    1.418323
1.resp_exc~a |   1.137874   .0807293     1.82   0.069     .9901556    1.307629
             |
egfr_cat_n~s |
      30-59  |   1.159159    .083545     2.05   0.040     1.006454    1.335034
        <30  |    2.49591   .3421982     6.67   0.000     1.907771    3.265365
             |
1.~r_disease |   1.024616   .2211517     0.11   0.910     .6711796    1.564167
             |
   obese4cat |
Obese I ..)  |   1.129437    .078936     1.74   0.082     .9848536    1.295246
Obese II..)  |   1.193214   .1196922     1.76   0.078     .9802427    1.452456
Obese II..)  |    1.37993   .1799113     2.47   0.014     1.068759    1.781699
             |
1.hyperten~n |   1.042723   .0646187     0.68   0.500     .9234621    1.177386
1.cancer_e~r |   1.166174   .0898491     2.00   0.046     1.002724    1.356266
1.neuro_co~s |   1.752813     .13554     7.26   0.000      1.50631    2.039654
1.flu_vacc~e |   .8848073   .0571116    -1.90   0.058     .7796618    1.004133
             |
         imd |
          2  |   1.084612   .0984713     0.89   0.371     .9078087    1.295849
          3  |   1.246983    .111832     2.46   0.014     1.045979    1.486613
          4  |   1.225645   .1112072     2.24   0.025     1.025964     1.46419
5 most de..  |   1.458102   .1307083     4.21   0.000     1.223161    1.738169
             |
     diabcat |
Controlle..  |    1.27012   .0946932     3.21   0.001     1.097448     1.46996
Uncontrol..  |   1.557319   .1576753     4.38   0.000     1.277013    1.899153
Diabetes,..  |   1.871379   .2904484     4.04   0.000     1.380545    2.536722
             |
smoke_nomiss |
     Former  |     1.1605    .070036     2.47   0.014      1.03104    1.306216
    Current  |   .5986233   .0682151    -4.50   0.000     .4788024    .7484295
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      3.67
(Assumption: A nested in B)                           Prob > chi2 =    0.2998

-------------------------------------------------------------------------------
-> dmard_pc = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   107,716        796 |   108,512 
           |     99.27       0.73 |    100.00 
-----------+----------------------+----------
       HCQ |    14,751         93 |    14,844 
           |     99.37       0.63 |    100.00 
-----------+----------------------+----------
     Total |   122,467        889 |   123,356 
           |     99.28       0.72 |    100.00 

-------------------------------------------------------------------------------
-> dmard_pc = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    55,491        408 |    55,899 
           |     99.27       0.73 |    100.00 
-----------+----------------------+----------
       HCQ |    15,677         88 |    15,765 
           |     99.44       0.56 |    100.00 
-----------+----------------------+----------
     Total |    71,168        496 |    71,664 
           |     99.31       0.69 |    100.00 


         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16841.236
Iteration 2:   log likelihood = -16841.213
Iteration 3:   log likelihood = -16841.213
Refining estimates:
Iteration 0:   log likelihood = -16841.213

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(1)       =        8.62
Log likelihood  =   -16841.213                  Prob > chi2      =      0.0033

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7963854   .0634887    -2.86   0.004     .6811843    .9310692
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16840.921
Iteration 2:   log likelihood = -16840.885
Iteration 3:   log likelihood = -16840.885
Refining estimates:
Iteration 0:   log likelihood = -16840.885

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(3)       =        9.28
Log likelihood  =   -16840.885                  Prob > chi2      =      0.0258

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8416603   .0922338    -1.57   0.116     .6789808    1.043317
  1.dmard_pc |   .9894559   .0602453    -0.17   0.862     .8781507    1.114869
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .8985364   .1443923    -0.67   0.506     .6557676     1.23118
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_int_d
> mard_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      0.66
(Assumption: A nested in B)                           Prob > chi2 =    0.7204

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16671.012
Iteration 2:   log likelihood = -16635.455
Iteration 3:   log likelihood = -16635.387
Iteration 4:   log likelihood = -16635.387
Refining estimates:
Iteration 0:   log likelihood = -16635.387

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(5)       =      420.27
Log likelihood  =   -16635.387                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9128252   .0731202    -1.14   0.255     .7801959    1.068001
             |
   agegroup2 |
     60-<70  |   .9055963   .0815622    -1.10   0.271     .7590519    1.080433
     70-<80  |   1.551878   .1180555     5.78   0.000     1.336917    1.801403
        80+  |   3.557709   .2539439    17.78   0.000     3.093235    4.091927
             |
      1.male |   1.192168   .0682039     3.07   0.002     1.065713    1.333628
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16670.583
Iteration 2:   log likelihood = -16635.029
Iteration 3:   log likelihood = -16634.962
Iteration 4:   log likelihood = -16634.962
Refining estimates:
Iteration 0:   log likelihood = -16634.962

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(7)       =      421.13
Log likelihood  =   -16634.962                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9556787   .1050029    -0.41   0.680     .7705277     1.18532
  1.dmard_pc |   .9686032   .0592284    -0.52   0.602     .8592042    1.091932
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .9218477   .1481956    -0.51   0.613     .6726987    1.263275
             |
   agegroup2 |
     60-<70  |   .9089762   .0820092    -1.06   0.290     .7616507    1.084799
     70-<80  |   1.557985   .1189305     5.81   0.000     1.341485    1.809425
        80+  |   3.563443   .2545718    17.79   0.000     3.097849    4.099016
             |
      1.male |   1.194832   .0684218     3.11   0.002      1.06798    1.336752
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      0.85
(Assumption: A nested in B)                           Prob > chi2 =    0.6535

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11739.772
Iteration 2:   log likelihood = -11698.236
Iteration 3:   log likelihood = -11698.165
Iteration 4:   log likelihood = -11698.165
Refining estimates:
Iteration 0:   log likelihood = -11698.165

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(7)       =      534.98
Log likelihood  =   -11698.165                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .875939   .0713409    -1.63   0.104     .7467027    1.027543
             |
   agegroup2 |
     60-<70  |   .8838642   .0800272    -1.36   0.173     .7401432    1.055493
     70-<80  |   1.492554   .1152119     5.19   0.000     1.282995    1.736342
        80+  |   3.383163   .2464404    16.73   0.000     2.933045    3.902359
             |
      1.male |   1.199954   .0689286     3.17   0.002     1.072184    1.342951
  1.dmard_pc |   .9486219   .0548578    -0.91   0.362     .8469719    1.062471
1.oral_pr~ne |   1.896931   .1124208    10.80   0.000     1.688905    2.130578
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11739.741
Iteration 2:   log likelihood = -11698.198
Iteration 3:   log likelihood = -11698.128
Iteration 4:   log likelihood = -11698.127
Refining estimates:
Iteration 0:   log likelihood = -11698.127

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(8)       =      535.06
Log likelihood  =   -11698.127                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8944867   .0992398    -1.01   0.315     .7196749    1.111761
  1.dmard_pc |   .9546373    .059338    -0.75   0.455      .845142    1.078319
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .9565656    .154128    -0.28   0.783     .6975312    1.311795
             |
   agegroup2 |
     60-<70  |   .8836484   .0800118    -1.37   0.172     .7399557    1.055245
     70-<80  |   1.491819   .1151873     5.18   0.000     1.282309     1.73556
        80+  |   3.381938   .2463919    16.72   0.000     2.931914    3.901038
             |
      1.male |   1.200168   .0689466     3.18   0.001     1.072365    1.343202
1.oral_pr~ne |   1.895951    .112421    10.79   0.000     1.687931    2.129606
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.08
(Assumption: A nested in B)                           Prob > chi2 =    0.7828

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11895.417
Iteration 2:   log likelihood = -11597.611
Iteration 3:   log likelihood = -11564.627
Iteration 4:   log likelihood = -11562.185
Iteration 5:   log likelihood = -11562.155
Iteration 6:   log likelihood = -11562.155
Refining estimates:
Iteration 0:   log likelihood = -11562.155

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(29)      =      807.00
Log likelihood  =   -11562.155                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8768528   .0716344    -1.61   0.108     .7471158    1.029119
             |
   agegroup2 |
     60-<70  |   .7762594   .0728323    -2.70   0.007     .6458671    .9329762
     70-<80  |   1.182244   .1045727     1.89   0.058      .994068    1.406042
        80+  |   2.376068   .2203838     9.33   0.000     1.981111    2.849765
             |
      1.male |   1.129915   .0667631     2.07   0.039     1.006354    1.268646
  1.dmard_pc |   1.029235   .0604613     0.49   0.624     .9173008    1.154829
1.oral_pr~ne |    1.74235   .1069877     9.04   0.000     1.544785    1.965182
    1.nsaids |   1.000691   .0828296     0.01   0.993     .8508326    1.176945
1.~c_disease |   1.247257    .081819     3.37   0.001     1.096775    1.418384
1.resp_exc~a |   1.136535   .0806355     1.80   0.071     .9889886    1.306093
             |
egfr_cat_n~s |
      30-59  |   1.158549    .083514     2.04   0.041     1.005901    1.334361
        <30  |   2.500436   .3428111     6.68   0.000     1.911241    3.271266
             |
1.~r_disease |   1.026002   .2214468     0.12   0.905     .6720928    1.566271
             |
   obese4cat |
Obese I ..)  |   1.129615   .0789515     1.74   0.081     .9850037    1.295457
Obese II..)  |   1.193078   .1196693     1.76   0.078     .9801459    1.452268
Obese II..)  |   1.381801   .1801472     2.48   0.013      1.07022    1.784094
             |
1.hyperten~n |   1.043034   .0646443     0.68   0.497     .9237267    1.177751
1.cancer_e~r |   1.166233   .0898546     2.00   0.046     1.002774    1.356337
1.neuro_co~s |   1.756448   .1358075     7.29   0.000     1.509458    2.043854
1.flu_vacc~e |   .8876387   .0573162    -1.85   0.065      .782119    1.007395
             |
         imd |
          2  |   1.084916   .0984971     0.90   0.369     .9080664    1.296209
          3  |   1.246281   .1117655     2.46   0.014     1.045397    1.485769
          4  |   1.226994   .1113233     2.25   0.024     1.027104    1.465787
5 most de..  |   1.459761    .130849     4.22   0.000     1.224567    1.740128
             |
     diabcat |
Controlle..  |   1.271175   .0947627     3.22   0.001     1.098374     1.47116
Uncontrol..  |    1.55729   .1576893     4.37   0.000     1.276961    1.899158
Diabetes,..  |   1.869757   .2902175     4.03   0.000     1.379318    2.534579
             |
smoke_nomiss |
     Former  |   1.160541   .0700383     2.47   0.014     1.031076    1.306262
    Current  |   .5979777   .0681387    -4.51   0.000     .4782905    .7476154
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood =  -11895.34
Iteration 2:   log likelihood =  -11597.54
Iteration 3:   log likelihood = -11564.555
Iteration 4:   log likelihood = -11562.112
Iteration 5:   log likelihood = -11562.083
Iteration 6:   log likelihood = -11562.083
Refining estimates:
Iteration 0:   log likelihood = -11562.083

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(30)      =      807.15
Log likelihood  =   -11562.083                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9027317   .1004094    -0.92   0.358     .7259069     1.12263
  1.dmard_pc |   1.038374   .0655182     0.60   0.551     .9175831    1.175065
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .9404959   .1516244    -0.38   0.704     .6856908    1.289987
             |
   agegroup2 |
     60-<70  |   .7760927   .0728184    -2.70   0.007     .6457256      .93278
     70-<80  |   1.181691   .1045345     1.89   0.059     .9935856    1.405409
        80+  |   2.375491   .2203368     9.33   0.000     1.980618    2.849088
             |
      1.male |   1.130137   .0667811     2.07   0.038     1.006544    1.268907
1.oral_pr~ne |    1.74105   .1069614     9.03   0.000      1.54354    1.963834
    1.nsaids |   1.000265   .0828017     0.00   0.997     .8504581    1.176461
1.~c_disease |   1.247378   .0818285     3.37   0.001      1.09688    1.418526
1.resp_exc~a |   1.136591   .0806355     1.80   0.071     .9890441    1.306149
             |
egfr_cat_n~s |
      30-59  |   1.158391   .0835046     2.04   0.041     1.005761    1.334183
        <30  |   2.500888   .3428757     6.69   0.000     1.911583    3.271864
             |
1.~r_disease |   1.025833   .2214118     0.12   0.906     .6719807    1.566018
             |
   obese4cat |
Obese I ..)  |   1.129612   .0789515     1.74   0.081     .9850013    1.295454
Obese II..)  |   1.193198   .1196826     1.76   0.078     .9802429    1.452418
Obese II..)  |   1.382131   .1801923     2.48   0.013     1.070473    1.784525
             |
1.hyperten~n |   1.042924   .0646345     0.68   0.498     .9236338     1.17762
1.cancer_e~r |   1.166193   .0898517     2.00   0.046     1.002739    1.356292
1.neuro_co~s |    1.75672   .1358285     7.29   0.000     1.509692     2.04417
1.flu_vacc~e |    .887155   .0572983    -1.85   0.064     .7816696    1.006875
             |
         imd |
          2  |   1.084914   .0984965     0.90   0.369     .9080649    1.296205
          3  |    1.24608   .1117483     2.45   0.014     1.045226    1.485531
          4  |   1.227062   .1113291     2.26   0.024     1.027161    1.465867
5 most de..  |   1.459982   .1308688     4.22   0.000     1.224752    1.740391
             |
     diabcat |
Controlle..  |   1.271275   .0947702     3.22   0.001     1.098461    1.471276
Uncontrol..  |   1.557725   .1577325     4.38   0.000      1.27732    1.899687
Diabetes,..  |   1.870362   .2903149     4.03   0.000     1.379759    2.535408
             |
smoke_nomiss |
     Former  |   1.160548   .0700382     2.47   0.014     1.031083    1.306269
    Current  |   .5982055   .0681668    -4.51   0.000     .4784694    .7479053
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.14
(Assumption: A nested in B)                           Prob > chi2 =    0.7035

-------------------------------------------------------------------------------
-> oral_prednisolone = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,707        852 |   137,559 
           |     99.38       0.62 |    100.00 
-----------+----------------------+----------
       HCQ |    23,592        114 |    23,706 
           |     99.52       0.48 |    100.00 
-----------+----------------------+----------
     Total |   160,299        966 |   161,265 
           |     99.40       0.60 |    100.00 

-------------------------------------------------------------------------------
-> oral_prednisolone = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,500        352 |    26,852 
           |     98.69       1.31 |    100.00 
-----------+----------------------+----------
       HCQ |     6,836         67 |     6,903 
           |     99.03       0.97 |    100.00 
-----------+----------------------+----------
     Total |    33,336        419 |    33,755 
           |     98.76       1.24 |    100.00 


         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16841.236
Iteration 2:   log likelihood = -16841.213
Iteration 3:   log likelihood = -16841.213
Refining estimates:
Iteration 0:   log likelihood = -16841.213

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(1)       =        8.62
Log likelihood  =   -16841.213                  Prob > chi2      =      0.0033

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7963854   .0634887    -2.86   0.004     .6811843    .9310692
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16774.242
Iteration 2:   log likelihood = -16767.117
Iteration 3:   log likelihood = -16767.102
Iteration 4:   log likelihood = -16767.102
Refining estimates:
Iteration 0:   log likelihood = -16767.102

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(3)       =      156.84
Log likelihood  =   -16767.102                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7660191   .0763935    -2.67   0.008     .6300153    .9313827
1.oral_pr~ne |   2.144133   .1358549    12.04   0.000     1.893732    2.427644
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9486774   .1579254    -0.32   0.752     .6845732    1.314671
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_int_o
> ral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    148.22
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16671.012
Iteration 2:   log likelihood = -16635.455
Iteration 3:   log likelihood = -16635.387
Iteration 4:   log likelihood = -16635.387
Refining estimates:
Iteration 0:   log likelihood = -16635.387

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(5)       =      420.27
Log likelihood  =   -16635.387                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9128252   .0731202    -1.14   0.255     .7801959    1.068001
             |
   agegroup2 |
     60-<70  |   .9055963   .0815622    -1.10   0.271     .7590519    1.080433
     70-<80  |   1.551878   .1180555     5.78   0.000     1.336917    1.801403
        80+  |   3.557709   .2539439    17.78   0.000     3.093235    4.091927
             |
      1.male |   1.192168   .0682039     3.07   0.002     1.065713    1.333628
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16625.256
Iteration 2:   log likelihood = -16580.669
Iteration 3:   log likelihood = -16580.574
Iteration 4:   log likelihood = -16580.574
Refining estimates:
Iteration 0:   log likelihood = -16580.574

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(7)       =      529.90
Log likelihood  =   -16580.574                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8695082   .0869816    -1.40   0.162     .7146994     1.05785
1.oral_pr~ne |   1.914434   .1222151    10.17   0.000     1.689276    2.169602
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |    .987665   .1644606    -0.07   0.941     .7126433    1.368822
             |
   agegroup2 |
     60-<70  |   .8745716   .0788562    -1.49   0.137     .7329027    1.043625
     70-<80  |   1.454919    .111206     4.91   0.000       1.2525    1.690052
        80+  |    3.28744   .2364606    16.55   0.000     2.855171    3.785153
             |
      1.male |   1.195701   .0684216     3.12   0.002     1.068844    1.337614
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    109.63
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11739.772
Iteration 2:   log likelihood = -11698.236
Iteration 3:   log likelihood = -11698.165
Iteration 4:   log likelihood = -11698.165
Refining estimates:
Iteration 0:   log likelihood = -11698.165

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(7)       =      534.98
Log likelihood  =   -11698.165                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .875939   .0713409    -1.63   0.104     .7467027    1.027543
             |
   agegroup2 |
     60-<70  |   .8838642   .0800272    -1.36   0.173     .7401432    1.055493
     70-<80  |   1.492554   .1152119     5.19   0.000     1.282995    1.736342
        80+  |   3.383163   .2464404    16.73   0.000     2.933045    3.902359
             |
      1.male |   1.199954   .0689286     3.17   0.002     1.072184    1.342951
  1.dmard_pc |   .9486219   .0548578    -0.91   0.362     .8469719    1.062471
1.oral_pr~ne |   1.896931   .1124208    10.80   0.000     1.688905    2.130578
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11741.538
Iteration 2:   log likelihood = -11698.251
Iteration 3:   log likelihood = -11698.164
Iteration 4:   log likelihood = -11698.164
Refining estimates:
Iteration 0:   log likelihood = -11698.164

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(8)       =      534.99
Log likelihood  =   -11698.164                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8788263   .0888034    -1.28   0.201     .7209267     1.07131
1.oral_pr~ne |    1.89947   .1216889    10.01   0.000     1.675331    2.153597
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9908843   .1652888    -0.05   0.956     .7145532    1.374078
             |
   agegroup2 |
     60-<70  |   .8838129   .0800279    -1.36   0.173     .7400914    1.055444
     70-<80  |   1.492486   .1152135     5.19   0.000     1.282925    1.736278
        80+  |   3.383001   .2464487    16.73   0.000      2.93287    3.902217
             |
      1.male |   1.200003   .0689372     3.17   0.002     1.072218    1.343018
  1.dmard_pc |   .9485422   .0548733    -0.91   0.361     .8468655    1.062426
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.00
(Assumption: A nested in B)                           Prob > chi2 =    0.9562

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11895.417
Iteration 2:   log likelihood = -11597.611
Iteration 3:   log likelihood = -11564.627
Iteration 4:   log likelihood = -11562.185
Iteration 5:   log likelihood = -11562.155
Iteration 6:   log likelihood = -11562.155
Refining estimates:
Iteration 0:   log likelihood = -11562.155

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(29)      =      807.00
Log likelihood  =   -11562.155                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8768528   .0716344    -1.61   0.108     .7471158    1.029119
             |
   agegroup2 |
     60-<70  |   .7762594   .0728323    -2.70   0.007     .6458671    .9329762
     70-<80  |   1.182244   .1045727     1.89   0.058      .994068    1.406042
        80+  |   2.376068   .2203838     9.33   0.000     1.981111    2.849765
             |
      1.male |   1.129915   .0667631     2.07   0.039     1.006354    1.268646
  1.dmard_pc |   1.029235   .0604613     0.49   0.624     .9173008    1.154829
1.oral_pr~ne |    1.74235   .1069877     9.04   0.000     1.544785    1.965182
    1.nsaids |   1.000691   .0828296     0.01   0.993     .8508326    1.176945
1.~c_disease |   1.247257    .081819     3.37   0.001     1.096775    1.418384
1.resp_exc~a |   1.136535   .0806355     1.80   0.071     .9889886    1.306093
             |
egfr_cat_n~s |
      30-59  |   1.158549    .083514     2.04   0.041     1.005901    1.334361
        <30  |   2.500436   .3428111     6.68   0.000     1.911241    3.271266
             |
1.~r_disease |   1.026002   .2214468     0.12   0.905     .6720928    1.566271
             |
   obese4cat |
Obese I ..)  |   1.129615   .0789515     1.74   0.081     .9850037    1.295457
Obese II..)  |   1.193078   .1196693     1.76   0.078     .9801459    1.452268
Obese II..)  |   1.381801   .1801472     2.48   0.013      1.07022    1.784094
             |
1.hyperten~n |   1.043034   .0646443     0.68   0.497     .9237267    1.177751
1.cancer_e~r |   1.166233   .0898546     2.00   0.046     1.002774    1.356337
1.neuro_co~s |   1.756448   .1358075     7.29   0.000     1.509458    2.043854
1.flu_vacc~e |   .8876387   .0573162    -1.85   0.065      .782119    1.007395
             |
         imd |
          2  |   1.084916   .0984971     0.90   0.369     .9080664    1.296209
          3  |   1.246281   .1117655     2.46   0.014     1.045397    1.485769
          4  |   1.226994   .1113233     2.25   0.024     1.027104    1.465787
5 most de..  |   1.459761    .130849     4.22   0.000     1.224567    1.740128
             |
     diabcat |
Controlle..  |   1.271175   .0947627     3.22   0.001     1.098374     1.47116
Uncontrol..  |    1.55729   .1576893     4.37   0.000     1.276961    1.899158
Diabetes,..  |   1.869757   .2902175     4.03   0.000     1.379318    2.534579
             |
smoke_nomiss |
     Former  |   1.160541   .0700383     2.47   0.014     1.031076    1.306262
    Current  |   .5979777   .0681387    -4.51   0.000     .4782905    .7476154
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11897.125
Iteration 2:   log likelihood = -11597.564
Iteration 3:   log likelihood = -11564.626
Iteration 4:   log likelihood = -11562.185
Iteration 5:   log likelihood = -11562.155
Iteration 6:   log likelihood = -11562.155
Refining estimates:
Iteration 0:   log likelihood = -11562.155

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(30)      =      807.00
Log likelihood  =   -11562.155                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8774427   .0889147    -1.29   0.197      .719388    1.070223
1.oral_pr~ne |   1.742831   .1152763     8.40   0.000     1.530926    1.984067
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9981311   .1665522    -0.01   0.991     .7197019    1.384276
             |
   agegroup2 |
     60-<70  |   .7762526   .0728341    -2.70   0.007     .6458574    .9329739
     70-<80  |   1.182237   .1045739     1.89   0.058     .9940594    1.406038
        80+  |   2.376055   .2203856     9.33   0.000     1.981095    2.849757
             |
      1.male |   1.129927   .0667722     2.07   0.039      1.00635    1.268678
  1.dmard_pc |   1.029217   .0604824     0.49   0.624     .9172458    1.154857
    1.nsaids |   1.000682   .0828334     0.01   0.993     .8508167    1.176944
1.~c_disease |   1.247256    .081819     3.37   0.001     1.096775    1.418384
1.resp_exc~a |   1.136521   .0806442     1.80   0.071     .9889598    1.306099
             |
egfr_cat_n~s |
      30-59  |   1.158555   .0835159     2.04   0.041     1.005904    1.334371
        <30  |   2.500434   .3428108     6.68   0.000      1.91124    3.271264
             |
1.~r_disease |   1.025999   .2214464     0.12   0.905     .6720906    1.566267
             |
   obese4cat |
Obese I ..)  |   1.129611    .078952     1.74   0.081     .9849989    1.295454
Obese II..)  |   1.193073   .1196696     1.76   0.078     .9801407    1.452264
Obese II..)  |   1.381807   .1801488     2.48   0.013     1.070224    1.784104
             |
1.hyperten~n |   1.043034   .0646442     0.68   0.497     .9237268    1.177751
1.cancer_e~r |   1.166234   .0898548     2.00   0.046     1.002775    1.356339
1.neuro_co~s |    1.75645   .1358076     7.29   0.000     1.509459    2.043855
1.flu_vacc~e |   .8876339   .0573174    -1.85   0.065     .7821121    1.007393
             |
         imd |
          2  |   1.084918   .0984974     0.90   0.369     .9080678    1.296211
          3  |   1.246282   .1117656     2.46   0.014     1.045397    1.485769
          4  |   1.226996   .1113237     2.25   0.024     1.027105     1.46579
5 most de..  |   1.459767   .1308504     4.22   0.000      1.22457    1.740137
             |
     diabcat |
Controlle..  |    1.27117   .0947634     3.22   0.001     1.098368    1.471157
Uncontrol..  |   1.557282     .15769     4.37   0.000     1.276953    1.899152
Diabetes,..  |   1.869781   .2902295     4.03   0.000     1.379324    2.534634
             |
smoke_nomiss |
     Former  |   1.160538   .0700386     2.47   0.014     1.031073    1.306259
    Current  |   .5979763   .0681387    -4.51   0.000     .4782892    .7476139
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.00
(Assumption: A nested in B)                           Prob > chi2 =    0.9911

-------------------------------------------------------------------------------
-> nsaids = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,606      1,057 |   137,663 
           |     99.23       0.77 |    100.00 
-----------+----------------------+----------
       HCQ |    23,782        148 |    23,930 
           |     99.38       0.62 |    100.00 
-----------+----------------------+----------
     Total |   160,388      1,205 |   161,593 
           |     99.25       0.75 |    100.00 

-------------------------------------------------------------------------------
-> nsaids = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,601        147 |    26,748 
           |     99.45       0.55 |    100.00 
-----------+----------------------+----------
       HCQ |     6,646         33 |     6,679 
           |     99.51       0.49 |    100.00 
-----------+----------------------+----------
     Total |    33,247        180 |    33,427 
           |     99.46       0.54 |    100.00 


         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16841.236
Iteration 2:   log likelihood = -16841.213
Iteration 3:   log likelihood = -16841.213
Refining estimates:
Iteration 0:   log likelihood = -16841.213

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(1)       =        8.62
Log likelihood  =   -16841.213                  Prob > chi2      =      0.0033

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7963854   .0634887    -2.86   0.004     .6811843    .9310692
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood =  -16832.66
Iteration 2:   log likelihood = -16832.562
Iteration 3:   log likelihood = -16832.562
Refining estimates:
Iteration 0:   log likelihood = -16832.562

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(3)       =       25.92
Log likelihood  =   -16832.562                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7948212   .0697582    -2.62   0.009     .6692109    .9440084
    1.nsaids |   .7147528   .0629177    -3.81   0.000     .6014879    .8493462
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.113961   .2358037     0.51   0.610     .7356772    1.686758
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_int_n
> saids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     17.30
(Assumption: A nested in B)                           Prob > chi2 =    0.0002

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16671.012
Iteration 2:   log likelihood = -16635.455
Iteration 3:   log likelihood = -16635.387
Iteration 4:   log likelihood = -16635.387
Refining estimates:
Iteration 0:   log likelihood = -16635.387

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(5)       =      420.27
Log likelihood  =   -16635.387                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9128252   .0731202    -1.14   0.255     .7801959    1.068001
             |
   agegroup2 |
     60-<70  |   .9055963   .0815622    -1.10   0.271     .7590519    1.080433
     70-<80  |   1.551878   .1180555     5.78   0.000     1.336917    1.801403
        80+  |   3.557709   .2539439    17.78   0.000     3.093235    4.091927
             |
      1.male |   1.192168   .0682039     3.07   0.002     1.065713    1.333628
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16670.478
Iteration 2:   log likelihood = -16634.934
Iteration 3:   log likelihood = -16634.866
Iteration 4:   log likelihood = -16634.866
Refining estimates:
Iteration 0:   log likelihood = -16634.866

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(7)       =      421.32
Log likelihood  =   -16634.866                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9056324    .079765    -1.13   0.260     .7620458    1.076274
    1.nsaids |   .9143565   .0816327    -1.00   0.316     .7675758    1.089206
             |
    exposure#|
      nsaids |
      HCQ#1  |    1.06546   .2255875     0.30   0.765     .7035814    1.613468
             |
   agegroup2 |
     60-<70  |   .9049666   .0815213    -1.11   0.268     .7584981    1.079719
     70-<80  |   1.542557   .1177749     5.68   0.000     1.328164    1.791558
        80+  |   3.515756   .2544556    17.37   0.000      3.05079    4.051586
             |
      1.male |   1.191779   .0681839     3.07   0.002     1.065361    1.333197
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      1.04
(Assumption: A nested in B)                           Prob > chi2 =    0.5938

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11739.772
Iteration 2:   log likelihood = -11698.236
Iteration 3:   log likelihood = -11698.165
Iteration 4:   log likelihood = -11698.165
Refining estimates:
Iteration 0:   log likelihood = -11698.165

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(7)       =      534.98
Log likelihood  =   -11698.165                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .875939   .0713409    -1.63   0.104     .7467027    1.027543
             |
   agegroup2 |
     60-<70  |   .8838642   .0800272    -1.36   0.173     .7401432    1.055493
     70-<80  |   1.492554   .1152119     5.19   0.000     1.282995    1.736342
        80+  |   3.383163   .2464404    16.73   0.000     2.933045    3.902359
             |
      1.male |   1.199954   .0689286     3.17   0.002     1.072184    1.342951
  1.dmard_pc |   .9486219   .0548578    -0.91   0.362     .8469719    1.062471
1.oral_pr~ne |   1.896931   .1124208    10.80   0.000     1.688905    2.130578
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11739.339
Iteration 2:   log likelihood =  -11697.78
Iteration 3:   log likelihood = -11697.709
Iteration 4:   log likelihood = -11697.709
Refining estimates:
Iteration 0:   log likelihood = -11697.709

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(9)       =      535.90
Log likelihood  =   -11697.709                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8670809   .0774886    -1.60   0.111     .7277633    1.033069
    1.nsaids |   .9185107   .0825903    -0.95   0.344     .7700984    1.095525
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.076466   .2279826     0.35   0.728     .7107653    1.630327
             |
   agegroup2 |
     60-<70  |   .8822826   .0799233    -1.38   0.167     .7387542    1.053696
     70-<80  |   1.482048    .115065     5.07   0.000     1.272846    1.725635
        80+  |   3.341336   .2477149    16.27   0.000     2.889449    3.863894
             |
      1.male |   1.199283   .0688962     3.16   0.002     1.071574    1.342213
  1.dmard_pc |   .9513505   .0550951    -0.86   0.389      .849269    1.065702
1.oral_pr~ne |   1.898609   .1125499    10.82   0.000     1.690348    2.132529
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      0.91
(Assumption: A nested in B)                           Prob > chi2 =    0.6335

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11895.417
Iteration 2:   log likelihood = -11597.611
Iteration 3:   log likelihood = -11564.627
Iteration 4:   log likelihood = -11562.185
Iteration 5:   log likelihood = -11562.155
Iteration 6:   log likelihood = -11562.155
Refining estimates:
Iteration 0:   log likelihood = -11562.155

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(29)      =      807.00
Log likelihood  =   -11562.155                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8768528   .0716344    -1.61   0.108     .7471158    1.029119
             |
   agegroup2 |
     60-<70  |   .7762594   .0728323    -2.70   0.007     .6458671    .9329762
     70-<80  |   1.182244   .1045727     1.89   0.058      .994068    1.406042
        80+  |   2.376068   .2203838     9.33   0.000     1.981111    2.849765
             |
      1.male |   1.129915   .0667631     2.07   0.039     1.006354    1.268646
  1.dmard_pc |   1.029235   .0604613     0.49   0.624     .9173008    1.154829
1.oral_pr~ne |    1.74235   .1069877     9.04   0.000     1.544785    1.965182
    1.nsaids |   1.000691   .0828296     0.01   0.993     .8508326    1.176945
1.~c_disease |   1.247257    .081819     3.37   0.001     1.096775    1.418384
1.resp_exc~a |   1.136535   .0806355     1.80   0.071     .9889886    1.306093
             |
egfr_cat_n~s |
      30-59  |   1.158549    .083514     2.04   0.041     1.005901    1.334361
        <30  |   2.500436   .3428111     6.68   0.000     1.911241    3.271266
             |
1.~r_disease |   1.026002   .2214468     0.12   0.905     .6720928    1.566271
             |
   obese4cat |
Obese I ..)  |   1.129615   .0789515     1.74   0.081     .9850037    1.295457
Obese II..)  |   1.193078   .1196693     1.76   0.078     .9801459    1.452268
Obese II..)  |   1.381801   .1801472     2.48   0.013      1.07022    1.784094
             |
1.hyperten~n |   1.043034   .0646443     0.68   0.497     .9237267    1.177751
1.cancer_e~r |   1.166233   .0898546     2.00   0.046     1.002774    1.356337
1.neuro_co~s |   1.756448   .1358075     7.29   0.000     1.509458    2.043854
1.flu_vacc~e |   .8876387   .0573162    -1.85   0.065      .782119    1.007395
             |
         imd |
          2  |   1.084916   .0984971     0.90   0.369     .9080664    1.296209
          3  |   1.246281   .1117655     2.46   0.014     1.045397    1.485769
          4  |   1.226994   .1113233     2.25   0.024     1.027104    1.465787
5 most de..  |   1.459761    .130849     4.22   0.000     1.224567    1.740128
             |
     diabcat |
Controlle..  |   1.271175   .0947627     3.22   0.001     1.098374     1.47116
Uncontrol..  |    1.55729   .1576893     4.37   0.000     1.276961    1.899158
Diabetes,..  |   1.869757   .2902175     4.03   0.000     1.379318    2.534579
             |
smoke_nomiss |
     Former  |   1.160541   .0700383     2.47   0.014     1.031076    1.306262
    Current  |   .5979777   .0681387    -4.51   0.000     .4782905    .7476154
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11965.657
Iteration 1:   log likelihood = -11895.427
Iteration 2:   log likelihood = -11597.576
Iteration 3:   log likelihood = -11564.591
Iteration 4:   log likelihood =  -11562.15
Iteration 5:   log likelihood = -11562.121
Iteration 6:   log likelihood = -11562.121
Refining estimates:
Iteration 0:   log likelihood = -11562.121

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(30)      =      807.07
Log likelihood  =   -11562.121                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .868519    .077789    -1.57   0.116     .7286875    1.035183
    1.nsaids |   .9911269   .0898294    -0.10   0.922      .829816    1.183796
             |
    exposure#|
      nsaids |
      HCQ#1  |    1.05765   .2240289     0.26   0.791     .6983003    1.601922
             |
   agegroup2 |
     60-<70  |   .7764824   .0728588    -2.70   0.007     .6460436    .9332573
     70-<80  |   1.182417    .104594     1.89   0.058     .9942029    1.406261
        80+  |   2.375817   .2203772     9.33   0.000     1.980873    2.849503
             |
      1.male |   1.130005   .0667695     2.07   0.039     1.006432     1.26875
  1.dmard_pc |   1.029379   .0604741     0.49   0.622     .9174214       1.155
1.oral_pr~ne |    1.74268   .1070151     9.04   0.000     1.545065     1.96557
1.~c_disease |   1.247213   .0818155     3.37   0.001     1.096738    1.418333
1.resp_exc~a |   1.136528   .0806344     1.80   0.071     .9889835    1.306084
             |
egfr_cat_n~s |
      30-59  |   1.158543   .0835134     2.04   0.041     1.005897    1.334354
        <30  |   2.499909   .3427433     6.68   0.000     1.910832    3.270589
             |
1.~r_disease |   1.026043   .2214562     0.12   0.905     .6721195    1.566336
             |
   obese4cat |
Obese I ..)  |   1.129589    .078949     1.74   0.081     .9849827    1.295426
Obese II..)  |   1.193108   .1196722     1.76   0.078     .9801706    1.452305
Obese II..)  |   1.381652   .1801284     2.48   0.013     1.070104    1.783903
             |
1.hyperten~n |   1.043067   .0646483     0.68   0.496     .9237525    1.177793
1.cancer_e~r |   1.166133   .0898472     1.99   0.046     1.002687    1.356222
1.neuro_co~s |   1.756352   .1358017     7.28   0.000     1.509372    2.043745
1.flu_vacc~e |   .8877202   .0573215    -1.84   0.065     .7821907    1.007487
             |
         imd |
          2  |    1.08494   .0984993     0.90   0.369     .9080858    1.296237
          3  |   1.246384   .1117751     2.46   0.014     1.045482    1.485892
          4  |   1.226966   .1113205     2.25   0.024      1.02708    1.465752
5 most de..  |    1.45971   .1308436     4.22   0.000     1.224525    1.740065
             |
     diabcat |
Controlle..  |   1.271077    .094757     3.22   0.001     1.098287    1.471051
Uncontrol..  |   1.557348   .1576957     4.37   0.000     1.277008     1.89923
Diabetes,..  |    1.86971   .2902094     4.03   0.000     1.379285    2.534514
             |
smoke_nomiss |
     Former  |   1.160545   .0700382     2.47   0.014      1.03108    1.306266
    Current  |    .597943   .0681348    -4.51   0.000     .4782628    .7475719
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.07
(Assumption: A nested in B)                           Prob > chi2 =    0.7921

. 
. 
. 
. 
. 
. 
. /* Print interaction table===================================================
> =*/ 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table3.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 3: Interactions with HCQ use on risk of $tabl
> eoutcome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab _tab ("Age/
> Sex Adjusted") _tab _tab _tab  ///
>                                                 ("DAG Adjusted") _tab _tab _t
> ab ("Fully Adjusted") _tab _tab _tab _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("p (interactio
> n)") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("p (interact
> ion)") _tab ("HR") _tab ("95% CI") _tab ("p (interaction)") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab (
> "p (interaction)") _tab _n

. 
.                                                 
. * Generic program to print model for a level of another variable 
. cap prog drop printinteraction

. prog define printinteraction 
  1. syntax, variable(varname) min(real) max(real) 
  2. 
. * Overall p-values 
. 
. file write tablecontent ("`variable'") _tab _tab _tab _tab ("${univar_p_`vari
> able'}") ///
>                                                 _tab _tab _tab ("${multivar1_
> p_`variable'}") /// 
>                                                 _tab _tab _tab ("${multivar2_
> p_`variable'}") ///
>                                                 _tab _tab _tab ("${multivar3_
> p_`variable'}") _n
  3.         forvalues varlevel = `min'/`max'{ 
  4. 
.                 * Row headings 
.                                                         
.                 file write tablecontent ("`varlevel'") _n       
  5. 
.                 local lab0: label exposure 0
  6.                 local lab1: label exposure 1
  7.                  
.                 /* Counts */
.                         
.                 * First row, exposure = 0 (reference)
.                 
.         file write tablecontent ("`lab0'") _tab
  8. 
.                         cou if exposure == 0 & `variable' == `varlevel'
  9.                         local rowdenom = r(N)
 10.                         cou if exposure == 0  & `variable' == `varlevel' &
>  $outcome == 1
 11.                         local pct = 100*(r(N)/`rowdenom')
 12.                         
.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 13.                 file write tablecontent ("1.00 (ref)") _tab _tab _tab ("1.
> 00 (ref)") _tab _tab _tab ("1.00 (ref)") _tab _tab _tab ("1.00 (ref)") _n
 14.                         
.                 * Second row, exposure = 1 (comparator)
. 
.                 file write tablecontent ("`lab1'") _tab  
 15. 
.                         cou if exposure == 1 & `variable' == `varlevel'
 16.                         local rowdenom = r(N)
 17.                         cou if exposure == 1 & `variable' == `varlevel' & 
> $outcome == 1
 18.                         local pct = 100*(r(N)/`rowdenom')
 19.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 20. 
.                 * Print models 
.                 estimates use $Tempdir/univar_int_`variable' 
 21.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 22.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 23. 
.                 estimates use $Tempdir/multivar1_int_`variable'
 24.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 25.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 26. 
.                 estimates use $Tempdir/multivar2_int_`variable'
 27.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 28.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab 
 29.         
.                 estimates use $Tempdir/multivar3_int_`variable'
 30.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 31.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _n
 32.         } 
 33.                 
. end

. 
. printinteraction, variable(agegroup2) min(3) max(6) 
  57,833
  268
  12,528
  62
  37,825
  162
  7,983
  35
  42,177
  316
  7,155
  49
  26,576
  458
  2,943
  35

. file write tablecontent _n _n

. 
. printinteraction, variable(dmard_pc) min(0) max(1) 
  108,512
  796
  14,844
  93
  55,899
  408
  15,765
  88

. file write tablecontent _n _n

.   
. printinteraction, variable(oral_prednisolone) min(0) max(1) 
  137,559
  852
  23,706
  114
  26,852
  352
  6,903
  67

. file write tablecontent _n _n

. 
. printinteraction, variable(nsaids) min(0) max(1) 
  137,663
  1,057
  23,930
  148
  26,748
  147
  6,679
  33

. 
. 
. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\07_an_mod
> els_interact.log
  log type:  text
 closed on:  17 Aug 2020, 10:26:03
-------------------------------------------------------------------------------
