-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\07_an_mod
> els_interact.log
  log type:  text
 opened on:  19 Jul 2020, 18:31:50

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* So few deaths occuring below 60 years this cannot be used as a category, s
> o combining 18-59 */ 
. gen agegroup2 = agegroup

. recode agegroup2(1 = 2)
(agegroup2: 13683 changes made)

. recode agegroup2(2 = 3)
(agegroup2: 33089 changes made)

. tab agegroup2, nolabel 

  agegroup2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     70,113       36.10       36.10
          4 |     45,617       23.49       59.58
          5 |     49,101       25.28       84.86
          6 |     29,405       15.14      100.00
------------+-----------------------------------
      Total |    194,236      100.00

. 
. label define agegroup2  3 "18-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup2 agegroup2

. tab agegroup agegroup2 , m

   Grouped |                  agegroup2
       age |    18-<60     60-<70     70-<80        80+ |     Total
-----------+--------------------------------------------+----------
    18-<40 |    13,683          0          0          0 |    13,683 
    40-<50 |    19,406          0          0          0 |    19,406 
    50-<60 |    37,024          0          0          0 |    37,024 
    60-<70 |         0     45,617          0          0 |    45,617 
    70-<80 |         0          0     49,101          0 |    49,101 
       80+ |         0          0          0     29,405 |    29,405 
-----------+--------------------------------------------+----------
     Total |    70,113     45,617     49,101     29,405 |   194,236 

. 
. 
. foreach intvar of varlist agegroup2 dmard_pc oral_prednisolone nsaids {
  2. /* Check Counts */ 
. 
. bysort `intvar': tab exposure $outcome, row
  3. 
. /* Univariable model */ 
. stcox i.exposure
  4. estimates store A
  5. 
. stcox i.exposure##i.`intvar'
  6. estimates store B
  7. estimates save $Tempdir/univar_int_`intvar', replace 
  8. 
. lrtest A B
  9. global univar_p_`intvar' = round(r(p),0.001)
 10. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. stcox i.exposure i.agegroup2 i.male
 11. estimates store A
 12. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male
 13. estimates store B
 14. estimates save $Tempdir/multivar1_int_`intvar', replace 
 15. 
. lrtest A B
 16. global multivar1_p_`intvar' = round(r(p),0.001)
 17. 
. * DAG Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone, strata(st
> p population)                                      
 18.                                                                           
>       
. estimates store A
 19. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e, strata(stp population)                  
 20. estimates store B
 21. estimates save $Tempdir/multivar2_int_`intvar', replace 
 22. 
. lrtest A B
 23. global multivar2_p_`intvar' = round(r(p),0.001)
 24. 
. * Fully Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone i.nsaids i
> .chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_liver
> _disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu_va
> ccine, strata(stp population)
 25. estimates store A
 26. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.c
> hronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditi
> ons i.flu_vaccine, strata(stp population)
 27. estimates store B
 28. estimates save $Tempdir/multivar3_int_`intvar', replace 
 29. 
. lrtest A B
 30. global multivar3_p_`intvar' = round(r(p),0.001)
 31. 
. }

-------------------------------------------------------------------------------
-> agegroup2 = 18-<60

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    57,371        250 |    57,621 
           |     99.57       0.43 |    100.00 
-----------+----------------------+----------
       HCQ |    12,434         58 |    12,492 
           |     99.54       0.46 |    100.00 
-----------+----------------------+----------
     Total |    69,805        308 |    70,113 
           |     99.56       0.44 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 60-<70

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    37,500        155 |    37,655 
           |     99.59       0.41 |    100.00 
-----------+----------------------+----------
       HCQ |     7,928         34 |     7,962 
           |     99.57       0.43 |    100.00 
-----------+----------------------+----------
     Total |    45,428        189 |    45,617 
           |     99.59       0.41 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 70-<80

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    41,670        306 |    41,976 
           |     99.27       0.73 |    100.00 
-----------+----------------------+----------
       HCQ |     7,078         47 |     7,125 
           |     99.34       0.66 |    100.00 
-----------+----------------------+----------
     Total |    48,748        353 |    49,101 
           |     99.28       0.72 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 80+

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,030        453 |    26,483 
           |     98.29       1.71 |    100.00 
-----------+----------------------+----------
       HCQ |     2,887         35 |     2,922 
           |     98.80       1.20 |    100.00 
-----------+----------------------+----------
     Total |    28,917        488 |    29,405 
           |     98.34       1.66 |    100.00 


         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16265.024
Iteration 2:   log likelihood = -16264.999
Iteration 3:   log likelihood = -16264.999
Refining estimates:
Iteration 0:   log likelihood = -16264.999

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(1)       =        8.74
Log likelihood  =   -16264.999                  Prob > chi2      =      0.0031

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7917429   .0643519    -2.87   0.004     .6751489    .9284721
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16098.438
Iteration 2:   log likelihood =  -16053.63
Iteration 3:   log likelihood = -16053.505
Iteration 4:   log likelihood = -16053.505
Refining estimates:
Iteration 0:   log likelihood = -16053.505

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(7)       =      431.73
Log likelihood  =   -16053.505                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.050395   .1530891     0.34   0.736     .7893962    1.397689
             |
   agegroup2 |
     60-<70  |   .9424175   .0963463    -0.58   0.562     .7712983    1.151501
     70-<80  |   1.670818   .1424413     6.02   0.000     1.413716    1.974677
        80+  |   3.974018    .313105    17.51   0.000     3.405378    4.637611
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .9771749   .2335116    -0.10   0.923      .611736     1.56092
 HCQ#70-<80  |   .8550694   .1829648    -0.73   0.464     .5621655    1.300584
    HCQ#80+  |    .661797   .1509424    -1.81   0.070     .4232364    1.034824
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_int_a
> gegroup2.ster saved

Likelihood-ratio test                                 LR chi2(6)  =    422.99
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16089.702
Iteration 2:   log likelihood = -16050.656
Iteration 3:   log likelihood =  -16050.58
Iteration 4:   log likelihood =  -16050.58
Refining estimates:
Iteration 0:   log likelihood =  -16050.58

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(5)       =      437.58
Log likelihood  =    -16050.58                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9137599   .0746294    -1.10   0.269     .7785957    1.072389
             |
   agegroup2 |
     60-<70  |     .93121   .0860713    -0.77   0.441     .7769114    1.116153
     70-<80  |   1.608882   .1256303     6.09   0.000     1.380567    1.874954
        80+  |   3.769754   .2753183    18.17   0.000     3.266982      4.3499
             |
      1.male |    1.20118   .0698131     3.15   0.002     1.071854    1.346109
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16093.397
Iteration 2:   log likelihood = -16048.578
Iteration 3:   log likelihood = -16048.454
Iteration 4:   log likelihood = -16048.454
Refining estimates:
Iteration 0:   log likelihood = -16048.454

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(8)       =      441.83
Log likelihood  =   -16048.454                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.074118    .156742     0.49   0.624     .8069364    1.429765
             |
   agegroup2 |
     60-<70  |   .9378591   .0958914    -0.63   0.530     .7675496    1.145958
     70-<80  |   1.657879   .1413989     5.93   0.000     1.402668    1.959526
        80+  |   3.966032   .3124864    17.49   0.000     3.398517    4.628316
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .9633327    .230248    -0.16   0.876     .6030162    1.538947
 HCQ#70-<80  |   .8399648   .1797996    -0.81   0.415     .5521488    1.277809
    HCQ#80+  |    .646819   .1476052    -1.91   0.056     .4135586    1.011646
             |
      1.male |   1.205531    .070128     3.21   0.001     1.075629    1.351122
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      4.25
(Assumption: A nested in B)                           Prob > chi2 =    0.2356

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11320.264
Iteration 2:   log likelihood = -11274.657
Iteration 3:   log likelihood = -11274.579
Iteration 4:   log likelihood = -11274.579
Refining estimates:
Iteration 0:   log likelihood = -11274.579

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(7)       =      557.09
Log likelihood  =   -11274.579                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8797582   .0730579    -1.54   0.123      .747613    1.035261
             |
   agegroup2 |
     60-<70  |   .9083474   .0844031    -1.03   0.301     .7571097    1.089796
     70-<80  |   1.544586   .1223892     5.49   0.000     1.322406    1.804094
        80+  |   3.572607   .2663437    17.08   0.000      3.08693    4.134697
             |
      1.male |   1.209424   .0705814     3.26   0.001     1.078706    1.355983
  1.dmard_pc |   .9425391   .0555095    -1.00   0.315     .8397868    1.057864
1.oral_pr~ne |   1.942425   .1164657    11.07   0.000     1.727059    2.184647
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11323.296
Iteration 2:   log likelihood = -11272.547
Iteration 3:   log likelihood = -11272.422
Iteration 4:   log likelihood = -11272.422
Refining estimates:
Iteration 0:   log likelihood = -11272.422

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(10)      =      561.40
Log likelihood  =   -11272.422                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.029988   .1524214     0.20   0.842     .7706695    1.376563
             |
   agegroup2 |
     60-<70  |   .9119566   .0936172    -0.90   0.369     .7457509    1.115205
     70-<80  |   1.588954    .137118     5.37   0.000     1.341706    1.881765
        80+  |   3.753517   .3004829    16.52   0.000      3.20846     4.39117
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .9798886    .234588    -0.08   0.932       .61291    1.566595
 HCQ#70-<80  |   .8465011   .1817242    -0.78   0.438      .555769     1.28932
    HCQ#80+  |   .6477151   .1482742    -1.90   0.058     .4135499    1.014472
             |
      1.male |   1.213577   .0708802     3.31   0.001     1.082311    1.360764
  1.dmard_pc |   .9394425   .0553705    -1.06   0.289     .8369521    1.054484
1.oral_pr~ne |   1.940917   .1163549    11.06   0.000     1.725754    2.182907
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      4.31
(Assumption: A nested in B)                           Prob > chi2 =    0.2296

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11524.843
Iteration 2:   log likelihood = -11225.193
Iteration 3:   log likelihood = -11192.054
Iteration 4:   log likelihood = -11189.512
Iteration 5:   log likelihood = -11189.479
Iteration 6:   log likelihood = -11189.479
Refining estimates:
Iteration 0:   log likelihood = -11189.479

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(20)      =      727.28
Log likelihood  =   -11189.479                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8802841   .0732804    -1.53   0.126     .7477621    1.036292
             |
   agegroup2 |
     60-<70  |   .8230506   .0790653    -2.03   0.043     .6817999    .9935647
     70-<80  |   1.287779   .1157449     2.81   0.005     1.079782    1.535844
        80+  |   2.668573   .2498866    10.48   0.000      2.22112    3.206166
             |
      1.male |   1.163538   .0688778     2.56   0.011     1.036077    1.306679
  1.dmard_pc |   1.006966   .0601367     0.12   0.907      .895737    1.132007
1.oral_pr~ne |    1.80058   .1118074     9.47   0.000     1.594252    2.033611
    1.nsaids |   .9818366   .0831747    -0.22   0.829     .8316317    1.159171
1.~c_disease |   1.320059    .087262     4.20   0.000     1.159644    1.502663
1.resp_exc~a |    1.13641   .0805702     1.80   0.071     .9889761    1.305823
             |
egfr_cat_n~s |
      30-59  |   1.170402   .0859061     2.14   0.032      1.01358    1.351489
        <30  |    2.64855   .3694008     6.98   0.000     2.015063    3.481189
             |
1.~r_disease |    1.11325     .24011     0.50   0.619     .7294613     1.69896
             |
   obese4cat |
Obese I ..)  |   1.200328   .0851179     2.57   0.010     1.044574    1.379305
Obese II..)  |   1.336186    .134685     2.88   0.004     1.096649    1.628045
Obese II..)  |   1.577813   .2099991     3.43   0.001     1.215527    2.048076
             |
1.hyperten~n |   1.102506   .0688582     1.56   0.118     .9754792    1.246073
1.cancer_e~r |   1.152992   .0903197     1.82   0.069     .9888887    1.344328
1.neuro_co~s |   1.811294   .1412052     7.62   0.000     1.554643    2.110314
1.flu_vacc~e |   .9080637   .0595108    -1.47   0.141     .7986049    1.032525
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11529.382
Iteration 2:   log likelihood = -11223.491
Iteration 3:   log likelihood = -11190.224
Iteration 4:   log likelihood = -11187.678
Iteration 5:   log likelihood = -11187.644
Iteration 6:   log likelihood = -11187.644
Refining estimates:
Iteration 0:   log likelihood = -11187.644

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(23)      =      730.95
Log likelihood  =   -11187.644                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.011802   .1500623     0.08   0.937     .7565753    1.353128
             |
   agegroup2 |
     60-<70  |   .8252311   .0871744    -1.82   0.069        .6709    1.015064
     70-<80  |   1.321664   .1274741     2.89   0.004     1.094014    1.596685
        80+  |   2.794396   .2747624    10.45   0.000     2.304584    3.388312
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .9932396   .2378487    -0.03   0.977      .621182    1.588142
 HCQ#70-<80  |   .8659112   .1860203    -0.67   0.503     .5683464     1.31927
    HCQ#80+  |   .6720341   .1539694    -1.73   0.083     .4289167    1.052955
             |
      1.male |   1.167237   .0691473     2.61   0.009     1.039283    1.310945
  1.dmard_pc |   1.004413   .0600196     0.07   0.941     .8934037    1.129215
1.oral_pr~ne |   1.800165   .1117674     9.47   0.000     1.593909    2.033111
    1.nsaids |   .9787676    .082962    -0.25   0.800     .8289538    1.155657
1.~c_disease |   1.319554   .0872173     4.20   0.000     1.159221    1.502063
1.resp_exc~a |   1.138059   .0806861     1.82   0.068      .990413    1.307716
             |
egfr_cat_n~s |
      30-59  |   1.171181   .0859478     2.15   0.031     1.014281    1.352353
        <30  |   2.642663   .3686163     6.97   0.000      2.01053    3.473546
             |
1.~r_disease |   1.111809   .2397998     0.49   0.623     .7285162    1.696762
             |
   obese4cat |
Obese I ..)  |   1.199753   .0850738     2.57   0.010      1.04408    1.378637
Obese II..)  |   1.336262   .1347055     2.88   0.004      1.09669    1.628168
Obese II..)  |    1.57545   .2097112     3.41   0.001     1.213667    2.045077
             |
1.hyperten~n |   1.101778   .0688102     1.55   0.121       .97484    1.245245
1.cancer_e~r |   1.152754   .0903013     1.81   0.070     .9886845    1.344051
1.neuro_co~s |   1.807125   .1408988     7.59   0.000     1.551034    2.105499
1.flu_vacc~e |   .9048818   .0592747    -1.53   0.127     .7958542    1.028845
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      3.67
(Assumption: A nested in B)                           Prob > chi2 =    0.2994

-------------------------------------------------------------------------------
-> dmard_pc = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   107,327        770 |   108,097 
           |     99.29       0.71 |    100.00 
-----------+----------------------+----------
       HCQ |    14,706         91 |    14,797 
           |     99.39       0.61 |    100.00 
-----------+----------------------+----------
     Total |   122,033        861 |   122,894 
           |     99.30       0.70 |    100.00 

-------------------------------------------------------------------------------
-> dmard_pc = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    55,244        394 |    55,638 
           |     99.29       0.71 |    100.00 
-----------+----------------------+----------
       HCQ |    15,621         83 |    15,704 
           |     99.47       0.53 |    100.00 
-----------+----------------------+----------
     Total |    70,865        477 |    71,342 
           |     99.33       0.67 |    100.00 


         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16265.024
Iteration 2:   log likelihood = -16264.999
Iteration 3:   log likelihood = -16264.999
Refining estimates:
Iteration 0:   log likelihood = -16264.999

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(1)       =        8.74
Log likelihood  =   -16264.999                  Prob > chi2      =      0.0031

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7917429   .0643519    -2.87   0.004     .6751489    .9284721
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16264.518
Iteration 2:   log likelihood = -16264.471
Iteration 3:   log likelihood = -16264.471
Refining estimates:
Iteration 0:   log likelihood = -16264.471

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(3)       =        9.80
Log likelihood  =   -16264.471                  Prob > chi2      =      0.0204

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8511096   .0943455    -1.45   0.146     .6849042    1.057648
  1.dmard_pc |    .988789   .0612473    -0.18   0.856     .8757472    1.116422
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .8674754   .1422077    -0.87   0.386     .6290965    1.196181
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_int_d
> mard_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      1.06
(Assumption: A nested in B)                           Prob > chi2 =    0.5896

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16089.702
Iteration 2:   log likelihood = -16050.656
Iteration 3:   log likelihood =  -16050.58
Iteration 4:   log likelihood =  -16050.58
Refining estimates:
Iteration 0:   log likelihood =  -16050.58

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(5)       =      437.58
Log likelihood  =    -16050.58                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9137599   .0746294    -1.10   0.269     .7785957    1.072389
             |
   agegroup2 |
     60-<70  |     .93121   .0860713    -0.77   0.441     .7769114    1.116153
     70-<80  |   1.608882   .1256303     6.09   0.000     1.380567    1.874954
        80+  |   3.769754   .2753183    18.17   0.000     3.266982      4.3499
             |
      1.male |    1.20118   .0698131     3.15   0.002     1.071854    1.346109
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16089.056
Iteration 2:   log likelihood = -16050.014
Iteration 3:   log likelihood = -16049.937
Iteration 4:   log likelihood = -16049.937
Refining estimates:
Iteration 0:   log likelihood = -16049.937

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(7)       =      438.86
Log likelihood  =   -16049.937                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9727712   .1081203    -0.25   0.804     .7823525    1.209536
  1.dmard_pc |   .9659344   .0600862    -0.56   0.577     .8550636    1.091181
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .8911399   .1461413    -0.70   0.482     .6461811    1.228959
             |
   agegroup2 |
     60-<70  |    .935217   .0865895    -0.72   0.469     .7800128    1.121303
     70-<80  |   1.616048   .1266216     6.13   0.000     1.385991    1.884292
        80+  |   3.776348   .2760302    18.18   0.000     3.272306     4.35803
             |
      1.male |   1.204496   .0700753     3.20   0.001     1.074692    1.349978
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      1.28
(Assumption: A nested in B)                           Prob > chi2 =    0.5261

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11320.264
Iteration 2:   log likelihood = -11274.657
Iteration 3:   log likelihood = -11274.579
Iteration 4:   log likelihood = -11274.579
Refining estimates:
Iteration 0:   log likelihood = -11274.579

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(7)       =      557.09
Log likelihood  =   -11274.579                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8797582   .0730579    -1.54   0.123      .747613    1.035261
             |
   agegroup2 |
     60-<70  |   .9083474   .0844031    -1.03   0.301     .7571097    1.089796
     70-<80  |   1.544586   .1223892     5.49   0.000     1.322406    1.804094
        80+  |   3.572607   .2663437    17.08   0.000      3.08693    4.134697
             |
      1.male |   1.209424   .0705814     3.26   0.001     1.078706    1.355983
  1.dmard_pc |   .9425391   .0555095    -1.00   0.315     .8397868    1.057864
1.oral_pr~ne |   1.942425   .1164657    11.07   0.000     1.727059    2.184647
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11320.155
Iteration 2:   log likelihood = -11274.543
Iteration 3:   log likelihood = -11274.465
Iteration 4:   log likelihood = -11274.465
Refining estimates:
Iteration 0:   log likelihood = -11274.465

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(8)       =      557.31
Log likelihood  =   -11274.465                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .912569    .102436    -0.82   0.415     .7323493    1.137138
  1.dmard_pc |   .9530677   .0602661    -0.76   0.447     .8419748    1.078819
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .9245964   .1519715    -0.48   0.633     .6699529    1.276028
             |
   agegroup2 |
     60-<70  |   .9079553   .0843713    -1.04   0.299     .7567755    1.089336
     70-<80  |    1.54327   .1223185     5.47   0.000     1.321224    1.802634
        80+  |   3.570354    .266219    17.07   0.000      3.08491    4.132188
             |
      1.male |   1.209789   .0706094     3.26   0.001     1.079019    1.356407
1.oral_pr~ne |   1.940674   .1164226    11.05   0.000     1.725394    2.182814
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.23
(Assumption: A nested in B)                           Prob > chi2 =    0.6333

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11524.843
Iteration 2:   log likelihood = -11225.193
Iteration 3:   log likelihood = -11192.054
Iteration 4:   log likelihood = -11189.512
Iteration 5:   log likelihood = -11189.479
Iteration 6:   log likelihood = -11189.479
Refining estimates:
Iteration 0:   log likelihood = -11189.479

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(20)      =      727.28
Log likelihood  =   -11189.479                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8802841   .0732804    -1.53   0.126     .7477621    1.036292
             |
   agegroup2 |
     60-<70  |   .8230506   .0790653    -2.03   0.043     .6817999    .9935647
     70-<80  |   1.287779   .1157449     2.81   0.005     1.079782    1.535844
        80+  |   2.668573   .2498866    10.48   0.000      2.22112    3.206166
             |
      1.male |   1.163538   .0688778     2.56   0.011     1.036077    1.306679
  1.dmard_pc |   1.006966   .0601367     0.12   0.907      .895737    1.132007
1.oral_pr~ne |    1.80058   .1118074     9.47   0.000     1.594252    2.033611
    1.nsaids |   .9818366   .0831747    -0.22   0.829     .8316317    1.159171
1.~c_disease |   1.320059    .087262     4.20   0.000     1.159644    1.502663
1.resp_exc~a |    1.13641   .0805702     1.80   0.071     .9889761    1.305823
             |
egfr_cat_n~s |
      30-59  |   1.170402   .0859061     2.14   0.032      1.01358    1.351489
        <30  |    2.64855   .3694008     6.98   0.000     2.015063    3.481189
             |
1.~r_disease |    1.11325     .24011     0.50   0.619     .7294613     1.69896
             |
   obese4cat |
Obese I ..)  |   1.200328   .0851179     2.57   0.010     1.044574    1.379305
Obese II..)  |   1.336186    .134685     2.88   0.004     1.096649    1.628045
Obese II..)  |   1.577813   .2099991     3.43   0.001     1.215527    2.048076
             |
1.hyperten~n |   1.102506   .0688582     1.56   0.118     .9754792    1.246073
1.cancer_e~r |   1.152992   .0903197     1.82   0.069     .9888887    1.344328
1.neuro_co~s |   1.811294   .1412052     7.62   0.000     1.554643    2.110314
1.flu_vacc~e |   .9080637   .0595108    -1.47   0.141     .7986049    1.032525
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11524.649
Iteration 2:   log likelihood = -11225.021
Iteration 3:   log likelihood = -11191.882
Iteration 4:   log likelihood = -11189.341
Iteration 5:   log likelihood = -11189.308
Iteration 6:   log likelihood = -11189.308
Refining estimates:
Iteration 0:   log likelihood = -11189.308

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(21)      =      727.63
Log likelihood  =   -11189.308                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9209867    .103608    -0.73   0.464     .7387474    1.148182
  1.dmard_pc |   1.020951    .065422     0.32   0.746     .9004512    1.157576
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .9081929    .149355    -0.59   0.558      .657954    1.253605
             |
   agegroup2 |
     60-<70  |   .8227858   .0790418    -2.03   0.042     .6815774    .9932495
     70-<80  |   1.286829   .1156712     2.81   0.005     1.078965    1.534737
        80+  |   2.667413   .2497867    10.48   0.000     2.220141    3.204793
             |
      1.male |   1.163895   .0689061     2.56   0.010     1.036383    1.307096
1.oral_pr~ne |   1.798591   .1117332     9.45   0.000     1.592405    2.031474
    1.nsaids |   .9812061   .0831273    -0.22   0.823     .8310876     1.15844
1.~c_disease |   1.320385   .0872852     4.20   0.000     1.159929    1.503039
1.resp_exc~a |   1.136511   .0805722     1.80   0.071     .9890726    1.305927
             |
egfr_cat_n~s |
      30-59  |   1.170124   .0858895     2.14   0.032     1.013333    1.351176
        <30  |   2.649441   .3695306     6.99   0.000     2.015733    3.482375
             |
1.~r_disease |   1.112941   .2400453     0.50   0.620     .7292563    1.698494
             |
   obese4cat |
Obese I ..)  |   1.200366   .0851205     2.58   0.010     1.044608    1.379349
Obese II..)  |    1.33647   .1347167     2.88   0.004     1.096876    1.628398
Obese II..)  |   1.578449   .2100864     3.43   0.001     1.216013    2.048909
             |
1.hyperten~n |   1.102271   .0688404     1.56   0.119     .9752768    1.245801
1.cancer_e~r |   1.152992   .0903198     1.82   0.069     .9888889    1.344329
1.neuro_co~s |   1.811793   .1412432     7.62   0.000     1.555073    2.110893
1.flu_vacc~e |   .9072144   .0594724    -1.49   0.137     .7978284    1.031598
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.34
(Assumption: A nested in B)                           Prob > chi2 =    0.5580

-------------------------------------------------------------------------------
-> oral_prednisolone = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,190        818 |   137,008 
           |     99.40       0.60 |    100.00 
-----------+----------------------+----------
       HCQ |    23,528        107 |    23,635 
           |     99.55       0.45 |    100.00 
-----------+----------------------+----------
     Total |   159,718        925 |   160,643 
           |     99.42       0.58 |    100.00 

-------------------------------------------------------------------------------
-> oral_prednisolone = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,381        346 |    26,727 
           |     98.71       1.29 |    100.00 
-----------+----------------------+----------
       HCQ |     6,799         67 |     6,866 
           |     99.02       0.98 |    100.00 
-----------+----------------------+----------
     Total |    33,180        413 |    33,593 
           |     98.77       1.23 |    100.00 


         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16265.024
Iteration 2:   log likelihood = -16264.999
Iteration 3:   log likelihood = -16264.999
Refining estimates:
Iteration 0:   log likelihood = -16264.999

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(1)       =        8.74
Log likelihood  =   -16264.999                  Prob > chi2      =      0.0031

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7917429   .0643519    -2.87   0.004     .6751489    .9284721
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16194.865
Iteration 2:   log likelihood =  -16187.03
Iteration 3:   log likelihood = -16187.013
Iteration 4:   log likelihood = -16187.013
Refining estimates:
Iteration 0:   log likelihood = -16187.013

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(3)       =      164.71
Log likelihood  =   -16187.013                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7483933   .0769365    -2.82   0.005     .6118211    .9154515
1.oral_pr~ne |   2.195233   .1407808    12.26   0.000     1.935944    2.489249
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9891761   .1666515    -0.06   0.948     .7109964    1.376195
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_int_o
> ral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    155.97
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16089.702
Iteration 2:   log likelihood = -16050.656
Iteration 3:   log likelihood =  -16050.58
Iteration 4:   log likelihood =  -16050.58
Refining estimates:
Iteration 0:   log likelihood =  -16050.58

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(5)       =      437.58
Log likelihood  =    -16050.58                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9137599   .0746294    -1.10   0.269     .7785957    1.072389
             |
   agegroup2 |
     60-<70  |     .93121   .0860713    -0.77   0.441     .7769114    1.116153
     70-<80  |   1.608882   .1256303     6.09   0.000     1.380567    1.874954
        80+  |   3.769754   .2753183    18.17   0.000     3.266982      4.3499
             |
      1.male |    1.20118   .0698131     3.15   0.002     1.071854    1.346109
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16042.113
Iteration 2:   log likelihood = -15993.192
Iteration 3:   log likelihood =  -15993.09
Iteration 4:   log likelihood =  -15993.09
Refining estimates:
Iteration 0:   log likelihood =  -15993.09

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(7)       =      552.56
Log likelihood  =    -15993.09                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8546981   .0881334    -1.52   0.128     .6982965     1.04613
1.oral_pr~ne |    1.94764   .1258384    10.32   0.000     1.715979    2.210576
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   1.033081   .1740944     0.19   0.847     .7424892    1.437403
             |
   agegroup2 |
     60-<70  |   .8984522   .0831349    -1.16   0.247      .749432    1.077104
     70-<80  |   1.504744   .1180494     5.21   0.000     1.290282    1.754853
        80+  |    3.47203   .2555229    16.91   0.000     3.005659    4.010767
             |
      1.male |   1.204362   .0700135     3.20   0.001     1.074667    1.349709
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    114.98
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11320.264
Iteration 2:   log likelihood = -11274.657
Iteration 3:   log likelihood = -11274.579
Iteration 4:   log likelihood = -11274.579
Refining estimates:
Iteration 0:   log likelihood = -11274.579

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(7)       =      557.09
Log likelihood  =   -11274.579                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8797582   .0730579    -1.54   0.123      .747613    1.035261
             |
   agegroup2 |
     60-<70  |   .9083474   .0844031    -1.03   0.301     .7571097    1.089796
     70-<80  |   1.544586   .1223892     5.49   0.000     1.322406    1.804094
        80+  |   3.572607   .2663437    17.08   0.000      3.08693    4.134697
             |
      1.male |   1.209424   .0705814     3.26   0.001     1.078706    1.355983
  1.dmard_pc |   .9425391   .0555095    -1.00   0.315     .8397868    1.057864
1.oral_pr~ne |   1.942425   .1164657    11.07   0.000     1.727059    2.184647
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11321.883
Iteration 2:   log likelihood = -11274.653
Iteration 3:   log likelihood = -11274.558
Iteration 4:   log likelihood = -11274.558
Refining estimates:
Iteration 0:   log likelihood = -11274.558

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(8)       =      557.13
Log likelihood  =   -11274.558                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8685393    .090447    -1.35   0.176      .708187      1.0652
1.oral_pr~ne |   1.932629    .125319    10.16   0.000     1.701976    2.194541
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   1.035381   .1747923     0.21   0.837     .7437053    1.441449
             |
   agegroup2 |
     60-<70  |   .9085491   .0844278    -1.03   0.302     .7572681    1.090052
     70-<80  |   1.544843   .1224151     5.49   0.000     1.322617    1.804407
        80+  |   3.573273   .2664035    17.08   0.000     3.087488    4.135491
             |
      1.male |   1.209237   .0705761     3.26   0.001     1.078529    1.355785
  1.dmard_pc |   .9428417   .0555433    -1.00   0.318     .8400285    1.058238
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.04
(Assumption: A nested in B)                           Prob > chi2 =    0.8370

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11524.843
Iteration 2:   log likelihood = -11225.193
Iteration 3:   log likelihood = -11192.054
Iteration 4:   log likelihood = -11189.512
Iteration 5:   log likelihood = -11189.479
Iteration 6:   log likelihood = -11189.479
Refining estimates:
Iteration 0:   log likelihood = -11189.479

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(20)      =      727.28
Log likelihood  =   -11189.479                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8802841   .0732804    -1.53   0.126     .7477621    1.036292
             |
   agegroup2 |
     60-<70  |   .8230506   .0790653    -2.03   0.043     .6817999    .9935647
     70-<80  |   1.287779   .1157449     2.81   0.005     1.079782    1.535844
        80+  |   2.668573   .2498866    10.48   0.000      2.22112    3.206166
             |
      1.male |   1.163538   .0688778     2.56   0.011     1.036077    1.306679
  1.dmard_pc |   1.006966   .0601367     0.12   0.907      .895737    1.132007
1.oral_pr~ne |    1.80058   .1118074     9.47   0.000     1.594252    2.033611
    1.nsaids |   .9818366   .0831747    -0.22   0.829     .8316317    1.159171
1.~c_disease |   1.320059    .087262     4.20   0.000     1.159644    1.502663
1.resp_exc~a |    1.13641   .0805702     1.80   0.071     .9889761    1.305823
             |
egfr_cat_n~s |
      30-59  |   1.170402   .0859061     2.14   0.032      1.01358    1.351489
        <30  |    2.64855   .3694008     6.98   0.000     2.015063    3.481189
             |
1.~r_disease |    1.11325     .24011     0.50   0.619     .7294613     1.69896
             |
   obese4cat |
Obese I ..)  |   1.200328   .0851179     2.57   0.010     1.044574    1.379305
Obese II..)  |   1.336186    .134685     2.88   0.004     1.096649    1.628045
Obese II..)  |   1.577813   .2099991     3.43   0.001     1.215527    2.048076
             |
1.hyperten~n |   1.102506   .0688582     1.56   0.118     .9754792    1.246073
1.cancer_e~r |   1.152992   .0903197     1.82   0.069     .9888887    1.344328
1.neuro_co~s |   1.811294   .1412052     7.62   0.000     1.554643    2.110314
1.flu_vacc~e |   .9080637   .0595108    -1.47   0.141     .7986049    1.032525
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11526.444
Iteration 2:   log likelihood = -11225.169
Iteration 3:   log likelihood = -11192.025
Iteration 4:   log likelihood = -11189.481
Iteration 5:   log likelihood = -11189.447
Iteration 6:   log likelihood = -11189.447
Refining estimates:
Iteration 0:   log likelihood = -11189.447

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(21)      =      727.35
Log likelihood  =   -11189.447                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8665323   .0904514    -1.37   0.170     .7062097    1.063251
1.oral_pr~ne |   1.789357   .1197304     8.70   0.000     1.569426    2.040107
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   1.043568   .1762015     0.25   0.801     .7495476    1.452921
             |
   agegroup2 |
     60-<70  |   .8232145   .0790843    -2.03   0.043     .6819305    .9937701
     70-<80  |   1.287927   .1157595     2.82   0.005     1.079904    1.536023
        80+  |   2.668886   .2499175    10.48   0.000     2.221378    3.206546
             |
      1.male |   1.163272   .0688704     2.55   0.011     1.035826    1.306399
  1.dmard_pc |   1.007362   .0601773     0.12   0.902     .8960598     1.13249
    1.nsaids |   .9820159   .0831916    -0.21   0.830     .8317808    1.159386
1.~c_disease |   1.320091   .0872638     4.20   0.000     1.159674    1.502699
1.resp_exc~a |   1.136696   .0805986     1.81   0.071     .9892112     1.30617
             |
egfr_cat_n~s |
      30-59  |   1.170291   .0859005     2.14   0.032     1.013479    1.351365
        <30  |   2.648649   .3694157     6.98   0.000     2.015137    3.481323
             |
1.~r_disease |   1.113439   .2401518     0.50   0.618     .7295841    1.699252
             |
   obese4cat |
Obese I ..)  |   1.200406   .0851246     2.58   0.010      1.04464    1.379397
Obese II..)  |   1.336356   .1347039     2.88   0.004     1.096785    1.628256
Obese II..)  |   1.577645   .2099784     3.43   0.001     1.215395    2.047863
             |
1.hyperten~n |   1.102538   .0688607     1.56   0.118     .9755072    1.246111
1.cancer_e~r |   1.152962   .0903172     1.82   0.069     .9888635    1.344293
1.neuro_co~s |   1.811296   .1412069     7.62   0.000     1.554643     2.11032
1.flu_vacc~e |   .9082034   .0595239    -1.47   0.142     .7987211    1.032693
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.06
(Assumption: A nested in B)                           Prob > chi2 =    0.8008

-------------------------------------------------------------------------------
-> nsaids = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,096      1,025 |   137,121 
           |     99.25       0.75 |    100.00 
-----------+----------------------+----------
       HCQ |    23,717        142 |    23,859 
           |     99.40       0.60 |    100.00 
-----------+----------------------+----------
     Total |   159,813      1,167 |   160,980 
           |     99.28       0.72 |    100.00 

-------------------------------------------------------------------------------
-> nsaids = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,475        139 |    26,614 
           |     99.48       0.52 |    100.00 
-----------+----------------------+----------
       HCQ |     6,610         32 |     6,642 
           |     99.52       0.48 |    100.00 
-----------+----------------------+----------
     Total |    33,085        171 |    33,256 
           |     99.49       0.51 |    100.00 


         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16265.024
Iteration 2:   log likelihood = -16264.999
Iteration 3:   log likelihood = -16264.999
Refining estimates:
Iteration 0:   log likelihood = -16264.999

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(1)       =        8.74
Log likelihood  =   -16264.999                  Prob > chi2      =      0.0031

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7917429   .0643519    -2.87   0.004     .6751489    .9284721
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16255.797
Iteration 2:   log likelihood = -16255.691
Iteration 3:   log likelihood = -16255.691
Refining estimates:
Iteration 0:   log likelihood = -16255.691

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(3)       =       27.36
Log likelihood  =   -16255.691                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7859308   .0703743    -2.69   0.007     .6594252    .9367056
    1.nsaids |   .6977583   .0630685    -3.98   0.000     .5844768    .8329958
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.156445   .2492725     0.67   0.500     .7579626     1.76442
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_int_n
> saids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     18.62
(Assumption: A nested in B)                           Prob > chi2 =    0.0001

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16089.702
Iteration 2:   log likelihood = -16050.656
Iteration 3:   log likelihood =  -16050.58
Iteration 4:   log likelihood =  -16050.58
Refining estimates:
Iteration 0:   log likelihood =  -16050.58

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(5)       =      437.58
Log likelihood  =    -16050.58                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9137599   .0746294    -1.10   0.269     .7785957    1.072389
             |
   agegroup2 |
     60-<70  |     .93121   .0860713    -0.77   0.441     .7769114    1.116153
     70-<80  |   1.608882   .1256303     6.09   0.000     1.380567    1.874954
        80+  |   3.769754   .2753183    18.17   0.000     3.266982      4.3499
             |
      1.male |    1.20118   .0698131     3.15   0.002     1.071854    1.346109
------------------------------------------------------------------------------

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16269.37
Iteration 1:   log likelihood = -16089.046
Iteration 2:   log likelihood = -16050.019
Iteration 3:   log likelihood = -16049.943
Iteration 4:   log likelihood = -16049.943
Refining estimates:
Iteration 0:   log likelihood = -16049.943

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(7)       =      438.85
Log likelihood  =   -16049.943                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9011669   .0809813    -1.16   0.247     .7556382    1.074723
    1.nsaids |   .9028512   .0827636    -1.11   0.265      .754375    1.080551
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.105388   .2383213     0.46   0.642     .7244295    1.686684
             |
   agegroup2 |
     60-<70  |   .9306854   .0860401    -0.78   0.437     .7764454    1.115565
     70-<80  |   1.598774   .1252929     5.99   0.000     1.371134    1.864207
        80+  |   3.722005   .2756248    17.75   0.000     3.219164    4.303391
             |
      1.male |   1.200804   .0697939     3.15   0.002     1.071514    1.345693
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      1.27
(Assumption: A nested in B)                           Prob > chi2 =    0.5290

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11320.264
Iteration 2:   log likelihood = -11274.657
Iteration 3:   log likelihood = -11274.579
Iteration 4:   log likelihood = -11274.579
Refining estimates:
Iteration 0:   log likelihood = -11274.579

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(7)       =      557.09
Log likelihood  =   -11274.579                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8797582   .0730579    -1.54   0.123      .747613    1.035261
             |
   agegroup2 |
     60-<70  |   .9083474   .0844031    -1.03   0.301     .7571097    1.089796
     70-<80  |   1.544586   .1223892     5.49   0.000     1.322406    1.804094
        80+  |   3.572607   .2663437    17.08   0.000      3.08693    4.134697
             |
      1.male |   1.209424   .0705814     3.26   0.001     1.078706    1.355983
  1.dmard_pc |   .9425391   .0555095    -1.00   0.315     .8397868    1.057864
1.oral_pr~ne |   1.942425   .1164657    11.07   0.000     1.727059    2.184647
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11319.747
Iteration 2:   log likelihood = -11274.116
Iteration 3:   log likelihood = -11274.039
Iteration 4:   log likelihood = -11274.039
Refining estimates:
Iteration 0:   log likelihood = -11274.039

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(9)       =      558.17
Log likelihood  =   -11274.039                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8655964   .0789235    -1.58   0.113     .7239431    1.034967
    1.nsaids |    .909863   .0839884    -1.02   0.306     .7592811    1.090309
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.116736   .2408369     0.51   0.609     .7317778    1.704205
             |
   agegroup2 |
     60-<70  |   .9068259   .0843038    -1.05   0.293     .7557729    1.088069
     70-<80  |   1.533565   .1222102     5.37   0.000     1.311806    1.792811
        80+  |   3.526786   .2675657    16.61   0.000     3.039494    4.092201
             |
      1.male |   1.208794   .0705513     3.25   0.001     1.078132    1.355291
  1.dmard_pc |   .9454201   .0557595    -0.95   0.341     .8422135    1.061274
1.oral_pr~ne |   1.944306   .1166081    11.09   0.000      1.72868    2.186829
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      1.08
(Assumption: A nested in B)                           Prob > chi2 =    0.5827

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11524.843
Iteration 2:   log likelihood = -11225.193
Iteration 3:   log likelihood = -11192.054
Iteration 4:   log likelihood = -11189.512
Iteration 5:   log likelihood = -11189.479
Iteration 6:   log likelihood = -11189.479
Refining estimates:
Iteration 0:   log likelihood = -11189.479

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(20)      =      727.28
Log likelihood  =   -11189.479                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8802841   .0732804    -1.53   0.126     .7477621    1.036292
             |
   agegroup2 |
     60-<70  |   .8230506   .0790653    -2.03   0.043     .6817999    .9935647
     70-<80  |   1.287779   .1157449     2.81   0.005     1.079782    1.535844
        80+  |   2.668573   .2498866    10.48   0.000      2.22112    3.206166
             |
      1.male |   1.163538   .0688778     2.56   0.011     1.036077    1.306679
  1.dmard_pc |   1.006966   .0601367     0.12   0.907      .895737    1.132007
1.oral_pr~ne |    1.80058   .1118074     9.47   0.000     1.594252    2.033611
    1.nsaids |   .9818366   .0831747    -0.22   0.829     .8316317    1.159171
1.~c_disease |   1.320059    .087262     4.20   0.000     1.159644    1.502663
1.resp_exc~a |    1.13641   .0805702     1.80   0.071     .9889761    1.305823
             |
egfr_cat_n~s |
      30-59  |   1.170402   .0859061     2.14   0.032      1.01358    1.351489
        <30  |    2.64855   .3694008     6.98   0.000     2.015063    3.481189
             |
1.~r_disease |    1.11325     .24011     0.50   0.619     .7294613     1.69896
             |
   obese4cat |
Obese I ..)  |   1.200328   .0851179     2.57   0.010     1.044574    1.379305
Obese II..)  |   1.336186    .134685     2.88   0.004     1.096649    1.628045
Obese II..)  |   1.577813   .2099991     3.43   0.001     1.215527    2.048076
             |
1.hyperten~n |   1.102506   .0688582     1.56   0.118     .9754792    1.246073
1.cancer_e~r |   1.152992   .0903197     1.82   0.069     .9888887    1.344328
1.neuro_co~s |   1.811294   .1412052     7.62   0.000     1.554643    2.110314
1.flu_vacc~e |   .9080637   .0595108    -1.47   0.141     .7986049    1.032525
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11553.122
Iteration 1:   log likelihood = -11524.862
Iteration 2:   log likelihood = -11225.111
Iteration 3:   log likelihood = -11191.965
Iteration 4:   log likelihood = -11189.424
Iteration 5:   log likelihood =  -11189.39
Iteration 6:   log likelihood =  -11189.39
Refining estimates:
Iteration 0:   log likelihood =  -11189.39

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =        1,338
Time at risk    =     24572831
                                                LR chi2(21)      =      727.46
Log likelihood  =    -11189.39                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8667551   .0791563    -1.57   0.117     .7247037     1.03665
    1.nsaids |   .9664688   .0898331    -0.37   0.714     .8055061    1.159596
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.095786   .2363375     0.42   0.671     .7180258     1.67229
             |
   agegroup2 |
     60-<70  |   .8234059   .0791045    -2.02   0.043      .682086    .9940056
     70-<80  |   1.288125   .1157861     2.82   0.005     1.080055     1.53628
        80+  |   2.668162   .2498786    10.48   0.000     2.220729    3.205744
             |
      1.male |   1.163726   .0688909     2.56   0.010     1.036241    1.306895
  1.dmard_pc |   1.007181    .060155     0.12   0.905     .8959191    1.132261
1.oral_pr~ne |   1.801022   .1118399     9.47   0.000     1.594634    2.034122
1.~c_disease |   1.319972   .0872552     4.20   0.000      1.15957    1.502562
1.resp_exc~a |   1.136397   .0805683     1.80   0.071     .9889665    1.305806
             |
egfr_cat_n~s |
      30-59  |   1.170429   .0859078     2.14   0.032     1.013604    1.351519
        <30  |   2.647439   .3692555     6.98   0.000     2.014204    3.479754
             |
1.~r_disease |   1.113307    .240123     0.50   0.619     .7294981    1.699049
             |
   obese4cat |
Obese I ..)  |   1.200201   .0851086     2.57   0.010     1.044464    1.379159
Obese II..)  |    1.33626   .1346937     2.88   0.004     1.096707    1.628138
Obese II..)  |   1.577428   .2099545     3.42   0.001     1.215221    2.047594
             |
1.hyperten~n |   1.102557   .0688647     1.56   0.118     .9755191    1.246139
1.cancer_e~r |    1.15287   .0903099     1.82   0.069     .9887846    1.344185
1.neuro_co~s |   1.811136   .1411961     7.62   0.000     1.554503    2.110138
1.flu_vacc~e |   .9082061    .059519    -1.47   0.142     .7987323    1.032684
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.18
(Assumption: A nested in B)                           Prob > chi2 =    0.6734

. 
. 
. 
. 
. 
. 
. /* Print interaction table===================================================
> =*/ 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table3.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 3: Interactions with HCQ use on risk of $tabl
> eoutcome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab _tab ("Age/
> Sex Adjusted") _tab _tab _tab  ///
>                                                 ("DAG Adjusted") _tab _tab _t
> ab ("Fully Adjusted") _tab _tab _tab _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("p (interactio
> n)") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("p (interact
> ion)") _tab ("HR") _tab ("95% CI") _tab ("p (interaction)") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab (
> "p (interaction)") _tab _n

. 
.                                                 
. * Generic program to print model for a level of another variable 
. cap prog drop printinteraction

. prog define printinteraction 
  1. syntax, variable(varname) min(real) max(real) 
  2. 
. * Overall p-values 
. 
. file write tablecontent ("`variable'") _tab _tab _tab _tab ("${univar_p_`vari
> able'}") ///
>                                                 _tab _tab _tab ("${multivar1_
> p_`variable'}") /// 
>                                                 _tab _tab _tab ("${multivar2_
> p_`variable'}") ///
>                                                 _tab _tab _tab ("${multivar3_
> p_`variable'}") _n
  3.         forvalues varlevel = `min'/`max'{ 
  4. 
.                 * Row headings 
.                                                         
.                 file write tablecontent ("`varlevel'") _n       
  5. 
.                 local lab0: label exposure 0
  6.                 local lab1: label exposure 1
  7.                  
.                 /* Counts */
.                         
.                 * First row, exposure = 0 (reference)
.                 
.         file write tablecontent ("`lab0'") _tab
  8. 
.                         cou if exposure == 0 & `variable' == `varlevel'
  9.                         local rowdenom = r(N)
 10.                         cou if exposure == 0  & `variable' == `varlevel' &
>  $outcome == 1
 11.                         local pct = 100*(r(N)/`rowdenom')
 12.                         
.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 13.                 file write tablecontent ("1.00 (ref)") _tab _tab _tab ("1.
> 00 (ref)") _tab _tab _tab ("1.00 (ref)") _tab _tab _tab ("1.00 (ref)") _n
 14.                         
.                 * Second row, exposure = 1 (comparator)
. 
.                 file write tablecontent ("`lab1'") _tab  
 15. 
.                         cou if exposure == 1 & `variable' == `varlevel'
 16.                         local rowdenom = r(N)
 17.                         cou if exposure == 1 & `variable' == `varlevel' & 
> $outcome == 1
 18.                         local pct = 100*(r(N)/`rowdenom')
 19.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 20. 
.                 * Print models 
.                 estimates use $Tempdir/univar_int_`variable' 
 21.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 22.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 23. 
.                 estimates use $Tempdir/multivar1_int_`variable'
 24.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 25.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 26. 
.                 estimates use $Tempdir/multivar2_int_`variable'
 27.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 28.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab 
 29.         
.                 estimates use $Tempdir/multivar3_int_`variable'
 30.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 31.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _n
 32.         } 
 33.                 
. end

. 
. printinteraction, variable(agegroup2) min(3) max(6) 
  57,621
  250
  12,492
  58
  37,655
  155
  7,962
  34
  41,976
  306
  7,125
  47
  26,483
  453
  2,922
  35

. file write tablecontent _n _n

. 
. printinteraction, variable(dmard_pc) min(0) max(1) 
  108,097
  770
  14,797
  91
  55,638
  394
  15,704
  83

. file write tablecontent _n _n

.   
. printinteraction, variable(oral_prednisolone) min(0) max(1) 
  137,008
  818
  23,635
  107
  26,727
  346
  6,866
  67

. file write tablecontent _n _n

. 
. printinteraction, variable(nsaids) min(0) max(1) 
  137,121
  1,025
  23,859
  142
  26,614
  139
  6,642
  32

. 
. 
. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\07_an_mod
> els_interact.log
  log type:  text
 closed on:  19 Jul 2020, 18:35:53
-------------------------------------------------------------------------------
