-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\10_an_mod
> els_ethnicity.log
  log type:  text
 opened on:  17 Aug 2020, 10:29:21

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. drop if ethnicity == .u
(45,405 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   125,148        935 |   126,083 
           |     99.26       0.74 |    100.00 
-----------+----------------------+----------
       HCQ |    23,388        144 |    23,532 
           |     99.39       0.61 |    100.00 
-----------+----------------------+----------
     Total |   148,536      1,079 |   149,615 
           |     99.28       0.72 |    100.00 

. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -12837.41
Iteration 1:   log likelihood = -12834.633
Iteration 2:   log likelihood =  -12834.62
Iteration 3:   log likelihood =  -12834.62
Refining estimates:
Iteration 0:   log likelihood =  -12834.62

Cox regression -- Breslow method for ties

No. of subjects =      149,615                  Number of obs    =     149,615
No. of failures =        1,079
Time at risk    =     22969930
                                                LR chi2(1)       =        5.58
Log likelihood  =    -12834.62                  Prob > chi2      =      0.0182

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8136359   .0728374    -2.30   0.021     .6826998    .9696843
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar.ster 
> saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -12837.41
Iteration 1:   log likelihood = -12776.027
Iteration 2:   log likelihood = -12671.459
Iteration 3:   log likelihood = -12666.925
Iteration 4:   log likelihood = -12666.908
Iteration 5:   log likelihood = -12666.908
Refining estimates:
Iteration 0:   log likelihood = -12666.908

Cox regression -- Breslow method for ties

No. of subjects =      149,615                  Number of obs    =     149,615
No. of failures =        1,079
Time at risk    =     22969930
                                                LR chi2(5)       =      341.00
Log likelihood  =   -12666.908                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9475829   .0854121    -0.60   0.550     .7941319    1.130685
      1.male |   1.219674   .0792886     3.05   0.002     1.073764    1.385412
        age1 |   .9978971   .0081367    -0.26   0.796     .9820763    1.013973
        age2 |   1.014975   .0166802     0.90   0.366     .9828028    1.048199
        age3 |   1.136806   .0879883     1.66   0.098     .9767955    1.323028
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1.st
> er saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -9047.2529
Iteration 1:   log likelihood = -8934.5613
Iteration 2:   log likelihood = -8828.4648
Iteration 3:   log likelihood = -8824.6941
Iteration 4:   log likelihood = -8824.6831
Iteration 5:   log likelihood = -8824.6831
Refining estimates:
Iteration 0:   log likelihood = -8824.6831

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,615                  Number of obs    =     149,615
No. of failures =        1,079
Time at risk    =     22969930
                                                LR chi2(7)       =      445.14
Log likelihood  =   -8824.6831                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8860964   .0812171    -1.32   0.187     .7403929    1.060473
      1.male |    1.23212   .0804421     3.20   0.001     1.084127    1.400316
        age1 |   .9981514   .0081876    -0.23   0.822     .9822322    1.014328
        age2 |   1.009341   .0166744     0.56   0.574     .9771832    1.042557
        age3 |   1.173741   .0915453     2.05   0.040     1.007357    1.367607
  1.dmard_pc |    1.01276   .0667671     0.19   0.847     .8900003    1.152451
1.oral_pr~ne |    1.99855   .1333807    10.38   0.000     1.753505     2.27784
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2.st
> er saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)  

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -9047.2529
Iteration 1:   log likelihood = -9020.8553
Iteration 2:   log likelihood = -8752.5193
Iteration 3:   log likelihood =  -8726.343
Iteration 4:   log likelihood = -8724.6688
Iteration 5:   log likelihood = -8724.6498
Iteration 6:   log likelihood = -8724.6498
Refining estimates:
Iteration 0:   log likelihood = -8724.6498

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,615                  Number of obs    =     149,615
No. of failures =        1,079
Time at risk    =     22969930
                                                LR chi2(29)      =      645.21
Log likelihood  =   -8724.6498                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8861158   .0814959    -1.31   0.189     .7399556    1.061146
      1.male |   1.178311    .079156     2.44   0.015     1.032948    1.344131
        age1 |   .9941309   .0082403    -0.71   0.478     .9781106    1.010413
        age2 |   1.003505   .0169189     0.21   0.836     .9708868     1.03722
        age3 |   1.196709   .0953263     2.25   0.024     1.023727    1.398919
  1.dmard_pc |   1.092952   .0730808     1.33   0.184     .9587057    1.245998
1.oral_pr~ne |   1.864413   .1289233     9.01   0.000     1.628103    2.135022
    1.nsaids |    1.00079    .093484     0.01   0.993     .8333592    1.201861
1.~c_disease |   1.221074   .0917877     2.66   0.008     1.053798    1.414902
1.resp_exc~a |   1.103363   .0895284     1.21   0.225     .9411321    1.293558
             |
egfr_cat_n~s |
      30-59  |   1.082691    .090903     0.95   0.344     .9184114    1.276355
        <30  |    2.15888   .3477619     4.78   0.000     1.574394    2.960355
             |
1.~r_disease |   .9948089   .2443005    -0.02   0.983     .6147599    1.609807
             |
   obese4cat |
Obese I ..)  |   1.178931   .0928558     2.09   0.037     1.010288    1.375724
Obese II..)  |    1.21153   .1387653     1.68   0.094     .9679207    1.516451
Obese II..)  |   1.546148    .220525     3.06   0.002     1.169083    2.044828
             |
1.hyperten~n |   1.051135   .0746339     0.70   0.482     .9145775    1.208082
1.cancer_e~r |   1.188488   .1043024     1.97   0.049     1.000675    1.411552
1.neuro_co~s |   1.691788   .1501554     5.92   0.000     1.421665    2.013236
1.flu_vacc~e |   .8498552   .0618843    -2.23   0.025     .7368221    .9802283
             |
         imd |
          2  |   1.097236   .1150816     0.88   0.376     .8933537    1.347649
          3  |   1.240975   .1284437     2.09   0.037     1.013122    1.520072
          4  |   1.204045   .1256471     1.78   0.075     .9813325    1.477301
5 most de..  |   1.461512   .1493014     3.71   0.000      1.19632    1.785489
             |
     diabcat |
Controlle..  |   1.295559   .1089712     3.08   0.002     1.098656    1.527752
Uncontrol..  |    1.57348    .181118     3.94   0.000      1.25569    1.971698
Diabetes,..  |   1.903219   .3316749     3.69   0.000     1.352538    2.678108
             |
smoke_nomiss |
     Former  |    1.13722   .0777929     1.88   0.060     .9945278    1.300385
    Current  |   .5692861   .0740859    -4.33   0.000       .44112    .7346906
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3.st
> er saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -12837.41
Iteration 1:   log likelihood = -12834.633
Iteration 2:   log likelihood =  -12834.62
Iteration 3:   log likelihood =  -12834.62
Refining estimates:
Iteration 0:   log likelihood =  -12834.62

Cox regression -- Breslow method for ties

No. of subjects =      149,615                  Number of obs    =     149,615
No. of failures =        1,079
Time at risk    =     22969930
                                                LR chi2(1)       =        5.58
Log likelihood  =    -12834.62                  Prob > chi2      =      0.0182

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8136359   .0728374    -2.30   0.021     .6826998    .9696843
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_eth.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -12837.41
Iteration 1:   log likelihood = -12776.027
Iteration 2:   log likelihood = -12671.459
Iteration 3:   log likelihood = -12666.925
Iteration 4:   log likelihood = -12666.908
Iteration 5:   log likelihood = -12666.908
Refining estimates:
Iteration 0:   log likelihood = -12666.908

Cox regression -- Breslow method for ties

No. of subjects =      149,615                  Number of obs    =     149,615
No. of failures =        1,079
Time at risk    =     22969930
                                                LR chi2(5)       =      341.00
Log likelihood  =   -12666.908                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9475829   .0854121    -0.60   0.550     .7941319    1.130685
      1.male |   1.219674   .0792886     3.05   0.002     1.073764    1.385412
        age1 |   .9978971   .0081367    -0.26   0.796     .9820763    1.013973
        age2 |   1.014975   .0166802     0.90   0.366     .9828028    1.048199
        age3 |   1.136806   .0879883     1.66   0.098     .9767955    1.323028
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_et
> h.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp population)                               

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -9047.2529
Iteration 1:   log likelihood = -8919.1054
Iteration 2:   log likelihood = -8814.9172
Iteration 3:   log likelihood = -8811.2662
Iteration 4:   log likelihood = -8811.2558
Iteration 5:   log likelihood = -8811.2558
Refining estimates:
Iteration 0:   log likelihood = -8811.2558

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,615                  Number of obs    =     149,615
No. of failures =        1,079
Time at risk    =     22969930
                                                LR chi2(11)      =      471.99
Log likelihood  =   -8811.2558                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8766843   .0803864    -1.44   0.151      .732476    1.049284
      1.male |    1.24147   .0810748     3.31   0.001     1.092315    1.410991
        age1 |   .9996112   .0082361    -0.05   0.962     .9835983    1.015885
        age2 |   1.010787   .0167458     0.65   0.517     .9784933    1.044147
        age3 |   1.162136   .0908859     1.92   0.055     .9969835    1.354647
             |
   ethnicity |
South Asian  |   1.551897   .1817471     3.75   0.000     1.233605    1.952313
      Black  |   1.989719   .3595638     3.81   0.000     1.396273    2.835392
      Mixed  |   2.109875   .5755643     2.74   0.006     1.236097    3.601311
      Other  |   1.225523    .361447     0.69   0.490     .6875019    2.184584
             |
  1.dmard_pc |   1.018951   .0671755     0.28   0.776     .8954411    1.159498
1.oral_pr~ne |   1.997191   .1332566    10.37   0.000     1.752369    2.276215
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_et
> h.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)  
>     

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -9047.2529
Iteration 1:   log likelihood = -9010.6075
Iteration 2:   log likelihood = -8744.1731
Iteration 3:   log likelihood = -8718.4162
Iteration 4:   log likelihood = -8716.7716
Iteration 5:   log likelihood = -8716.7531
Iteration 6:   log likelihood = -8716.7531
Refining estimates:
Iteration 0:   log likelihood = -8716.7531

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,615                  Number of obs    =     149,615
No. of failures =        1,079
Time at risk    =     22969930
                                                LR chi2(33)      =      661.00
Log likelihood  =   -8716.7531                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8772212   .0807074    -1.42   0.154     .7324797    1.050564
      1.male |   1.179492   .0793538     2.45   0.014      1.03378    1.345743
        age1 |   .9950756   .0082849    -0.59   0.553     .9789693    1.011447
        age2 |   1.004627   .0169814     0.27   0.785     .9718893    1.038467
        age3 |   1.189167   .0949144     2.17   0.030     1.016959    1.390536
             |
   ethnicity |
South Asian  |   1.404264   .1715712     2.78   0.005     1.105224    1.784217
      Black  |    1.68452   .3083654     2.85   0.004     1.176676    2.411547
      Mixed  |   1.884392   .5155637     2.32   0.021     1.102263    3.221494
      Other  |    1.18725   .3510417     0.58   0.562      .665062    2.119446
             |
  1.dmard_pc |   1.093128   .0730771     1.33   0.183     .9588857    1.246163
1.oral_pr~ne |   1.858599   .1284793     8.97   0.000     1.623097    2.128269
    1.nsaids |   1.001716   .0935799     0.02   0.985     .8341144    1.202994
1.~c_disease |   1.217153   .0915206     2.61   0.009     1.050368    1.410422
1.resp_exc~a |   1.112097   .0902251     1.31   0.190     .9486022    1.303771
             |
egfr_cat_n~s |
      30-59  |   1.079605   .0905867     0.91   0.361     .9158891    1.272585
        <30  |   2.131963   .3433431     4.70   0.000     1.554882    2.923222
             |
1.~r_disease |   1.005519   .2469772     0.02   0.982     .6213217    1.627285
             |
   obese4cat |
Obese I ..)  |   1.184004   .0932515     2.14   0.032     1.014642    1.381635
Obese II..)  |   1.227465   .1407002     1.79   0.074     .9804803    1.536667
Obese II..)  |   1.575137   .2250034     3.18   0.001     1.190493    2.084058
             |
1.hyperten~n |    1.04296   .0740696     0.59   0.554     .9074373    1.198723
1.cancer_e~r |   1.199561   .1053854     2.07   0.038     1.009814    1.424962
1.neuro_co~s |   1.691386   .1501692     5.92   0.000     1.421245    2.012873
1.flu_vacc~e |   .8593657   .0626612    -2.08   0.038     .7449243    .9913886
             |
         imd |
          2  |   1.094147   .1147514     0.86   0.391     .8908479     1.34384
          3  |    1.22801   .1271845     1.98   0.047     1.002405     1.50439
          4  |   1.174499   .1228819     1.54   0.124     .9567443    1.441816
5 most de..  |   1.400857   .1441548     3.28   0.001     1.144989    1.713904
             |
     diabcat |
Controlle..  |   1.255597   .1063839     2.69   0.007     1.063482    1.482418
Uncontrol..  |   1.517007   .1756303     3.60   0.000     1.209039     1.90342
Diabetes,..  |   1.850255   .3229083     3.53   0.000     1.314253    2.604858
             |
smoke_nomiss |
     Former  |   1.188397   .0833269     2.46   0.014     1.035804    1.363469
    Current  |   .6052757   .0796628    -3.81   0.000     .4676524    .7833997
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_et
> h.ster saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table6.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 6: Ethnicity adjustments") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. file write tablecontent ("Main Analysis, dropping individuals with missing et
> hnicity") _n                                       

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  126,083

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  935

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,532

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  144

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8136359   .0728374    -2.30   0.021     .6826998    .9696843
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9475829   .0854121    -0.60   0.550     .7941319    1.130685
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8860964   .0812171    -1.32   0.187     .7403929    1.060473
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8861158   .0814959    -1.31   0.189     .7399556    1.061146
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. file write tablecontent ("Main Analysis, adjusting for ethnicity") _n        
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  126,083

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  935

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,532

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  144

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8136359   .0728374    -2.30   0.021     .6826998    .9696843
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9475829   .0854121    -0.60   0.550     .7941319    1.130685
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8766843   .0803864    -1.44   0.151      .732476    1.049284
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8772212   .0807074    -1.42   0.154     .7324797    1.050564
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\10_an_mod
> els_ethnicity.log
  log type:  text
 closed on:  17 Aug 2020, 10:30:08
-------------------------------------------------------------------------------
