-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\10_an_mod
> els_ethnicity.log
  log type:  text
 opened on:  19 Jul 2020, 18:38:40

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. drop if ethnicity == .u
(45,240 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   124,644        903 |   125,547 
           |     99.28       0.72 |    100.00 
-----------+----------------------+----------
       HCQ |    23,310        139 |    23,449 
           |     99.41       0.59 |    100.00 
-----------+----------------------+----------
     Total |   147,954      1,042 |   148,996 
           |     99.30       0.70 |    100.00 

. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12393.529
Iteration 1:   log likelihood = -12390.825
Iteration 2:   log likelihood = -12390.813
Iteration 3:   log likelihood = -12390.813
Refining estimates:
Iteration 0:   log likelihood = -12390.813

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,042
Time at risk    =     18846861
                                                LR chi2(1)       =        5.43
Log likelihood  =   -12390.813                  Prob > chi2      =      0.0198

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .812955   .0740712    -2.27   0.023     .6800025    .9719021
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar.ster 
> saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12393.529
Iteration 1:   log likelihood =  -12334.89
Iteration 2:   log likelihood = -12221.997
Iteration 3:   log likelihood = -12216.955
Iteration 4:   log likelihood = -12216.936
Iteration 5:   log likelihood = -12216.936
Refining estimates:
Iteration 0:   log likelihood = -12216.936

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,042
Time at risk    =     18846861
                                                LR chi2(5)       =      353.19
Log likelihood  =   -12216.936                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9536999   .0875032    -0.52   0.605     .7967332    1.141591
      1.male |   1.235073   .0815097     3.20   0.001     1.085218    1.405622
        age1 |    .999824    .008514    -0.02   0.984     .9832753    1.016651
        age2 |   1.014797   .0172329     0.86   0.387     .9815766    1.049141
        age3 |   1.134697   .0901764     1.59   0.112      .971032    1.325948
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1.st
> er saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8736.1012
Iteration 1:   log likelihood = -8623.8823
Iteration 2:   log likelihood = -8509.7936
Iteration 3:   log likelihood = -8505.6717
Iteration 4:   log likelihood =  -8505.659
Iteration 5:   log likelihood =  -8505.659
Refining estimates:
Iteration 0:   log likelihood =  -8505.659

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,042
Time at risk    =     18846861
                                                LR chi2(7)       =      460.88
Log likelihood  =    -8505.659                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8959709   .0835906    -1.18   0.239     .7462427    1.075741
      1.male |   1.246374   .0826102     3.32   0.001     1.094537    1.419275
        age1 |   1.000231   .0085689     0.03   0.978     .9835769    1.017168
        age2 |   1.008734   .0172202     0.51   0.610     .9755415    1.043056
        age3 |   1.173531   .0939815     2.00   0.046     1.003059    1.372975
  1.dmard_pc |   1.008672   .0676846     0.13   0.898     .8843663     1.15045
1.oral_pr~ne |   2.047859   .1383108    10.61   0.000     1.793951    2.337704
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2.st
> er saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine, strata(stp population) 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8736.1012
Iteration 1:   log likelihood = -8472.5572
Iteration 2:   log likelihood = -8445.4606
Iteration 3:   log likelihood = -8445.3612
Iteration 4:   log likelihood = -8445.3612
Refining estimates:
Iteration 0:   log likelihood = -8445.3612

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,042
Time at risk    =     18846861
                                                LR chi2(20)      =      581.48
Log likelihood  =   -8445.3612                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8944076   .0836605    -1.19   0.233     .7445885    1.074372
      1.male |    1.21423   .0816537     2.89   0.004      1.06429    1.385294
        age1 |   .9964276   .0085941    -0.41   0.678      .979725    1.013415
        age2 |   1.006502   .0174737     0.37   0.709     .9728304    1.041339
        age3 |   1.173531   .0957204     1.96   0.050     1.000151    1.376968
  1.dmard_pc |   1.073776   .0729781     1.05   0.295     .9398593    1.226775
1.oral_pr~ne |   1.921651   .1344185     9.34   0.000     1.675458    2.204021
    1.nsaids |   .9720852   .0932121    -0.30   0.768     .8055335    1.173073
1.~c_disease |   1.291039   .0977255     3.37   0.001     1.113032    1.497516
1.resp_exc~a |    1.10466   .0893517     1.23   0.218     .9427106    1.294432
             |
egfr_cat_n~s |
      30-59  |    1.11196   .0948007     1.24   0.213     .9408481    1.314192
        <30  |   2.352067   .3818248     5.27   0.000     1.711076    3.233183
             |
1.~r_disease |   1.083329   .2658546     0.33   0.744     .6696858    1.752466
             |
   obese4cat |
Obese I ..)  |   1.225296   .0985893     2.53   0.012     1.046531    1.434598
Obese II..)  |   1.378839   .1571053     2.82   0.005     1.102878    1.723851
Obese II..)  |   1.763813    .255934     3.91   0.000     1.327214    2.344035
             |
1.hyperten~n |   1.114097   .0796332     1.51   0.131     .9684589    1.281637
1.cancer_e~r |   1.166197   .1042183     1.72   0.085     .9788215    1.389442
1.neuro_co~s |   1.746511   .1561949     6.24   0.000     1.465704    2.081117
1.flu_vacc~e |   .8720331   .0644829    -1.85   0.064     .7543806    1.008035
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3.st
> er saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12393.529
Iteration 1:   log likelihood = -12390.825
Iteration 2:   log likelihood = -12390.813
Iteration 3:   log likelihood = -12390.813
Refining estimates:
Iteration 0:   log likelihood = -12390.813

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,042
Time at risk    =     18846861
                                                LR chi2(1)       =        5.43
Log likelihood  =   -12390.813                  Prob > chi2      =      0.0198

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .812955   .0740712    -2.27   0.023     .6800025    .9719021
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_eth.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12393.529
Iteration 1:   log likelihood =  -12334.89
Iteration 2:   log likelihood = -12221.997
Iteration 3:   log likelihood = -12216.955
Iteration 4:   log likelihood = -12216.936
Iteration 5:   log likelihood = -12216.936
Refining estimates:
Iteration 0:   log likelihood = -12216.936

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,042
Time at risk    =     18846861
                                                LR chi2(5)       =      353.19
Log likelihood  =   -12216.936                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9536999   .0875032    -0.52   0.605     .7967332    1.141591
      1.male |   1.235073   .0815097     3.20   0.001     1.085218    1.405622
        age1 |    .999824    .008514    -0.02   0.984     .9832753    1.016651
        age2 |   1.014797   .0172329     0.86   0.387     .9815766    1.049141
        age3 |   1.134697   .0901764     1.59   0.112      .971032    1.325948
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_et
> h.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp population)                               

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8736.1012
Iteration 1:   log likelihood = -8611.2829
Iteration 2:   log likelihood = -8498.8872
Iteration 3:   log likelihood = -8494.8723
Iteration 4:   log likelihood = -8494.8602
Iteration 5:   log likelihood = -8494.8602
Refining estimates:
Iteration 0:   log likelihood = -8494.8602

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,042
Time at risk    =     18846861
                                                LR chi2(11)      =      482.48
Log likelihood  =   -8494.8602                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8871936   .0828041    -1.28   0.200     .7388794    1.065279
      1.male |   1.255043   .0832108     3.43   0.001     1.102104    1.429204
        age1 |   1.001542   .0086126     0.18   0.858     .9848032    1.018565
        age2 |   1.010004   .0172819     0.58   0.561     .9766935     1.04445
        age3 |   1.163076   .0933567     1.88   0.060     .9937675     1.36123
             |
   ethnicity |
South Asian  |   1.443555   .1772517     2.99   0.003     1.134791    1.836331
      Black  |   1.904535   .3543456     3.46   0.001     1.322573    2.742572
      Mixed  |   2.186611   .5972336     2.86   0.004     1.280209    3.734754
      Other  |   1.153414   .3550373     0.46   0.643     .6309182    2.108614
             |
  1.dmard_pc |   1.014216   .0680609     0.21   0.833     .8892194    1.156783
1.oral_pr~ne |    2.04639   .1381801    10.60   0.000     1.792718    2.335956
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_et
> h.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine, strata(stp population)     

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8736.1012
Iteration 1:   log likelihood = -8465.3072
Iteration 2:   log likelihood = -8435.7869
Iteration 3:   log likelihood = -8435.6823
Iteration 4:   log likelihood = -8435.6823
Refining estimates:
Iteration 0:   log likelihood = -8435.6823

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =        1,042
Time at risk    =     18846861
                                                LR chi2(24)      =      600.84
Log likelihood  =   -8435.6823                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8852747   .0828377    -1.30   0.193     .7369342    1.063475
      1.male |   1.223481   .0823413     3.00   0.003     1.072286    1.395995
        age1 |   .9977656   .0086417    -0.26   0.796     .9809712    1.014848
        age2 |   1.007436   .0175288     0.43   0.670     .9736594    1.042384
        age3 |   1.166441   .0953186     1.88   0.060     .9938135    1.369055
             |
   ethnicity |
South Asian  |   1.448455   .1784305     3.01   0.003     1.137753    1.844003
      Black  |   1.774837   .3310861     3.08   0.002     1.231322    2.558265
      Mixed  |   2.106288   .5761218     2.72   0.006     1.232234    3.600331
      Other  |    1.17286    .361377     0.52   0.605     .6411765    2.145434
             |
  1.dmard_pc |   1.076927   .0731701     1.09   0.275     .9426545    1.230324
1.oral_pr~ne |   1.914935   .1338986     9.29   0.000     1.669688    2.196205
    1.nsaids |    .975355   .0935351    -0.26   0.795     .8082276    1.177041
1.~c_disease |   1.283471    .097194     3.30   0.001     1.106437    1.488831
1.resp_exc~a |   1.119869   .0906764     1.40   0.162     .9555319    1.312471
             |
egfr_cat_n~s |
      30-59  |   1.105535   .0941961     1.18   0.239     .9355063    1.306467
        <30  |   2.305305   .3740365     5.15   0.000     1.677338    3.168372
             |
1.~r_disease |   1.089735   .2674742     0.35   0.726      .673588     1.76298
             |
   obese4cat |
Obese I ..)  |   1.225311   .0985735     2.53   0.012     1.046572    1.434576
Obese II..)  |   1.383949   .1577592     2.85   0.004     1.106853    1.730415
Obese II..)  |   1.777474   .2581329     3.96   0.000     1.337174    2.362754
             |
1.hyperten~n |   1.098546   .0785799     1.31   0.189     .9548416    1.263879
1.cancer_e~r |   1.180272   .1056031     1.85   0.064     .9904266    1.406508
1.neuro_co~s |   1.744715   .1560751     6.22   0.000      1.46413    2.079072
1.flu_vacc~e |   .8809108   .0651821    -1.71   0.087     .7619879    1.018394
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_et
> h.ster saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table6.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 6: Ethnicity adjustments") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. file write tablecontent ("Main Analysis, dropping individuals with missing et
> hnicity") _n                                       

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,547

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  903

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,449

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  139

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .812955   .0740712    -2.27   0.023     .6800025    .9719021
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9536999   .0875032    -0.52   0.605     .7967332    1.141591
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8959709   .0835906    -1.18   0.239     .7462427    1.075741
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8944076   .0836605    -1.19   0.233     .7445885    1.074372
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. file write tablecontent ("Main Analysis, adjusting for ethnicity") _n        
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,547

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  903

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,449

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  139

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .812955   .0740712    -2.27   0.023     .6800025    .9719021
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9536999   .0875032    -0.52   0.605     .7967332    1.141591
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8871936   .0828041    -1.28   0.200     .7388794    1.065279
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8852747   .0828377    -1.30   0.193     .7369342    1.063475
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\10_an_mod
> els_ethnicity.log
  log type:  text
 closed on:  19 Jul 2020, 18:39:18
-------------------------------------------------------------------------------
