-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\11_an_mod
> els_sep_pops.log
  log type:  text
 opened on:  17 Aug 2020, 10:30:08

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 0
(26,803 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   143,359      1,098 |   144,457 
           |     99.24       0.76 |    100.00 
-----------+----------------------+----------
       HCQ |    23,610        150 |    23,760 
           |     99.37       0.63 |    100.00 
-----------+----------------------+----------
     Total |   166,969      1,248 |   168,217 
           |     99.26       0.74 |    100.00 

. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -14996.975
Iteration 1:   log likelihood = -14994.311
Iteration 2:   log likelihood = -14994.299
Iteration 3:   log likelihood = -14994.299
Refining estimates:
Iteration 0:   log likelihood = -14994.299

Cox regression -- Breslow method for ties

No. of subjects =      168,217                  Number of obs    =     168,217
No. of failures =        1,248
Time at risk    =   25878489.5
                                                LR chi2(1)       =        5.35
Log likelihood  =   -14994.299                  Prob > chi2      =      0.0207

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8216424   .0715227    -2.26   0.024     .6927669    .9744927
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_ra.st
> er saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -14996.975
Iteration 1:   log likelihood = -14897.999
Iteration 2:   log likelihood = -14785.028
Iteration 3:   log likelihood = -14781.221
Iteration 4:   log likelihood = -14781.213
Iteration 5:   log likelihood = -14781.213
Refining estimates:
Iteration 0:   log likelihood = -14781.213

Cox regression -- Breslow method for ties

No. of subjects =      168,217                  Number of obs    =     168,217
No. of failures =        1,248
Time at risk    =   25878489.5
                                                LR chi2(5)       =      431.53
Log likelihood  =   -14781.213                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9419283   .0824471    -0.68   0.494     .7934363     1.11821
      1.male |   1.216124   .0725768     3.28   0.001      1.08188    1.367025
        age1 |   1.000226   .0082555     0.03   0.978     .9841752    1.016538
        age2 |   1.013873   .0162946     0.86   0.391     .9824339    1.046318
        age3 |   1.135917   .0841117     1.72   0.085     .9824659    1.313337
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_ra
> .ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp)                              

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11007.651
Iteration 1:   log likelihood = -10866.151
Iteration 2:   log likelihood = -10738.266
Iteration 3:   log likelihood = -10734.319
Iteration 4:   log likelihood = -10734.311
Iteration 5:   log likelihood = -10734.311
Refining estimates:
Iteration 0:   log likelihood = -10734.311

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      168,217                  Number of obs    =     168,217
No. of failures =        1,248
Time at risk    =   25878489.5
                                                LR chi2(7)       =      546.68
Log likelihood  =   -10734.311                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8957679   .0792462    -1.24   0.213     .7531681    1.065367
      1.male |   1.229914   .0734503     3.47   0.001      1.09406    1.382637
        age1 |   1.000874    .008295     0.11   0.916      .984748    1.017265
        age2 |   1.008867    .016283     0.55   0.584     .9774523    1.041291
        age3 |    1.16856   .0870797     2.09   0.037     1.009765    1.352326
  1.dmard_pc |   .9746305   .0579922    -0.43   0.666     .8673453    1.095186
1.oral_pr~ne |   1.864482   .1166291     9.96   0.000      1.64935    2.107674
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_ra
> .ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp)     

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11007.651
Iteration 1:   log likelihood = -10660.267
Iteration 2:   log likelihood = -10619.571
Iteration 3:   log likelihood = -10619.333
Iteration 4:   log likelihood = -10619.333
Refining estimates:
Iteration 0:   log likelihood = -10619.333

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      168,217                  Number of obs    =     168,217
No. of failures =        1,248
Time at risk    =   25878489.5
                                                LR chi2(29)      =      776.64
Log likelihood  =   -10619.333                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8992933   .0797569    -1.20   0.231     .7558049    1.070023
      1.male |   1.154466   .0709684     2.34   0.019     1.023423    1.302287
        age1 |   .9969844   .0083411    -0.36   0.718     .9807694    1.013468
        age2 |   1.001608   .0164949     0.10   0.922     .9697944    1.034464
        age3 |   1.201611    .091456     2.41   0.016      1.03509    1.394922
  1.dmard_pc |   1.058466   .0640478     0.94   0.348     .9400924    1.191744
1.oral_pr~ne |   1.731407   .1120589     8.48   0.000     1.525135    1.965577
    1.nsaids |   1.020075   .0877352     0.23   0.817     .8618295    1.207376
1.~c_disease |   1.247312   .0852277     3.23   0.001     1.090971    1.426058
1.resp_exc~a |   1.129775   .0840985     1.64   0.101      .976405    1.307236
             |
egfr_cat_n~s |
      30-59  |   1.107887    .083862     1.35   0.176     .9551316    1.285072
        <30  |   2.264709   .3316354     5.58   0.000     1.699674    3.017583
             |
1.~r_disease |   1.153939   .2611335     0.63   0.527     .7405568    1.798075
             |
   obese4cat |
Obese I ..)  |    1.13709   .0842349     1.73   0.083     .9834183    1.314774
Obese II..)  |   1.203851   .1288881     1.73   0.083     .9759785    1.484926
Obese II..)  |   1.372856   .1926209     2.26   0.024     1.042787      1.8074
             |
1.hyperten~n |   1.009974   .0660644     0.15   0.879     .8884464    1.148124
1.cancer_e~r |   1.122876   .0915742     1.42   0.155     .9570032    1.317498
1.neuro_co~s |   1.823706   .1459408     7.51   0.000     1.558971    2.133397
1.flu_vacc~e |   .8806503   .0602043    -1.86   0.063     .7702158    1.006919
             |
         imd |
          2  |    1.07783   .1032598     0.78   0.434       .89331    1.300464
          3  |   1.224031   .1159981     2.13   0.033     1.016544    1.473867
          4  |   1.209365   .1157938     1.99   0.047     1.002436    1.459008
5 most de..  |   1.470206   .1384468     4.09   0.000     1.222424    1.768212
             |
     diabcat |
Controlle..  |   1.286492   .1000722     3.24   0.001     1.104574    1.498371
Uncontrol..  |   1.559021   .1663372     4.16   0.000     1.264837    1.921629
Diabetes,..  |   1.694911   .2863885     3.12   0.002     1.217082    2.360338
             |
smoke_nomiss |
     Former  |   1.156343   .0737532     2.28   0.023      1.02046    1.310321
    Current  |   .6244749   .0754167    -3.90   0.000     .4928525    .7912487
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_ra
> .ster saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 1
(168,217 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    19,848        106 |    19,954 
           |     99.47       0.53 |    100.00 
-----------+----------------------+----------
       HCQ |     6,818         31 |     6,849 
           |     99.55       0.45 |    100.00 
-----------+----------------------+----------
     Total |    26,666        137 |    26,803 
           |     99.49       0.51 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1392.8701
Iteration 1:   log likelihood =  -1392.405
Iteration 2:   log likelihood =  -1392.404
Iteration 3:   log likelihood =  -1392.404
Refining estimates:
Iteration 0:   log likelihood =  -1392.404

Cox regression -- Breslow method for ties

No. of subjects =       26,803                  Number of obs    =      26,803
No. of failures =          137
Time at risk    =      4067229
                                                LR chi2(1)       =        0.93
Log likelihood  =    -1392.404                  Prob > chi2      =      0.3343

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8238585   .1682221    -0.95   0.343     .5521377      1.2293
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_sle.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1392.8701
Iteration 1:   log likelihood = -1388.7967
Iteration 2:   log likelihood = -1380.8685
Iteration 3:   log likelihood = -1380.4012
Iteration 4:   log likelihood = -1380.3982
Iteration 5:   log likelihood = -1380.3982
Refining estimates:
Iteration 0:   log likelihood = -1380.3982

Cox regression -- Breslow method for ties

No. of subjects =       26,803                  Number of obs    =      26,803
No. of failures =          137
Time at risk    =      4067229
                                                LR chi2(5)       =       24.94
Log likelihood  =   -1380.3982                  Prob > chi2      =      0.0001

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9316906   .1941631    -0.34   0.734     .6192734    1.401719
      1.male |   1.080085   .2339073     0.36   0.722     .7065103    1.651191
        age1 |   .9840852   .0153238    -1.03   0.303     .9545048    1.014582
        age2 |   1.037858   .0393416     0.98   0.327     .9635447    1.117903
        age3 |   1.018429   .2034917     0.09   0.927     .6884187    1.506638
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_sl
> e.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp)                          

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -775.43743
Iteration 1:   log likelihood = -757.73124
Iteration 2:   log likelihood = -750.55247
Iteration 3:   log likelihood =  -750.3614
Iteration 4:   log likelihood = -750.36083
Iteration 5:   log likelihood = -750.36083
Refining estimates:
Iteration 0:   log likelihood = -750.36083

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,745                  Number of obs    =      20,745
No. of failures =          115
Time at risk    =      3145679
                                                LR chi2(11)      =       50.15
Log likelihood  =   -750.36083                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8725411   .2029805    -0.59   0.558     .5530567    1.376582
      1.male |    1.21294   .2869869     0.82   0.415     .7628534    1.928578
        age1 |   .9877908   .0171342    -0.71   0.479     .9547728     1.02195
        age2 |   1.034069   .0435444     0.80   0.426     .9521509    1.123036
        age3 |   1.029728   .2307422     0.13   0.896     .6637199    1.597572
             |
   ethnicity |
South Asian  |   1.271798   .4437008     0.69   0.491     .6418798    2.519896
      Black  |   3.385881   1.061079     3.89   0.000     1.831974    6.257836
      Mixed  |   1.235096   .8945365     0.29   0.771     .2986795    5.107354
      Other  |   .9360078   .6788017    -0.09   0.927     .2259332    3.877741
             |
  1.dmard_pc |   .7043902   .2354693    -1.05   0.295     .3658194    1.356313
1.oral_pr~ne |   2.514019   .5183748     4.47   0.000     1.678249    3.766005
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_sl
> e.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp) 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -775.43743
Iteration 1:   log likelihood = -765.76174
Iteration 2:   log likelihood = -731.78949
Iteration 3:   log likelihood = -729.79473
Iteration 4:   log likelihood = -729.72977
Iteration 5:   log likelihood = -729.72956
Refining estimates:
Iteration 0:   log likelihood = -729.72956

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,745                  Number of obs    =      20,745
No. of failures =          115
Time at risk    =      3145679
                                                LR chi2(33)      =       91.42
Log likelihood  =   -729.72956                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8832433   .2071339    -0.53   0.597     .5577771    1.398621
      1.male |   1.189592   .2888262     0.72   0.475     .7391472    1.914542
        age1 |   .9774624   .0172513    -1.29   0.196     .9442286    1.011866
        age2 |   1.027203   .0445156     0.62   0.536     .9435572    1.118265
        age3 |   1.073916   .2486336     0.31   0.758     .6821813      1.6906
             |
   ethnicity |
South Asian  |   1.125383   .4079841     0.33   0.745     .5529875    2.290265
      Black  |   2.867613   .9414416     3.21   0.001     1.506849    5.457217
      Mixed  |    1.12777   .8201703     0.17   0.869     .2711342    4.690904
      Other  |   .9336267   .6788806    -0.09   0.925     .2245058    3.882567
             |
  1.dmard_pc |   .7309507   .2453696    -0.93   0.350     .3785751    1.411315
1.oral_pr~ne |   2.193679   .4754327     3.62   0.000     1.434477    3.354693
    1.nsaids |   1.052772   .3554964     0.15   0.879     .5431299    2.040634
1.~c_disease |   1.159835   .2979896     0.58   0.564     .7009741    1.919068
1.resp_exc~a |    1.49747   .3892938     1.55   0.120     .8996496    2.492545
             |
egfr_cat_n~s |
      30-59  |   1.183901   .3352142     0.60   0.551      .679678    2.062186
        <30  |   2.201325   .9967577     1.74   0.081     .9062769    5.346965
             |
1.~r_disease |   .6199886   .4462075    -0.66   0.507     .1512766    2.540948
             |
   obese4cat |
Obese I ..)  |   1.596649   .3773237     1.98   0.048     1.004735    2.537274
Obese II..)  |   1.605242   .5228104     1.45   0.146     .8478382     3.03926
Obese II..)  |   2.180315    .850161     2.00   0.046     1.015345    4.681927
             |
1.hyperten~n |   1.139004   .2574506     0.58   0.565     .7313533    1.773877
1.cancer_e~r |   1.717067   .4581261     2.03   0.043     1.017842    2.896637
1.neuro_co~s |   1.019681   .3336018     0.06   0.952     .5370106    1.936181
1.flu_vacc~e |   .7665466   .1669522    -1.22   0.222     .5002058    1.174704
             |
         imd |
          2  |   1.020646   .3136576     0.07   0.947     .5588431    1.864062
          3  |   1.155552   .3522907     0.47   0.635      .635749    2.100359
          4  |   .9035052    .289181    -0.32   0.751     .4824921    1.691886
5 most de..  |   1.006733   .3159258     0.02   0.983     .5442472    1.862225
             |
     diabcat |
Controlle..  |   1.531605   .4208511     1.55   0.121     .8938314    2.624449
Uncontrol..  |   2.374238   .8318569     2.47   0.014     1.194787    4.718001
Diabetes,..  |   2.673007   1.395446     1.88   0.060      .960792    7.436536
             |
smoke_nomiss |
     Former  |   1.189377   .2497628     0.83   0.409     .7880828    1.795012
    Current  |   .4759178   .1894754    -1.87   0.062     .2180953    1.038527
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_sl
> e.ster saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7a_sep.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7a: RA and SLE populations separately") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Rheumatoid arthritis (RA)") _n                     
>                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 0
  144,457

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 0
  1,098

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 0
  23,760

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 0
  150

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8216424   .0715227    -2.26   0.024     .6927669    .9744927
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9419283   .0824471    -0.68   0.494     .7934363     1.11821
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8957679   .0792462    -1.24   0.213     .7531681    1.065367
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8992933   .0797569    -1.20   0.231     .7558049    1.070023
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model  ==========================*/
. file write tablecontent ("Systemic lupus erythematosus (SLE)") _n            
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 1
  19,954

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 1
  106

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 1
  6,849

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 1
  31

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_sle 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8238585   .1682221    -0.95   0.343     .5521377      1.2293
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9316906   .1941631    -0.34   0.734     .6192734    1.401719
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8725411   .2029805    -0.59   0.558     .5530567    1.376582
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8832433   .2071339    -0.53   0.597     .5577771    1.398621
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* INDICATOR VARIABLE========================================================
> */ 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: SGSS
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   163,207      1,204 |   164,411 
           |     99.27       0.73 |    100.00 
-----------+----------------------+----------
       HCQ |    30,428        181 |    30,609 
           |     99.41       0.59 |    100.00 
-----------+----------------------+----------
     Total |   193,635      1,385 |   195,020 
           |     99.29       0.71 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16841.236
Iteration 2:   log likelihood = -16841.213
Iteration 3:   log likelihood = -16841.213
Refining estimates:
Iteration 0:   log likelihood = -16841.213

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(1)       =        8.62
Log likelihood  =   -16841.213                  Prob > chi2      =      0.0033

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7963854   .0634887    -2.86   0.004     .6811843    .9310692
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/univar_ind.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16845.524
Iteration 1:   log likelihood = -16748.837
Iteration 2:   log likelihood = -16616.054
Iteration 3:   log likelihood = -16611.085
Iteration 4:   log likelihood = -16611.071
Iteration 5:   log likelihood = -16611.071
Refining estimates:
Iteration 0:   log likelihood = -16611.071

Cox regression -- Breslow method for ties

No. of subjects =      195,020                  Number of obs    =     195,020
No. of failures =        1,385
Time at risk    =   29945718.5
                                                LR chi2(5)       =      468.91
Log likelihood  =   -16611.071                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9367614   .0752179    -0.81   0.416     .8003522     1.09642
      1.male |   1.213763   .0695371     3.38   0.001     1.084846       1.358
        age1 |   .9968206   .0071868    -0.44   0.659     .9828339    1.011006
        age2 |   1.019406   .0148317     1.32   0.186     .9907474    1.048895
        age3 |   1.111656   .0759168     1.55   0.121     .9723905    1.270868
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar1_in
> d.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone, strata(stp)                             

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -9419.1625
Iteration 1:   log likelihood = -9297.4476
Iteration 2:   log likelihood = -9182.5669
Iteration 3:   log likelihood = -9178.1446
Iteration 4:   log likelihood = -9178.1297
Iteration 5:   log likelihood = -9178.1297
Refining estimates:
Iteration 0:   log likelihood = -9178.1297

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,615                  Number of obs    =     149,615
No. of failures =        1,079
Time at risk    =     22969930
                                                LR chi2(12)      =      482.07
Log likelihood  =   -9178.1297                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8772964   .0804304    -1.43   0.153     .7330073    1.049988
             |
  population |
        SLE  |   .8851912   .0911968    -1.18   0.237     .7233393    1.083259
      1.male |   1.240252   .0809771     3.30   0.001     1.091275    1.409567
        age1 |   .9999551   .0082376    -0.01   0.996     .9839394    1.016232
        age2 |    1.01039   .0167342     0.62   0.533     .9781179    1.043726
        age3 |   1.163946   .0909971     1.94   0.052     .9985872    1.356687
             |
   ethnicity |
South Asian  |   1.541221    .180494     3.69   0.000     1.225123    1.938876
      Black  |   1.974115   .3562515     3.77   0.000        1.386     2.81178
      Mixed  |   2.102721   .5733246     2.73   0.006     1.232237    3.588136
      Other  |   1.226358   .3616266     0.69   0.489     .6880439     2.18584
             |
  1.dmard_pc |   1.017521   .0670029     0.26   0.792     .8943189    1.157695
1.oral_pr~ne |   1.993721    .132997    10.34   0.000     1.749373    2.272198
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar2_in
> d.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egf
> r_cat_nomiss i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever
>  i.neuro_conditions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp)
>     

         failure _d:  firstpos_sgss
   analysis time _t:  (stime_firstpos_sgss-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -9419.1625
Iteration 1:   log likelihood = -9388.7022
Iteration 2:   log likelihood = -9112.1716
Iteration 3:   log likelihood = -9085.0504
Iteration 4:   log likelihood = -9083.3441
Iteration 5:   log likelihood = -9083.3244
Iteration 6:   log likelihood = -9083.3244
Refining estimates:
Iteration 0:   log likelihood = -9083.3244

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,615                  Number of obs    =     149,615
No. of failures =        1,079
Time at risk    =     22969930
                                                LR chi2(34)      =      671.68
Log likelihood  =   -9083.3244                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8778728     .08075    -1.42   0.157     .7330522    1.051304
             |
  population |
        SLE  |   .8972396   .0928969    -1.05   0.295     .7324503    1.099104
      1.male |   1.177958   .0792312     2.44   0.015     1.032468    1.343949
        age1 |   .9954625   .0082876    -0.55   0.585     .9793509    1.011839
        age2 |   1.004157   .0169718     0.25   0.806     .9714374    1.037978
        age3 |   1.191339   .0950767     2.19   0.028     1.018835    1.393051
             |
   ethnicity |
South Asian  |   1.396965   .1707428     2.74   0.006     1.099381    1.775101
      Black  |     1.6822   .3074196     2.85   0.004     1.175769    2.406764
      Mixed  |   1.889474   .5164791     2.33   0.020      1.10578    3.228591
      Other  |    1.18968   .3516814     0.59   0.557     .6665096    2.123508
             |
  1.dmard_pc |   1.092204   .0729432     1.32   0.187        .9582    1.244949
1.oral_pr~ne |    1.85591   .1282435     8.95   0.000     1.620835    2.125078
    1.nsaids |    1.00197   .0935801     0.02   0.983     .8343648    1.203244
1.~c_disease |   1.217259   .0915112     2.62   0.009     1.050488    1.410505
1.resp_exc~a |   1.111416   .0901404     1.30   0.193     .9480706    1.302904
             |
egfr_cat_n~s |
      30-59  |   1.080203   .0906553     0.92   0.358     .9163658    1.273333
        <30  |   2.143088    .344797     4.74   0.000     1.563478    2.937569
             |
1.~r_disease |   1.016193   .2494118     0.07   0.948     .6281444    1.643966
             |
   obese4cat |
Obese I ..)  |   1.182993   .0931466     2.13   0.033     1.013818    1.380397
Obese II..)  |   1.228416   .1407642     1.80   0.073     .9813103    1.537746
Obese II..)  |   1.568807    .224064     3.15   0.002     1.185761    2.075591
             |
1.hyperten~n |   1.042059   .0739879     0.58   0.562     .9066834    1.197648
1.cancer_e~r |   1.199271   .1053502     2.07   0.039     1.009586    1.424595
1.neuro_co~s |   1.688689   .1498512     5.90   0.000     1.419109    2.009481
1.flu_vacc~e |   .8585012   .0625909    -2.09   0.036     .7441872     .990375
             |
         imd |
          2  |   1.097093   .1150536     0.88   0.377      .893258    1.347442
          3  |   1.228636   .1272303     1.99   0.047     1.002947    1.505112
          4  |   1.173702   .1227876     1.53   0.126     .9561126    1.440811
5 most de..  |   1.398569   .1438995     3.26   0.001     1.143151    1.711057
             |
     diabcat |
Controlle..  |   1.258786   .1066021     2.72   0.007     1.066269    1.486063
Uncontrol..  |   1.523992   .1763265     3.64   0.000     1.214782    1.911908
Diabetes,..  |   1.856084   .3238179     3.54   0.000     1.318544    2.612768
             |
smoke_nomiss |
     Former  |   1.189217   .0833772     2.47   0.013     1.036531    1.364393
    Current  |   .6039891   .0794771    -3.83   0.000     .4666832    .7816927
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens2/tempdata/multivar3_in
> d.ster saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7b_ind.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7b: RA and SLE populations as indicator varia
> ble") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Indicator in DAG and Fully Adjusted only") _n      
>                                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  164,411

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 
  1,204

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  30,609

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 
  181

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7963854   .0634887    -2.86   0.004     .6811843    .9310692
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9367614   .0752179    -0.81   0.416     .8003522     1.09642
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8772964   .0804304    -1.43   0.153     .7330073    1.049988
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8778728     .08075    -1.42   0.157     .7330522    1.051304
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n 

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens2/log\11_an_mod
> els_sep_pops.log
  log type:  text
 closed on:  17 Aug 2020, 10:31:03
-------------------------------------------------------------------------------
