-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\01_cr_create_po
> pulation.log
  log type:  text
 opened on:  21 Jul 2020, 21:54:00

. 
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. drop if inlist(sex,"I", "U")
(0 observations deleted)

. 
. noi di "DROP AGE <18:"
DROP AGE <18:

. drop if age < 18 
(0 observations deleted)

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. drop if age == . 
(0 observations deleted)

. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. drop if imd == .u
(0 observations deleted)

. 
. noi di "DROP IF DEAD BEFORE INDEX"
DROP IF DEAD BEFORE INDEX

. drop if stime_$outcome  <= date("$indexdate", "DMY")
(15 observations deleted)

. 
. noi di "DROP EXPOSURE TO CHLOROQUINE"
DROP EXPOSURE TO CHLOROQUINE

. drop if chloroquine_not_hcq == 1 
(0 observations deleted)

. 
. 
. 
. 
. /* CHECK INCLUSION AND EXCLUSION CRITERIA====================================
> =*/ 
. 
. * DATA STRUCTURE: Confirm one row per patient 
. duplicates tag patient_id, generate(dup_check)

Duplicates in terms of patient_id

. assert dup_check == 0 

. drop dup_check

. 
. * INCLUSION 1: RA or SLE in before exposure window, which begins 1 September 
> 2019 
. gen excl_ra = 1 if rheumatoid_date != . & rheumatoid_date >= mdy(9,1,2019)
(194,286 missing values generated)

. recode excl_ra .=0
(excl_ra: 194286 changes made)

. gen excl_sle = 1 if sle_date != . & sle_date >= mdy(9,1,2019)
(194,286 missing values generated)

. recode excl_sle .=0
(excl_sle: 194286 changes made)

. 
. datacheck excl_ra==0, nol

. datacheck excl_sle==0, nol

. datacheck population != ., nol

. 
. 
. * INCLUSION 2: >=18 and <=110 at 1 March 2020 
. assert age < .

. assert age >= 18 

. assert age <= 110

.  
.  
. * EXCLUSION 1: No chloroquine phosphate/sulfate exposure window
. gen chlor_check = 1 if chloroquine_not_hcq == 1 
(194,286 missing values generated)

. datacheck chlor_check >=., nol

. drop chlor_check

. 
. 
. * EXCLUSION 2: 12 months or baseline time 
. * [CANNOT BE QUANTIFIED AS VARIABLE NOT EXPORTED] 
. 
. 
. * EXCLUSION 3a: M or F gender at 1 March 2020 
. assert inlist(sex, "M", "F")

. 
. * EXCLUSION 3b:  MISSING IMD
. assert inlist(imd, 1, 2, 3, 4, 5)

. 
. 
. 
. 
. * Close log file 
. log close                                          
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\01_cr_create_po
> pulation.log
  log type:  text
 closed on:  21 Jul 2020, 21:54:02
-------------------------------------------------------------------------------
