-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\04_an_descripti
> ve_table.log
  log type:  text
 opened on:  15 Jul 2020, 09:36:25

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset, clear

. 
. /* PROGRAMS TO AUTOMATE TABULATIONS==========================================
> =*/ 
. 
. *****************************************************************************
> ***
. * All below code from K Baskharan 
. * Generic code to output one row of table
. 
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)
  4.         
.         qui sum `variable' if `variable' `condition'
  5.         file write tablecontent (r(max)) _tab
  6.         
.         cou if `variable' `condition'
  7.         local rowdenom = r(N)
  8.         local colpct = 100*(r(N)/`overalldenom')
  9.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
 10. 
.         cou if exposure == 0 
 11.         local rowdenom = r(N)
 12.         cou if exposure == 0 & `variable' `condition'
 13.         local pct = 100*(r(N)/`rowdenom') 
 14.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 15. 
.         cou if exposure == 1 
 16.         local rowdenom = r(N)
 17.         cou if exposure == 1 & `variable' `condition'
 18.         local pct = 100*(r(N)/`rowdenom')
 19.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f  (`pct') (")") 
> _tab
 20. 
.         cou if exposure >= .
 21.         local rowdenom = r(N)
 22.         cou if exposure >= . & `variable' `condition'
 23.         local pct = 100*(r(N)/`rowdenom')
 24.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> n
 25.         
. end

. 
. /* Explanatory Notes 
> 
> defines a program (SAS macro/R function equivalent), generate row
> the syntax row specifies two inputs for the program: 
> 
>         a VARNAME which is your variable 
>         a CONDITION which is a string of some condition you impose 
>         
> the program counts if variable and condition and returns the counts
> column percentages are then automatically generated
> this is then written to the text file 'tablecontent' 
> the number followed by space, brackets, formatted pct, end bracket and then t
> ab
> 
> the format %3.1f specifies length of 3, followed by 1 dp. 
> 
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to output one section (varible) within table (calls above)
. 
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) min(real) max(real) [missing]
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
.         forvalues varlevel = `min'/`max'{ 
  5.                 generaterow, variable(`variable') condition("==`varlevel'"
> )
  6.         }
  7.         
.         if "`missing'"!="" generaterow, variable(`variable') condition(">=.")
  8. 
. end

. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> 
> defines program tabulate variable 
> syntax is : 
> 
>         - a VARNAME which you stick in variable 
>         - a numeric minimum 
>         - a numeric maximum 
>         - optional missing option, default value is . 
> 
> forvalues lowest to highest of the variable, manually set for each var
> run the generate row program for the level of the variable 
> if there is a missing specified, then run the generate row for missing vals
> 
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to summarize a continous variable 
. 
. cap prog drop summarizevariable 

. prog define summarizevariable
  1. syntax, variable(varname) 
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4.         
.         qui summarize `variable', d
  5.         file write tablecontent ("Median (IQR)") _tab 
  6.         file write tablecontent (r(p50)) (" (") (r(p25)) ("-") (r(p75)) ("
> )") _tab
  7.                                                         
.         qui summarize `variable' if exposure == 0, d
  8.         file write tablecontent (r(p50)) (" (") (r(p25)) ("-") (r(p75)) ("
> )") _tab
  9. 
.         qui summarize `variable' if exposure == 1, d
 10.         file write tablecontent (r(p50)) (" (") (r(p25)) ("-") (r(p75)) ("
> )") _tab
 11.         
.         qui summarize `variable' if exposure >= ., d
 12.         file write tablecontent (r(p50)) (" (") (r(p25)) ("-") (r(p75)) ("
> )") _n
 13.         
.         qui summarize `variable', d
 14.         file write tablecontent ("Mean (SD)") _tab 
 15.         file write tablecontent (r(mean)) (" (") (r(sd)) (")") _tab
 16.                                                         
.         qui summarize `variable' if exposure == 0, d
 17.         file write tablecontent (r(mean)) (" (") (r(sd)) (")") _tab
 18. 
.         qui summarize `variable' if exposure == 1, d
 19.         file write tablecontent (r(mean)) (" (") (r(sd)) (")") _tab
 20.         
.         qui summarize `variable' if exposure >= ., d
 21.         file write tablecontent (r(mean)) (" (") (r(sd))  (")") _n
 22.         
.         
.         qui summarize `variable', d
 23.         file write tablecontent ("Min, Max") _tab 
 24.         file write tablecontent (r(min)) (", ") (r(max)) ("") _tab
 25.                                                         
.         qui summarize `variable' if exposure == 0, d
 26.         file write tablecontent (r(min)) (", ") (r(max)) ("") _tab
 27. 
.         qui summarize `variable' if exposure == 1, d
 28.         file write tablecontent (r(min)) (", ") (r(max)) ("") _tab
 29.         
.         qui summarize `variable' if exposure >= ., d
 30.         file write tablecontent (r(min)) (", ") (r(max)) ("") _n
 31.         
. end

. 
. 
. /* INVOKE PROGRAMS FOR TABLE 1===============================================
> =*/ 
. 
. *Set up output file
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table1.txt, write text replace

. 
. file write tablecontent ("Table 1: Demographic and Clinical Characteristics")
>  _n

. 
. * Exposure labelled columns
. 
. local lab0: label exposure 0

. local lab1: label exposure 1

. local labu: label exposure .u

. 
. 
. file write tablecontent _tab ("Total")                                       
>              _tab ///
>                                                          ("`lab0'")          
>                                          _tab ///
>                                                          ("`lab1'")          
>                                      _tab ///
>                                                          ("`labu'")          
>                                              _n 

. 
. * DEMOGRAPHICS (more than one level, potentially missing) 
. 
. gen byte cons=1

. tabulatevariable, variable(cons) min(1) max(1) 
  194,236
  194,236
  163,735
  163,735
  30,501
  30,501
  0
  0

. file write tablecontent _n 

. 
. /* POPULATION */
. tabulatevariable, variable(rheumatoid) min(0) max(1) 
  194,236
  25,623
  163,735
  19,219
  30,501
  6,404
  0
  0
  194,236
  168,613
  163,735
  144,516
  30,501
  24,097
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(sle) min(0) max(1) 
  194,236
  165,960
  163,735
  142,922
  30,501
  23,038
  0
  0
  194,236
  28,276
  163,735
  20,813
  30,501
  7,463
  0
  0

. file write tablecontent _n 

. 
. /* SOCIO-DEMOGRAPHICS */
. tabulatevariable, variable(agegroup) min(1) max(6) 
  194,236
  13,683
  163,735
  11,409
  30,501
  2,274
  0
  0
  194,236
  19,406
  163,735
  15,804
  30,501
  3,602
  0
  0
  194,236
  37,024
  163,735
  30,408
  30,501
  6,616
  0
  0
  194,236
  45,617
  163,735
  37,655
  30,501
  7,962
  0
  0
  194,236
  49,101
  163,735
  41,976
  30,501
  7,125
  0
  0
  194,236
  29,405
  163,735
  26,483
  30,501
  2,922
  0
  0

. file write tablecontent _n 

. 
. summarizevariable, variable(age)

. file write tablecontent _n 

. 
. tabulatevariable, variable(male) min(0) max(1) 
  194,236
  138,160
  163,735
  114,866
  30,501
  23,294
  0
  0
  194,236
  56,076
  163,735
  48,869
  30,501
  7,207
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(ethnicity) min(1) max(5) missing 
  194,236
  132,408
  163,735
  112,123
  30,501
  20,285
  0
  0
  194,236
  1,281
  163,735
  1,007
  30,501
  274
  0
  0
  194,236
  10,477
  163,735
  8,489
  30,501
  1,988
  0
  0
  194,236
  2,996
  163,735
  2,425
  30,501
  571
  0
  0
  194,236
  1,834
  163,735
  1,503
  30,501
  331
  0
  0
  194,236
  45,240
  163,735
  38,188
  30,501
  7,052
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(imd) min(1) max(5) missing
  194,236
  38,904
  163,735
  32,892
  30,501
  6,012
  0
  0
  194,236
  39,314
  163,735
  33,251
  30,501
  6,063
  0
  0
  194,236
  38,834
  163,735
  32,715
  30,501
  6,119
  0
  0
  194,236
  38,386
  163,735
  32,326
  30,501
  6,060
  0
  0
  194,236
  38,798
  163,735
  32,551
  30,501
  6,247
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(residence_type) min(1) max(8) missing 
  194,236
  34,679
  163,735
  29,435
  30,501
  5,244
  0
  0
  194,236
  11,686
  163,735
  9,872
  30,501
  1,814
  0
  0
  194,236
  101,669
  163,735
  85,677
  30,501
  15,992
  0
  0
  194,236
  826
  163,735
  689
  30,501
  137
  0
  0
  194,236
  25,078
  163,735
  21,053
  30,501
  4,025
  0
  0
  194,236
  1,257
  163,735
  1,036
  30,501
  221
  0
  0
  194,236
  17,451
  163,735
  14,621
  30,501
  2,830
  0
  0
  194,236
  1,578
  163,735
  1,341
  30,501
  237
  0
  0
  194,236
  12
  163,735
  11
  30,501
  1
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(urban) min(0) max(1) missing 
  194,236
  45,364
  163,735
  38,051
  30,501
  7,313
  0
  0
  194,236
  148,860
  163,735
  125,673
  30,501
  23,187
  0
  0
  194,236
  12
  163,735
  11
  30,501
  1
  0
  0

. file write tablecontent _n 

. 
. /* HEALTH BEHAVIOURS */
. tabulatevariable, variable(bmicat) min(1) max(6) missing
  194,236
  4,452
  163,735
  3,778
  30,501
  674
  0
  0
  194,236
  57,178
  163,735
  48,218
  30,501
  8,960
  0
  0
  194,236
  61,723
  163,735
  52,526
  30,501
  9,197
  0
  0
  194,236
  35,166
  163,735
  29,506
  30,501
  5,660
  0
  0
  194,236
  15,035
  163,735
  12,396
  30,501
  2,639
  0
  0
  194,236
  7,688
  163,735
  6,128
  30,501
  1,560
  0
  0
  194,236
  12,994
  163,735
  11,183
  30,501
  1,811
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(obese4cat) min(1) max(4) missing
  194,236
  136,347
  163,735
  115,705
  30,501
  20,642
  0
  0
  194,236
  35,166
  163,735
  29,506
  30,501
  5,660
  0
  0
  194,236
  15,035
  163,735
  12,396
  30,501
  2,639
  0
  0
  194,236
  7,688
  163,735
  6,128
  30,501
  1,560
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(smoke) min(1) max(3) missing 
  194,236
  74,031
  163,735
  62,578
  30,501
  11,453
  0
  0
  194,236
  92,237
  163,735
  77,580
  30,501
  14,657
  0
  0
  194,236
  27,358
  163,735
  23,033
  30,501
  4,325
  0
  0
  194,236
  610
  163,735
  544
  30,501
  66
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(smoke_nomiss) min(1) max(3) missing 
  194,236
  74,641
  163,735
  63,122
  30,501
  11,519
  0
  0
  194,236
  92,237
  163,735
  77,580
  30,501
  14,657
  0
  0
  194,236
  27,358
  163,735
  23,033
  30,501
  4,325
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. /* COMORBIDITY */
. tabulatevariable, variable(diabcat) min(1) max(4) missing
  194,236
  159,503
  163,735
  133,687
  30,501
  25,816
  0
  0
  194,236
  24,809
  163,735
  21,330
  30,501
  3,479
  0
  0
  194,236
  9,364
  163,735
  8,263
  30,501
  1,101
  0
  0
  194,236
  560
  163,735
  455
  30,501
  105
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(egfr_cat) min(1) max(3) missing 
  194,236
  127,180
  163,735
  104,171
  30,501
  23,009
  0
  0
  194,236
  23,804
  163,735
  20,506
  30,501
  3,298
  0
  0
  194,236
  1,885
  163,735
  1,646
  30,501
  239
  0
  0
  194,236
  41,367
  163,735
  37,412
  30,501
  3,955
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(egfr_cat_nomiss) min(1) max(3) missing 
  194,236
  168,547
  163,735
  141,583
  30,501
  26,964
  0
  0
  194,236
  23,804
  163,735
  20,506
  30,501
  3,298
  0
  0
  194,236
  1,885
  163,735
  1,646
  30,501
  239
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(chronic_cardiac_disease) min(0) max(1) missing 
  194,236
  163,696
  163,735
  137,499
  30,501
  26,197
  0
  0
  194,236
  30,540
  163,735
  26,236
  30,501
  4,304
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(chronic_liver_disease) min(0) max(1) missing 
  194,236
  191,527
  163,735
  161,515
  30,501
  30,012
  0
  0
  194,236
  2,709
  163,735
  2,220
  30,501
  489
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(resp_excl_asthma) min(0) max(1) missing 
  194,236
  167,619
  163,735
  141,634
  30,501
  25,985
  0
  0
  194,236
  26,617
  163,735
  22,101
  30,501
  4,516
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(neuro_conditions) min(0) max(1) missing 
  194,236
  181,550
  163,735
  152,762
  30,501
  28,788
  0
  0
  194,236
  12,686
  163,735
  10,973
  30,501
  1,713
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(hypertension) min(0) max(1) missing 
  194,236
  111,021
  163,735
  92,784
  30,501
  18,237
  0
  0
  194,236
  83,215
  163,735
  70,951
  30,501
  12,264
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(diabetes) min(0) max(1) missing 
  194,236
  159,503
  163,735
  133,687
  30,501
  25,816
  0
  0
  194,236
  34,733
  163,735
  30,048
  30,501
  4,685
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(cancer_ever) min(0) max(1) missing 
  194,236
  174,274
  163,735
  146,643
  30,501
  27,631
  0
  0
  194,236
  19,962
  163,735
  17,092
  30,501
  2,870
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(immunodef_any) min(0) max(1) missing 
  194,236
  191,272
  163,735
  161,340
  30,501
  29,932
  0
  0
  194,236
  2,964
  163,735
  2,395
  30,501
  569
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(flu_vaccine) min(0) max(1) missing 
  194,236
  72,231
  163,735
  62,866
  30,501
  9,365
  0
  0
  194,236
  122,005
  163,735
  100,869
  30,501
  21,136
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(pneumococcal_vaccine) min(0) max(1) missing 
  194,236
  161,241
  163,735
  137,482
  30,501
  23,759
  0
  0
  194,236
  32,995
  163,735
  26,253
  30,501
  6,742
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. tabulatevariable, variable(gp_consult) min(0) max(1) missing 
  194,236
  8,719
  163,735
  8,197
  30,501
  522
  0
  0
  194,236
  185,517
  163,735
  155,538
  30,501
  29,979
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. file write tablecontent _n 

. 
. summarizevariable, variable(gp_consult_count)

. file write tablecontent _n 

. 
. file write tablecontent _n _n

. 
. ** TREATMENT VARIABLES (binary)
. foreach treat of varlist        hcq                     ///
>                                                         dmard_pc             
>    ///
>                                                         azith                
>    ///
>                                                         oral_prednisolone ///
>                                                         nsaids               
>    ///
>                                                         hcq_sa               
>    ///
>                                                         dmard_pc_sa     ///
>                                                         /********************
> ************************************   TO DO: ADD BIOLOGICS WHEN AVAILABLE***
> ***/ ///
>                                                 {               
  2. 
. local lab: variable label `treat'
  3. file write tablecontent ("`lab'") _n 
  4.         
. generaterow, variable(`treat') condition("==0")
  5. generaterow, variable(`treat') condition("==1")
  6. generaterow, variable(`treat') condition("==.")
  7. 
. file write tablecontent _n
  8. 
. }
  194,236
  163,735
  163,735
  163,735
  30,501
  0
  0
  0
  194,236
  30,501
  163,735
  0
  30,501
  30,501
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0
  194,236
  122,894
  163,735
  108,097
  30,501
  14,797
  0
  0
  194,236
  71,342
  163,735
  55,638
  30,501
  15,704
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0
  194,236
  193,288
  163,735
  162,984
  30,501
  30,304
  0
  0
  194,236
  948
  163,735
  751
  30,501
  197
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0
  194,236
  160,643
  163,735
  137,008
  30,501
  23,635
  0
  0
  194,236
  33,593
  163,735
  26,727
  30,501
  6,866
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0
  194,236
  160,980
  163,735
  137,121
  30,501
  23,859
  0
  0
  194,236
  33,256
  163,735
  26,614
  30,501
  6,642
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0
  194,236
  163,608
  163,735
  162,263
  30,501
  1,345
  0
  0
  194,236
  30,628
  163,735
  1,472
  30,501
  29,156
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0
  194,236
  123,177
  163,735
  108,236
  30,501
  14,941
  0
  0
  194,236
  71,059
  163,735
  55,499
  30,501
  15,560
  0
  0
  194,236
  0
  163,735
  0
  30,501
  0
  0
  0

. 
. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\04_an_descripti
> ve_table.log
  log type:  text
 closed on:  15 Jul 2020, 09:36:33
-------------------------------------------------------------------------------
