-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\05_an_descripti
> ve_plots.log
  log type:  text
 opened on:  19 Jul 2020, 20:28:06

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   163,265        470 |   163,735 
       HCQ |    30,433         68 |    30,501 
-----------+----------------------+----------
     Total |   193,698        538 |   194,236 

. 
. /* Generate KM PLOT==========================================================
> =*/ 
. 
. count if exposure != .u
  194,236

. noi display "RUNNING THE KM PLOT FOR `r(N)' PEOPLE WITH NON-MISSING EXPOSURE"
RUNNING THE KM PLOT FOR 194236 PEOPLE WITH NON-MISSING EXPOSURE

. 
. sts graph, by(exposure) failure ci                                           
>                                    ///     
>                    title("Time to $tableoutcome", justification(left) size(me
> dsmall) )             ///
>                    xtitle("Days since 1 Mar 2020", size(small))              
>                            ///
>                    yscale(range(0, $ymax))                                   
>                                                    ///
>                    ylabel(0 (0.001) $ymax, angle(0) format(%4.3f) labsize(sma
> ll))       ///
>                    xscale(range(30, 84))                                     
>                                                    ///
>                    xlabel(0 (20) 160, labsize(small))                        
>                                    ///                             
>                    legend(size(vsmall) label (1 "No HCQ") label (2 "HCQ") reg
> ion(lwidth(none)) position(12))    ///
>                    graphregion(fcolor(white)) ///       
>                    risktable(,size(vsmall) order (1 "No HCQ" 2 "HCQ") title(,
> size(vsmall))) ///
>                    saving(kmplot1, replace)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
(note: file kmplot1.gph not found)
(file kmplot1.gph saved)
(file kmplot1.gph saved)

. 
. graph export "$Tabfigdir/kmplot1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/tabfig/kmplot1.svg written
>  in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase kmplot1.gph

. 
. 
. 
. 
. 
. 
. 
. /* DAG Adjusted curves ======================================================
> =*/ 
. stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone, df(4) scale(ha
> zard) eform /*strata(stp population) ******************** TO DO: HOW TO HANDL
> E STRATA ***/ 

Iteration 0:   log likelihood = -3539.5721  
Iteration 1:   log likelihood = -3536.5138  
Iteration 2:   log likelihood = -3528.4945  
Iteration 3:   log likelihood = -3527.8546  
Iteration 4:   log likelihood = -3527.8467  
Iteration 5:   log likelihood = -3527.8467  

Log likelihood = -3527.8467                     Number of obs     =    194,236

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
    exposure |    1.00318   .1317753     0.02   0.981     .7754732    1.297749
        male |    1.45161   .1295953     4.17   0.000     1.218589    1.729189
        age1 |   1.053352   .0380648     1.44   0.150     .9813271    1.130663
        age2 |   1.075009   .0566984     1.37   0.170      .969433    1.192083
        age3 |   .7484141   .1507221    -1.44   0.150     .5043356    1.110617
    dmard_pc |   .9234301   .0843976    -0.87   0.383     .7719831    1.104588
oral_pred~ne |   2.492322   .2211425    10.29   0.000     2.094486    2.965725
       _rcs1 |   2.810003   .2871639    10.11   0.000     2.299956    3.433159
       _rcs2 |    1.52962   .0947008     6.86   0.000     1.354829    1.726962
       _rcs3 |   .9849541   .0108854    -1.37   0.170     .9638485    1.006522
       _rcs4 |   1.002108   .0017595     1.20   0.230     .9986658    1.005563
       _cons |   .0000139   .0000254    -6.11   0.000     3.85e-07    .0005021
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    194,236    118.1076     12.6492          1        120

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range days 0 `tmax' `tmaxplus1'
(194,115 missing values generated)

. stpm2_standsurv if exposure == 1, at1(exposure 0) at2(exposure 1) timevar(day
> s) ci contrast(difference) fail

. 
. gen date = d(1/3/2020)+ days
(194,115 missing values generated)

. format date %tddd_Month

. 
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci: replace X=100*X

->  replace _at1=100*_at1
(120 real changes made)

->  replace _at2=100*_at2
(120 real changes made)

->  replace _at1_lci=100*_at1_lci
(119 real changes made)

->  replace _at1_uci=100*_at1_uci
(119 real changes made)

->  replace _at2_lci=100*_at2_lci
(119 real changes made)

->  replace _at2_uci=100*_at2_uci
(119 real changes made)

. 
. *l date days _at1 _at1_lci _at1_uci _at2 _at2_lci _at2_uci if days<.
. 
. twoway  (rarea _at1_lci _at1_uci days, color(red%25)) ///
>                  (rarea _at2_lci _at2_uci days if _at2_uci<1, color(blue%25))
>  ///
>                  (line _at1 days, sort lcolor(red)) ///
>                  (line _at2  days, sort lcolor(blue)) ///
>                  , legend(order(1 "No HCQ" 2 "HCQ") ring(0) cols(1) pos(11) r
> egion(lwidth(none))) ///
>                                  title("Time to $tableoutcome", justification
> (left) size(medsmall) )       ///
>                                  yscale(range(0, 1))                         
>                                                            ///
>                                  ylabel(0 (0.1) 1, angle(0) format(%4.1f) lab
> size(small))       ///
>                                  xlabel(0 (20) 160, labsize(small))          
>                                                    ///                     
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days since 1 Mar 2020", size(small))                
>    ///
>                                  graphregion(fcolor(white)) saving(adjcurv1, 
> replace)
(note: file adjcurv1.gph not found)
(file adjcurv1.gph saved)

. 
. graph export "$Tabfigdir/adjcurv1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/tabfig/adjcurv1.svg writte
> n in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adjcurv1.gph

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\05_an_descripti
> ve_plots.log
  log type:  text
 closed on:  19 Jul 2020, 20:28:56
-------------------------------------------------------------------------------
