-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\05_an_descripti
> ve_plots.log
  log type:  text
 opened on:   6 Oct 2020, 12:30:47

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   163,591        477 |   164,068 
       HCQ |    30,499         70 |    30,569 
-----------+----------------------+----------
     Total |   194,090        547 |   194,637 

. 
. /* Generate KM PLOT==========================================================
> =*/ 
. 
. count if exposure != .u
  194,637

. noi display "RUNNING THE KM PLOT FOR `r(N)' PEOPLE WITH NON-MISSING EXPOSURE"
RUNNING THE KM PLOT FOR 194637 PEOPLE WITH NON-MISSING EXPOSURE

. 
. sts graph, by(exposure) failure ci                                           
>                                    ///     
>                    title("Time to $tableoutcome", justification(left) size(me
> dsmall) )             ///
>                    xtitle("Days since 1 Mar 2020", size(small))              
>                            ///
>                    yscale(range(0, $ymax))                                   
>                                                    ///
>                    ylabel(0 (0.001) $ymax, angle(0) format(%4.3f) labsize(sma
> ll))       ///
>                    xscale(range(30, 84))                                     
>                                                    ///
>                    xlabel(0 (20) 160, labsize(small))                        
>                                    ///                             
>                    legend(size(vsmall) label (1 "No HCQ") label (2 "HCQ") reg
> ion(lwidth(none)) position(12))    ///
>                    graphregion(fcolor(white)) ///       
>                    risktable(,size(vsmall) order (1 "No HCQ" 2 "HCQ") title(,
> size(vsmall))) ///
>                    saving(kmplot1, replace)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
(note: file kmplot1.gph not found)
(file kmplot1.gph saved)
(file kmplot1.gph saved)

. 
. graph export "$Tabfigdir/kmplot1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/tabfig/kmplot1.svg written
>  in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase kmplot1.gph

. 
. 
. 
. 
. 
. 
. 
. /* DAG Adjusted curves ======================================================
> =*/ 
. //stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone, df(4) scale(
> hazard) eform /*strata(stp population) ******************** TO DO: HOW TO HAN
> DLE STRATA ***/       
. 
. *NOTE: this model will not run with stp and population as stratification vari
> ables
. *Moved population to an indicator variable, and will compare model estimates 
> from stcox
. stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone population, df(
> 4) scale(hazard) eform stratify(stp)

Iteration 0:   log likelihood = -3598.6639  
Iteration 1:   log likelihood =  -3592.151  
Iteration 2:   log likelihood = -3590.9153  
Iteration 3:   log likelihood = -3590.9042  
Iteration 4:   log likelihood = -3590.9042  

Log likelihood = -3590.9042                     Number of obs     =    194,637

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
    exposure |   1.033707   .1342879     0.26   0.799     .8013429    1.333448
        male |   1.446215   .1282083     4.16   0.000     1.215551    1.720651
        age1 |   1.052307   .0379845     1.41   0.158     .9804311    1.129452
        age2 |   1.076516   .0566201     1.40   0.161     .9710707    1.193411
        age3 |   .7445963   .1493789    -1.47   0.142     .5025221    1.103282
    dmard_pc |   .9083917   .0833869    -1.05   0.295     .7588152    1.087452
oral_pred~ne |   2.450511   .2159783    10.17   0.000     2.061746    2.912582
  population |   .7897923   .1356502    -1.37   0.169     .5640472    1.105886
       _rcs1 |   2.216147   .4224361     4.17   0.000     1.525263    3.219974
       _rcs2 |   1.319012   .1599035     2.28   0.022     1.040059    1.672783
       _rcs3 |   1.016495    .023586     0.71   0.481     .9713031    1.063791
       _rcs4 |   .9999498   .0038833    -0.01   0.990     .9923675     1.00759
   _rcs_stp1 |   1.016642   .0113149     1.48   0.138     .9947058    1.039063
   _rcs_stp2 |   1.012146    .007126     1.71   0.086     .9982756     1.02621
   _rcs_stp3 |    .997733   .0012947    -1.75   0.080     .9951986    1.000274
   _rcs_stp4 |   1.000082   .0001995     0.41   0.682      .999691    1.000473
       _cons |   .0000152   .0000278    -6.06   0.000     4.21e-07    .0005484
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    194,637     131.715    14.76647         .5        134

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range days 0 `tmax' `tmaxplus1'
(194,502 missing values generated)

. stpm2_standsurv if exposure == 1, at1(exposure 0) at2(exposure 1) timevar(day
> s) ci contrast(difference) fail

. 
. gen date = d(1/3/2020)+ days
(194,502 missing values generated)

. format date %tddd_Month

. 
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci _contrast2_1 _contrast2
> _1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(134 real changes made)

->  replace _at2=100*_at2
(134 real changes made)

->  replace _at1_lci=100*_at1_lci
(134 real changes made)

->  replace _at1_uci=100*_at1_uci
(134 real changes made)

->  replace _at2_lci=100*_at2_lci
(134 real changes made)

->  replace _at2_uci=100*_at2_uci
(134 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(134 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(134 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(134 real changes made)

. 
. *cumulative mortality at last day of follow-up
. list _at1* if days==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .22415231   .20297654   .24753727 |
  +-----------------------------------+

. list _at2* if days==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .23167599   .18347185   .29254496 |
  +-----------------------------------+

. list _contrast* if days==`tmax', noobs

  +------------------------------------+
  | _contra~1   _contr~lci   _cont~uci |
  |------------------------------------|
  | .00752368   -.05092969   .06597705 |
  +------------------------------------+

. 
. *l date days _at1 _at1_lci _at1_uci _at2 _at2_lci _at2_uci if days<.
. 
. twoway  (rarea _at1_lci _at1_uci days, color(red%25)) ///
>                  (rarea _at2_lci _at2_uci days if _at2_uci<1, color(blue%25))
>  ///
>                  (line _at1 days, sort lcolor(red)) ///
>                  (line _at2 days, sort lcolor(blue) lpattern(dash)) ///
>                  , legend(order(1 "No HCQ" 2 "HCQ") ring(0) cols(1) pos(11) r
> egion(lwidth(none))) ///
>                                  title("Time to $tableoutcome", justification
> (left) size(med) )            ///
>                                  yscale(range(0, 1))                         
>                                                            ///
>                                  ylabel(0 (0.1) 1, angle(0) format(%4.1f) lab
> size(small))       ///
>                                  xlabel(0 (20) 160, labsize(small))          
>                                                    ///                     
>                  ytitle("Cumulative mortality (%)", size(medsmall)) ///
>                  xtitle("Days since 1 Mar 2020", size(medsmall))             
>    ///
>                                  graphregion(fcolor(white)) saving(adjcurv1, 
> replace)
(note:  named style med not found in class gsize, default attributes used)
(note: file adjcurv1.gph not found)
(file adjcurv1.gph saved)

. 
. graph export "$Tabfigdir/adjcurv1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/tabfig/adjcurv1.svg writte
> n in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adjcurv1.gph

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\05_an_descripti
> ve_plots.log
  log type:  text
 closed on:   6 Oct 2020, 12:33:04
-------------------------------------------------------------------------------
