-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\07_an_models_in
> teract.log
  log type:  text
 opened on:  21 Jul 2020, 13:14:21

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* So few deaths occuring below 60 years this cannot be used as a category, s
> o combining 18-59 */ 
. gen agegroup2 = agegroup

. recode agegroup2(1 = 2)
(agegroup2: 13686 changes made)

. recode agegroup2(2 = 3)
(agegroup2: 33097 changes made)

. tab agegroup2, nolabel 

  agegroup2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     70,116       36.09       36.09
          4 |     45,635       23.49       59.58
          5 |     49,115       25.28       84.86
          6 |     29,420       15.14      100.00
------------+-----------------------------------
      Total |    194,286      100.00

. 
. label define agegroup2  3 "18-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup2 agegroup2

. tab agegroup agegroup2 , m

   Grouped |                  agegroup2
       age |    18-<60     60-<70     70-<80        80+ |     Total
-----------+--------------------------------------------+----------
    18-<40 |    13,686          0          0          0 |    13,686 
    40-<50 |    19,411          0          0          0 |    19,411 
    50-<60 |    37,019          0          0          0 |    37,019 
    60-<70 |         0     45,635          0          0 |    45,635 
    70-<80 |         0          0     49,115          0 |    49,115 
       80+ |         0          0          0     29,420 |    29,420 
-----------+--------------------------------------------+----------
     Total |    70,116     45,635     49,115     29,420 |   194,286 

. 
. 
. foreach intvar of varlist agegroup2 dmard_pc oral_prednisolone nsaids {
  2. /* Check Counts */ 
. 
. bysort `intvar': tab exposure $outcome, row
  3. 
. /* Univariable model */ 
. stcox i.exposure
  4. estimates store A
  5. 
. stcox i.exposure##i.`intvar'
  6. estimates store B
  7. estimates save $Tempdir/univar_int_`intvar', replace 
  8. 
. lrtest A B
  9. global univar_p_`intvar' = round(r(p),0.001)
 10. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. stcox i.exposure i.agegroup2 i.male
 11. estimates store A
 12. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male
 13. estimates store B
 14. estimates save $Tempdir/multivar1_int_`intvar', replace 
 15. 
. lrtest A B
 16. global multivar1_p_`intvar' = round(r(p),0.001)
 17. 
. * DAG Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone, strata(st
> p population)                                      
 18.                                                                           
>       
. estimates store A
 19. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e, strata(stp population)                  
 20. estimates store B
 21. estimates save $Tempdir/multivar2_int_`intvar', replace 
 22. 
. lrtest A B
 23. global multivar2_p_`intvar' = round(r(p),0.001)
 24. 
. * Fully Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone i.nsaids i
> .chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_liver
> _disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu_va
> ccine, strata(stp population)
 25. estimates store A
 26. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.c
> hronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditi
> ons i.flu_vaccine, strata(stp population)
 27. estimates store B
 28. estimates save $Tempdir/multivar3_int_`intvar', replace 
 29. 
. lrtest A B
 30. global multivar3_p_`intvar' = round(r(p),0.001)
 31. 
. }

-------------------------------------------------------------------------------
-> agegroup2 = 18-<60

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    57,605         18 |    57,623 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
       HCQ |    12,487          6 |    12,493 
           |     99.95       0.05 |    100.00 
-----------+----------------------+----------
     Total |    70,092         24 |    70,116 
           |     99.97       0.03 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 60-<70

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    37,629         40 |    37,669 
           |     99.89       0.11 |    100.00 
-----------+----------------------+----------
       HCQ |     7,957          9 |     7,966 
           |     99.89       0.11 |    100.00 
-----------+----------------------+----------
     Total |    45,586         49 |    45,635 
           |     99.89       0.11 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 70-<80

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    41,842        146 |    41,988 
           |     99.65       0.35 |    100.00 
-----------+----------------------+----------
       HCQ |     7,103         24 |     7,127 
           |     99.66       0.34 |    100.00 
-----------+----------------------+----------
     Total |    48,945        170 |    49,115 
           |     99.65       0.35 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 80+

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,228        266 |    26,494 
           |     99.00       1.00 |    100.00 
-----------+----------------------+----------
       HCQ |     2,897         29 |     2,926 
           |     99.01       0.99 |    100.00 
-----------+----------------------+----------
     Total |    29,125        295 |    29,420 
           |     99.00       1.00 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood = -6540.7035
Iteration 2:   log likelihood =  -6540.687
Iteration 3:   log likelihood =  -6540.687
Refining estimates:
Iteration 0:   log likelihood =  -6540.687

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(1)       =        4.50
Log likelihood  =    -6540.687                  Prob > chi2      =      0.0340

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7663221   .0994258    -2.05   0.040      .594255    .9882113
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood =  -6310.388
Iteration 2:   log likelihood = -6242.8825
Iteration 3:   log likelihood = -6219.8006
Iteration 4:   log likelihood = -6219.7279
Iteration 5:   log likelihood = -6219.7279
Refining estimates:
Iteration 0:   log likelihood = -6219.7279

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(7)       =      646.41
Log likelihood  =   -6219.7279                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.508274    .711007     0.87   0.383     .5987146    3.799622
             |
   agegroup2 |
     60-<70  |    3.37613   .9582236     4.29   0.000     1.935657    5.888569
     70-<80  |   11.05891   2.762623     9.62   0.000     6.777571    18.04475
        80+  |   32.29298   7.864849    14.27   0.000     20.03553    52.04937
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .6978861   .4177612    -0.60   0.548     .2158973    2.255911
 HCQ#70-<80  |   .6373812   .3316454    -0.87   0.387     .2298782    1.767261
    HCQ#80+  |   .6507586   .3321193    -0.84   0.400     .2393333    1.769443
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_agegrou
> p2.ster saved

Likelihood-ratio test                                 LR chi2(6)  =    641.92
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood =  -6303.053
Iteration 2:   log likelihood = -6235.8268
Iteration 3:   log likelihood = -6212.7823
Iteration 4:   log likelihood = -6212.7098
Iteration 5:   log likelihood = -6212.7097
Refining estimates:
Iteration 0:   log likelihood = -6212.7097

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(5)       =      660.45
Log likelihood  =   -6212.7097                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.019247   .1327464     0.15   0.884     .7896219    1.315648
             |
   agegroup2 |
     60-<70  |   3.076023   .7664798     4.51   0.000     1.887505    5.012922
     70-<80  |   9.863451   2.151888    10.49   0.000     6.431676    15.12633
        80+  |   29.21401   6.208446    15.88   0.000     19.26182    44.30831
             |
      1.male |   1.416219   .1260477     3.91   0.000     1.189518    1.686125
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood = -6302.9107
Iteration 2:   log likelihood = -6235.3378
Iteration 3:   log likelihood = -6212.3327
Iteration 4:   log likelihood = -6212.2603
Iteration 5:   log likelihood = -6212.2603
Refining estimates:
Iteration 0:   log likelihood = -6212.2603

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(8)       =      661.35
Log likelihood  =   -6212.2603                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.575452   .7429166     0.96   0.335     .6251935    3.970049
             |
   agegroup2 |
     60-<70  |   3.344675   .9493333     4.25   0.000     1.917581    5.833834
     70-<80  |   10.89515   2.722061     9.56   0.000     6.676787    17.77865
        80+  |   32.16553   7.833885    14.25   0.000     19.95636    51.84418
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .6785546   .4062241    -0.65   0.517     .2098958    2.193643
 HCQ#70-<80  |   .6154646   .3202976    -0.93   0.351     .2219342    1.706797
    HCQ#80+  |   .6221552   .3176149    -0.93   0.353     .2287463    1.692168
             |
      1.male |   1.418786   .1263315     3.93   0.000     1.191583    1.689311
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_ageg
> roup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.90
(Assumption: A nested in B)                           Prob > chi2 =    0.8257

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4392.2172
Iteration 2:   log likelihood = -4316.3925
Iteration 3:   log likelihood = -4299.6457
Iteration 4:   log likelihood =  -4299.599
Iteration 5:   log likelihood =  -4299.599
Refining estimates:
Iteration 0:   log likelihood =  -4299.599

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(7)       =      745.22
Log likelihood  =    -4299.599                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .981276   .1292696    -0.14   0.886     .7579789    1.270355
             |
   agegroup2 |
     60-<70  |   2.949682   .7365374     4.33   0.000      1.80813    4.811946
     70-<80  |   9.096575    1.99515    10.07   0.000     5.918124    13.98208
        80+  |   26.07436   5.581717    15.23   0.000     17.13948    39.66703
             |
      1.male |   1.420424   .1269214     3.93   0.000     1.192228    1.692298
  1.dmard_pc |    .886351   .0818805    -1.31   0.192     .7395581     1.06228
1.oral_pr~ne |   2.482324   .2211955    10.20   0.000     2.084535    2.956021
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4392.0156
Iteration 2:   log likelihood = -4315.9724
Iteration 3:   log likelihood = -4299.2027
Iteration 4:   log likelihood = -4299.1542
Iteration 5:   log likelihood = -4299.1542
Refining estimates:
Iteration 0:   log likelihood = -4299.1542

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(10)      =      746.11
Log likelihood  =   -4299.1542                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.500468   .7105244     0.86   0.391     .5931341    3.795776
             |
   agegroup2 |
     60-<70  |   3.185675   .9054175     4.08   0.000     1.825059    5.560655
     70-<80  |   10.01167   2.510424     9.19   0.000     6.124459     16.3661
        80+  |   28.66397   7.013471    13.71   0.000     17.74456    46.30282
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .7037654   .4217459    -0.59   0.558     .2174342    2.277865
 HCQ#70-<80  |   .6275099   .3271253    -0.89   0.371     .2258829    1.743243
    HCQ#80+  |   .6221926   .3183117    -0.93   0.354     .2282721    1.695886
             |
      1.male |   1.423036   .1272088     3.95   0.000     1.194331    1.695536
  1.dmard_pc |   .8845584    .081733    -1.33   0.184     .7380328    1.060174
1.oral_pr~ne |   2.480168   .2209659    10.20   0.000     2.082787    2.953366
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_ageg
> roup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.89
(Assumption: A nested in B)                           Prob > chi2 =    0.8279

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4651.3283
Iteration 2:   log likelihood = -4317.5425
Iteration 3:   log likelihood = -4247.5352
Iteration 4:   log likelihood = -4246.6076
Iteration 5:   log likelihood = -4246.6067
Refining estimates:
Iteration 0:   log likelihood = -4246.6067

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(20)      =      851.20
Log likelihood  =   -4246.6067                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9866893   .1301802    -0.10   0.919     .7618614    1.277865
             |
   agegroup2 |
     60-<70  |   2.580804   .6529356     3.75   0.000     1.571823    4.237468
     70-<80  |   6.989651   1.607094     8.46   0.000     4.453928    10.96902
        80+  |   17.48616   4.050745    12.35   0.000     11.10478    27.53462
             |
      1.male |   1.307799   .1189429     2.95   0.003     1.094272    1.562992
  1.dmard_pc |   .9809436   .0916779    -0.21   0.837     .8167548    1.178139
1.oral_pr~ne |   2.186608   .2022486     8.46   0.000     1.824062    2.621212
    1.nsaids |   .8331056   .1370389    -1.11   0.267     .6035101    1.150047
1.~c_disease |   1.497082   .1405466     4.30   0.000     1.245473     1.79952
1.resp_exc~a |   1.403646   .1380437     3.45   0.001     1.157564    1.702042
             |
egfr_cat_n~s |
      30-59  |   1.233545   .1246941     2.08   0.038     1.011836    1.503832
        <30  |   2.542859   .4994384     4.75   0.000     1.730371    3.736846
             |
1.~r_disease |   1.287308   .4125075     0.79   0.431     .6869451    2.412366
             |
   obese4cat |
Obese I ..)  |   1.063656   .1231849     0.53   0.594     .8476588    1.334692
Obese II..)  |   1.262319   .2153214     1.37   0.172      .903596    1.763452
Obese II..)  |   1.416799   .3562759     1.39   0.166     .8654871    2.319295
             |
1.hyperten~n |   1.089396   .1070109     0.87   0.383     .8986125    1.320684
1.cancer_e~r |   1.268089   .1378575     2.18   0.029     1.024739    1.569229
1.neuro_co~s |   1.757882   .1948617     5.09   0.000     1.414601    2.184468
1.flu_vacc~e |   .8308718   .0890119    -1.73   0.084     .6735102       1.025
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4651.2282
Iteration 2:   log likelihood = -4317.0765
Iteration 3:   log likelihood = -4247.1413
Iteration 4:   log likelihood = -4246.1806
Iteration 5:   log likelihood = -4246.1798
Refining estimates:
Iteration 0:   log likelihood = -4246.1798

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(23)      =      852.06
Log likelihood  =   -4246.1798                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.498743   .7102064     0.85   0.393     .5920661    3.793887
             |
   agegroup2 |
     60-<70  |   2.788641   .8010855     3.57   0.000     1.588072     4.89683
     70-<80  |   7.690131   2.002493     7.83   0.000      4.61618    12.81105
        80+  |   19.21075   5.004125    11.35   0.000     11.52971    32.00885
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |    .704292   .4221117    -0.58   0.559     .2175664    2.279888
 HCQ#70-<80  |   .6316979   .3294322    -0.88   0.378     .2273031    1.755551
    HCQ#80+  |   .6279474   .3214163    -0.91   0.363     .2302682    1.712429
             |
      1.male |   1.310275   .1192213     2.97   0.003     1.096256    1.566076
  1.dmard_pc |   .9790742   .0915203    -0.23   0.821     .8151703    1.175934
1.oral_pr~ne |   2.184846   .2020587     8.45   0.000     1.822637    2.619037
    1.nsaids |    .830958   .1367499    -1.13   0.260     .6018631    1.147256
1.~c_disease |   1.496589   .1404877     4.30   0.000     1.245084    1.798898
1.resp_exc~a |   1.404467   .1381156     3.45   0.001     1.158255    1.703016
             |
egfr_cat_n~s |
      30-59  |   1.233947   .1247277     2.08   0.038     1.012178    1.504306
        <30  |   2.540733   .4990529     4.75   0.000     1.728882    3.733814
             |
1.~r_disease |   1.287222   .4124762     0.79   0.431     .6869025    2.412191
             |
   obese4cat |
Obese I ..)  |   1.063341    .123147     0.53   0.596     .8474098    1.334293
Obese II..)  |   1.261834   .2152561     1.36   0.173     .9032245    1.762822
Obese II..)  |   1.414871   .3558359     1.38   0.168     .8642558    2.316283
             |
1.hyperten~n |   1.088717   .1069293     0.87   0.387     .8980765    1.319825
1.cancer_e~r |   1.267814   .1378262     2.18   0.029     1.024519    1.568885
1.neuro_co~s |   1.756336   .1946965     5.08   0.000     1.413346    2.182561
1.flu_vacc~e |   .8290714    .088751    -1.75   0.080     .6721588    1.022614
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_ageg
> roup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.85
(Assumption: A nested in B)                           Prob > chi2 =    0.8365

-------------------------------------------------------------------------------
-> dmard_pc = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   107,807        307 |   108,114 
           |     99.72       0.28 |    100.00 
-----------+----------------------+----------
       HCQ |    14,760         40 |    14,800 
           |     99.73       0.27 |    100.00 
-----------+----------------------+----------
     Total |   122,567        347 |   122,914 
           |     99.72       0.28 |    100.00 

-------------------------------------------------------------------------------
-> dmard_pc = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    55,497        163 |    55,660 
           |     99.71       0.29 |    100.00 
-----------+----------------------+----------
       HCQ |    15,684         28 |    15,712 
           |     99.82       0.18 |    100.00 
-----------+----------------------+----------
     Total |    71,181        191 |    71,372 
           |     99.73       0.27 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood = -6540.7035
Iteration 2:   log likelihood =  -6540.687
Iteration 3:   log likelihood =  -6540.687
Refining estimates:
Iteration 0:   log likelihood =  -6540.687

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(1)       =        4.50
Log likelihood  =    -6540.687                  Prob > chi2      =      0.0340

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7663221   .0994258    -2.05   0.040      .594255    .9882113
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood =  -6539.292
Iteration 2:   log likelihood = -6539.1869
Iteration 3:   log likelihood = -6539.1868
Refining estimates:
Iteration 0:   log likelihood = -6539.1868

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(3)       =        7.50
Log likelihood  =   -6539.1868                  Prob > chi2      =      0.0577

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9383489   .1577357    -0.38   0.705       .67496     1.30452
  1.dmard_pc |   1.025799   .0994142     0.26   0.793     .8483383    1.240382
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .6416707   .1698993    -1.68   0.094     .3818863    1.078178
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_dmard_p
> c.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      3.00
(Assumption: A nested in B)                           Prob > chi2 =    0.2231

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood =  -6303.053
Iteration 2:   log likelihood = -6235.8268
Iteration 3:   log likelihood = -6212.7823
Iteration 4:   log likelihood = -6212.7098
Iteration 5:   log likelihood = -6212.7097
Refining estimates:
Iteration 0:   log likelihood = -6212.7097

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(5)       =      660.45
Log likelihood  =   -6212.7097                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.019247   .1327464     0.15   0.884     .7896219    1.315648
             |
   agegroup2 |
     60-<70  |   3.076023   .7664798     4.51   0.000     1.887505    5.012922
     70-<80  |   9.863451   2.151888    10.49   0.000     6.431676    15.12633
        80+  |   29.21401   6.208446    15.88   0.000     19.26182    44.30831
             |
      1.male |   1.416219   .1260477     3.91   0.000     1.189518    1.686125
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood =  -6301.369
Iteration 2:   log likelihood = -6234.0908
Iteration 3:   log likelihood = -6211.0927
Iteration 4:   log likelihood = -6211.0204
Iteration 5:   log likelihood = -6211.0204
Refining estimates:
Iteration 0:   log likelihood = -6211.0204

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(7)       =      663.83
Log likelihood  =   -6211.0204                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.217725   .2051372     1.17   0.242     .8752985    1.694112
  1.dmard_pc |   .9454255   .0918931    -0.58   0.564     .7814345    1.143832
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .6903274   .1828119    -1.40   0.162     .4108096    1.160031
             |
   agegroup2 |
     60-<70  |   3.104187   .7739351     4.54   0.000     1.904261    5.060218
     70-<80  |   9.946422   2.172246    10.52   0.000     6.482895    15.26036
        80+  |   29.29506   6.227006    15.89   0.000     19.31353     44.4352
             |
      1.male |   1.425971   .1270928     3.98   0.000     1.197417    1.698149
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_dmar
> d_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      3.38
(Assumption: A nested in B)                           Prob > chi2 =    0.1846

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4392.2172
Iteration 2:   log likelihood = -4316.3925
Iteration 3:   log likelihood = -4299.6457
Iteration 4:   log likelihood =  -4299.599
Iteration 5:   log likelihood =  -4299.599
Refining estimates:
Iteration 0:   log likelihood =  -4299.599

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(7)       =      745.22
Log likelihood  =    -4299.599                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .981276   .1292696    -0.14   0.886     .7579789    1.270355
             |
   agegroup2 |
     60-<70  |   2.949682   .7365374     4.33   0.000      1.80813    4.811946
     70-<80  |   9.096575    1.99515    10.07   0.000     5.918124    13.98208
        80+  |   26.07436   5.581717    15.23   0.000     17.13948    39.66703
             |
      1.male |   1.420424   .1269214     3.93   0.000     1.192228    1.692298
  1.dmard_pc |    .886351   .0818805    -1.31   0.192     .7395581     1.06228
1.oral_pr~ne |   2.482324   .2211955    10.20   0.000     2.084535    2.956021
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4391.4834
Iteration 2:   log likelihood = -4315.6248
Iteration 3:   log likelihood = -4298.8921
Iteration 4:   log likelihood = -4298.8455
Iteration 5:   log likelihood = -4298.8454
Refining estimates:
Iteration 0:   log likelihood = -4298.8454

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(8)       =      746.73
Log likelihood  =   -4298.8454                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.129338   .1916395     0.72   0.474     .8098077    1.574947
  1.dmard_pc |   .9262338   .0912737    -0.78   0.437     .7635558    1.123571
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .7232589   .1919079    -1.22   0.222     .4299697    1.216605
             |
   agegroup2 |
     60-<70  |   2.946175   .7356764     4.33   0.000     1.805963    4.806272
     70-<80  |    9.06872   1.989222    10.05   0.000     5.899771    13.93981
        80+  |   26.00402   5.567008    15.22   0.000      17.0928    39.56106
             |
      1.male |   1.421599   .1270376     3.94   0.000     1.193196    1.693724
1.oral_pr~ne |   2.473246   .2205615    10.15   0.000     2.076625    2.945619
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_dmar
> d_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      1.51
(Assumption: A nested in B)                           Prob > chi2 =    0.2196

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4651.3283
Iteration 2:   log likelihood = -4317.5425
Iteration 3:   log likelihood = -4247.5352
Iteration 4:   log likelihood = -4246.6076
Iteration 5:   log likelihood = -4246.6067
Refining estimates:
Iteration 0:   log likelihood = -4246.6067

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(20)      =      851.20
Log likelihood  =   -4246.6067                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9866893   .1301802    -0.10   0.919     .7618614    1.277865
             |
   agegroup2 |
     60-<70  |   2.580804   .6529356     3.75   0.000     1.571823    4.237468
     70-<80  |   6.989651   1.607094     8.46   0.000     4.453928    10.96902
        80+  |   17.48616   4.050745    12.35   0.000     11.10478    27.53462
             |
      1.male |   1.307799   .1189429     2.95   0.003     1.094272    1.562992
  1.dmard_pc |   .9809436   .0916779    -0.21   0.837     .8167548    1.178139
1.oral_pr~ne |   2.186608   .2022486     8.46   0.000     1.824062    2.621212
    1.nsaids |   .8331056   .1370389    -1.11   0.267     .6035101    1.150047
1.~c_disease |   1.497082   .1405466     4.30   0.000     1.245473     1.79952
1.resp_exc~a |   1.403646   .1380437     3.45   0.001     1.157564    1.702042
             |
egfr_cat_n~s |
      30-59  |   1.233545   .1246941     2.08   0.038     1.011836    1.503832
        <30  |   2.542859   .4994384     4.75   0.000     1.730371    3.736846
             |
1.~r_disease |   1.287308   .4125075     0.79   0.431     .6869451    2.412366
             |
   obese4cat |
Obese I ..)  |   1.063656   .1231849     0.53   0.594     .8476588    1.334692
Obese II..)  |   1.262319   .2153214     1.37   0.172      .903596    1.763452
Obese II..)  |   1.416799   .3562759     1.39   0.166     .8654871    2.319295
             |
1.hyperten~n |   1.089396   .1070109     0.87   0.383     .8986125    1.320684
1.cancer_e~r |   1.268089   .1378575     2.18   0.029     1.024739    1.569229
1.neuro_co~s |   1.757882   .1948617     5.09   0.000     1.414601    2.184468
1.flu_vacc~e |   .8308718   .0890119    -1.73   0.084     .6735102       1.025
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4650.7332
Iteration 2:   log likelihood = -4316.6333
Iteration 3:   log likelihood = -4246.6537
Iteration 4:   log likelihood = -4245.7305
Iteration 5:   log likelihood = -4245.7296
Refining estimates:
Iteration 0:   log likelihood = -4245.7296

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(21)      =      852.96
Log likelihood  =   -4245.7296                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.149234   .1952329     0.82   0.413     .8237694    1.603287
  1.dmard_pc |   1.028989   .1024867     0.29   0.774     .8465091    1.250806
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .7049984   .1871264    -1.32   0.188     .4190398    1.186099
             |
   agegroup2 |
     60-<70  |   2.578435   .6523589     3.74   0.000     1.570353    4.233651
     70-<80  |    6.97248   1.603275     8.45   0.000     4.442825    10.94247
        80+  |    17.4513   4.043041    12.34   0.000     11.08218    27.48087
             |
      1.male |   1.308745   .1190532     2.96   0.003     1.095023     1.56418
1.oral_pr~ne |   2.178077   .2015424     8.41   0.000      1.81681     2.61118
    1.nsaids |   .8324179   .1369263    -1.12   0.265     .6030111    1.149099
1.~c_disease |   1.498107   .1406519     4.31   0.000     1.246311    1.800773
1.resp_exc~a |   1.404586   .1380914     3.46   0.001     1.158411    1.703076
             |
egfr_cat_n~s |
      30-59  |   1.232089    .124575     2.06   0.039     1.010597    1.502125
        <30  |   2.541609   .4991994     4.75   0.000     1.729512    3.735029
             |
1.~r_disease |   1.286322   .4122023     0.79   0.432     .6864074    2.410557
             |
   obese4cat |
Obese I ..)  |    1.06363   .1231839     0.53   0.594     .8476353    1.334665
Obese II..)  |   1.264024   .2156354     1.37   0.170     .9047842    1.765897
Obese II..)  |   1.418677   .3567594     1.39   0.164     .8666205    2.322405
             |
1.hyperten~n |   1.089203   .1069774     0.87   0.384     .8984776    1.320416
1.cancer_e~r |   1.268368   .1378897     2.19   0.029     1.024961    1.569578
1.neuro_co~s |   1.759617    .195037     5.10   0.000     1.416023    2.186582
1.flu_vacc~e |   .8281651   .0887541    -1.76   0.079      .671265    1.021739
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_dmar
> d_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      1.75
(Assumption: A nested in B)                           Prob > chi2 =    0.1853

-------------------------------------------------------------------------------
-> oral_prednisolone = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,752        290 |   137,042 
           |     99.79       0.21 |    100.00 
-----------+----------------------+----------
       HCQ |    23,606         37 |    23,643 
           |     99.84       0.16 |    100.00 
-----------+----------------------+----------
     Total |   160,358        327 |   160,685 
           |     99.80       0.20 |    100.00 

-------------------------------------------------------------------------------
-> oral_prednisolone = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,552        180 |    26,732 
           |     99.33       0.67 |    100.00 
-----------+----------------------+----------
       HCQ |     6,838         31 |     6,869 
           |     99.55       0.45 |    100.00 
-----------+----------------------+----------
     Total |    33,390        211 |    33,601 
           |     99.37       0.63 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood = -6540.7035
Iteration 2:   log likelihood =  -6540.687
Iteration 3:   log likelihood =  -6540.687
Refining estimates:
Iteration 0:   log likelihood =  -6540.687

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(1)       =        4.50
Log likelihood  =    -6540.687                  Prob > chi2      =      0.0340

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7663221   .0994258    -2.05   0.040      .594255    .9882113
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood = -6481.8424
Iteration 2:   log likelihood = -6465.5809
Iteration 3:   log likelihood = -6465.5464
Iteration 4:   log likelihood = -6465.5464
Refining estimates:
Iteration 0:   log likelihood = -6465.5464

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(3)       =      154.78
Log likelihood  =   -6465.5464                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7300099   .1274392    -1.80   0.071     .5184812    1.027838
1.oral_pr~ne |   3.215592   .3051232    12.31   0.000     2.669879    3.872847
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9022921   .2357883    -0.39   0.694     .5406421    1.505859
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_oral_pr
> ednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    150.28
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood =  -6303.053
Iteration 2:   log likelihood = -6235.8268
Iteration 3:   log likelihood = -6212.7823
Iteration 4:   log likelihood = -6212.7098
Iteration 5:   log likelihood = -6212.7097
Refining estimates:
Iteration 0:   log likelihood = -6212.7097

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(5)       =      660.45
Log likelihood  =   -6212.7097                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.019247   .1327464     0.15   0.884     .7896219    1.315648
             |
   agegroup2 |
     60-<70  |   3.076023   .7664798     4.51   0.000     1.887505    5.012922
     70-<80  |   9.863451   2.151888    10.49   0.000     6.431676    15.12633
        80+  |   29.21401   6.208446    15.88   0.000     19.26182    44.30831
             |
      1.male |   1.416219   .1260477     3.91   0.000     1.189518    1.686125
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood = -6273.0419
Iteration 2:   log likelihood =  -6188.954
Iteration 3:   log likelihood = -6165.1945
Iteration 4:   log likelihood = -6165.1182
Iteration 5:   log likelihood = -6165.1182
Refining estimates:
Iteration 0:   log likelihood = -6165.1182

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(7)       =      755.63
Log likelihood  =   -6165.1182                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9611143   .1681982    -0.23   0.821     .6820433    1.354372
1.oral_pr~ne |   2.481657   .2361284     9.55   0.000     2.059446    2.990427
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9761085   .2550982    -0.09   0.926     .5848485    1.629119
             |
   agegroup2 |
     60-<70  |   2.920014   .7279097     4.30   0.000      1.79141    4.759649
     70-<80  |   8.954637   1.956857    10.03   0.000      5.83492    13.74235
        80+  |   25.94057   5.526641    15.28   0.000     17.08563    39.38475
             |
      1.male |   1.407177   .1252515     3.84   0.000     1.181909     1.67538
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_oral
> _prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     95.18
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4392.2172
Iteration 2:   log likelihood = -4316.3925
Iteration 3:   log likelihood = -4299.6457
Iteration 4:   log likelihood =  -4299.599
Iteration 5:   log likelihood =  -4299.599
Refining estimates:
Iteration 0:   log likelihood =  -4299.599

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(7)       =      745.22
Log likelihood  =    -4299.599                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .981276   .1292696    -0.14   0.886     .7579789    1.270355
             |
   agegroup2 |
     60-<70  |   2.949682   .7365374     4.33   0.000      1.80813    4.811946
     70-<80  |   9.096575    1.99515    10.07   0.000     5.918124    13.98208
        80+  |   26.07436   5.581717    15.23   0.000     17.13948    39.66703
             |
      1.male |   1.420424   .1269214     3.93   0.000     1.192228    1.692298
  1.dmard_pc |    .886351   .0818805    -1.31   0.192     .7395581     1.06228
1.oral_pr~ne |   2.482324   .2211955    10.20   0.000     2.084535    2.956021
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4395.2353
Iteration 2:   log likelihood = -4316.6426
Iteration 3:   log likelihood = -4299.6403
Iteration 4:   log likelihood = -4299.5925
Iteration 5:   log likelihood = -4299.5925
Refining estimates:
Iteration 0:   log likelihood = -4299.5925

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(8)       =      745.23
Log likelihood  =   -4299.5925                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9945502   .1753042    -0.03   0.975     .7040279    1.404959
1.oral_pr~ne |   2.492136   .2381297     9.56   0.000     2.066509    3.005427
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9705973   .2540531    -0.11   0.909     .5810824    1.621214
             |
   agegroup2 |
     60-<70  |   2.949133   .7364142     4.33   0.000     1.807777    4.811095
     70-<80  |   9.095835      1.995    10.07   0.000     5.917627    13.98098
        80+  |    26.0733   5.581549    15.23   0.000     17.13871    39.66559
             |
      1.male |   1.420616   .1269501     3.93   0.000      1.19237    1.692553
  1.dmard_pc |   .8860547   .0818983    -1.31   0.191     .7392371    1.062031
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_oral
> _prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.01
(Assumption: A nested in B)                           Prob > chi2 =    0.9092

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4651.3283
Iteration 2:   log likelihood = -4317.5425
Iteration 3:   log likelihood = -4247.5352
Iteration 4:   log likelihood = -4246.6076
Iteration 5:   log likelihood = -4246.6067
Refining estimates:
Iteration 0:   log likelihood = -4246.6067

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(20)      =      851.20
Log likelihood  =   -4246.6067                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9866893   .1301802    -0.10   0.919     .7618614    1.277865
             |
   agegroup2 |
     60-<70  |   2.580804   .6529356     3.75   0.000     1.571823    4.237468
     70-<80  |   6.989651   1.607094     8.46   0.000     4.453928    10.96902
        80+  |   17.48616   4.050745    12.35   0.000     11.10478    27.53462
             |
      1.male |   1.307799   .1189429     2.95   0.003     1.094272    1.562992
  1.dmard_pc |   .9809436   .0916779    -0.21   0.837     .8167548    1.178139
1.oral_pr~ne |   2.186608   .2022486     8.46   0.000     1.824062    2.621212
    1.nsaids |   .8331056   .1370389    -1.11   0.267     .6035101    1.150047
1.~c_disease |   1.497082   .1405466     4.30   0.000     1.245473     1.79952
1.resp_exc~a |   1.403646   .1380437     3.45   0.001     1.157564    1.702042
             |
egfr_cat_n~s |
      30-59  |   1.233545   .1246941     2.08   0.038     1.011836    1.503832
        <30  |   2.542859   .4994384     4.75   0.000     1.730371    3.736846
             |
1.~r_disease |   1.287308   .4125075     0.79   0.431     .6869451    2.412366
             |
   obese4cat |
Obese I ..)  |   1.063656   .1231849     0.53   0.594     .8476588    1.334692
Obese II..)  |   1.262319   .2153214     1.37   0.172      .903596    1.763452
Obese II..)  |   1.416799   .3562759     1.39   0.166     .8654871    2.319295
             |
1.hyperten~n |   1.089396   .1070109     0.87   0.383     .8986125    1.320684
1.cancer_e~r |   1.268089   .1378575     2.18   0.029     1.024739    1.569229
1.neuro_co~s |   1.757882   .1948617     5.09   0.000     1.414601    2.184468
1.flu_vacc~e |   .8308718   .0890119    -1.73   0.084     .6735102       1.025
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4654.3855
Iteration 2:   log likelihood = -4317.9885
Iteration 3:   log likelihood = -4247.5294
Iteration 4:   log likelihood = -4246.6004
Iteration 5:   log likelihood = -4246.5996
Refining estimates:
Iteration 0:   log likelihood = -4246.5996

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(21)      =      851.22
Log likelihood  =   -4246.5996                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.000704   .1766154     0.00   0.997     .7080698    1.414279
1.oral_pr~ne |   2.195731   .2169332     7.96   0.000     1.809182    2.664869
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9691969   .2537043    -0.12   0.905     .5802232    1.618933
             |
   agegroup2 |
     60-<70  |   2.580434   .6528468     3.75   0.000     1.571591    4.236876
     70-<80  |   6.989477   1.607052     8.46   0.000     4.453819    10.96874
        80+  |   17.48688   4.050936    12.35   0.000     11.10521    27.53582
             |
      1.male |   1.308056   .1189854     2.95   0.003     1.094456    1.563345
  1.dmard_pc |   .9806084   .0916931    -0.21   0.834     .8163998    1.177846
    1.nsaids |   .8330094   .1370262    -1.11   0.267      .603436    1.149923
1.~c_disease |   1.497114   .1405497     4.30   0.000       1.2455    1.799559
1.resp_exc~a |   1.403476   .1380318     3.45   0.001     1.157416    1.701847
             |
egfr_cat_n~s |
      30-59  |   1.233638   .1247044     2.08   0.038     1.011912    1.503949
        <30  |   2.542564   .4993839     4.75   0.000     1.730166    3.736423
             |
1.~r_disease |   1.287293   .4125032     0.79   0.431     .6869359    2.412339
             |
   obese4cat |
Obese I ..)  |   1.063619   .1231801     0.53   0.594     .8476302    1.334645
Obese II..)  |   1.262216    .215306     1.37   0.172     .9035201    1.763315
Obese II..)  |   1.417053   .3563439     1.39   0.166      .865637    2.319724
             |
1.hyperten~n |   1.089384   .1070088     0.87   0.383     .8986043    1.320667
1.cancer_e~r |   1.268092    .137858     2.18   0.029     1.024741    1.569233
1.neuro_co~s |   1.757867   .1948586     5.09   0.000      1.41459    2.184445
1.flu_vacc~e |   .8307714   .0890045    -1.73   0.084     .6734235    1.024884
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_oral
> _prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.01
(Assumption: A nested in B)                           Prob > chi2 =    0.9048

-------------------------------------------------------------------------------
-> nsaids = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,712        436 |   137,148 
           |     99.68       0.32 |    100.00 
-----------+----------------------+----------
       HCQ |    23,807         60 |    23,867 
           |     99.75       0.25 |    100.00 
-----------+----------------------+----------
     Total |   160,519        496 |   161,015 
           |     99.69       0.31 |    100.00 

-------------------------------------------------------------------------------
-> nsaids = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,592         34 |    26,626 
           |     99.87       0.13 |    100.00 
-----------+----------------------+----------
       HCQ |     6,637          8 |     6,645 
           |     99.88       0.12 |    100.00 
-----------+----------------------+----------
     Total |    33,229         42 |    33,271 
           |     99.87       0.13 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood = -6540.7035
Iteration 2:   log likelihood =  -6540.687
Iteration 3:   log likelihood =  -6540.687
Refining estimates:
Iteration 0:   log likelihood =  -6540.687

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(1)       =        4.50
Log likelihood  =    -6540.687                  Prob > chi2      =      0.0340

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7663221   .0994258    -2.05   0.040      .594255    .9882113
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood = -6522.3707
Iteration 2:   log likelihood = -6521.2545
Iteration 3:   log likelihood = -6521.2458
Iteration 4:   log likelihood = -6521.2458
Refining estimates:
Iteration 0:   log likelihood = -6521.2458

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(3)       =       43.38
Log likelihood  =   -6521.2458                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7807489   .1075062    -1.80   0.072     .5960794     1.02263
    1.nsaids |   .4013615   .0714664    -5.13   0.000     .2831202    .5689847
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.189601   .4953257     0.42   0.677     .5259911    2.690447
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_nsaids.
> ster saved

Likelihood-ratio test                                 LR chi2(2)  =     38.88
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood =  -6303.053
Iteration 2:   log likelihood = -6235.8268
Iteration 3:   log likelihood = -6212.7823
Iteration 4:   log likelihood = -6212.7098
Iteration 5:   log likelihood = -6212.7097
Refining estimates:
Iteration 0:   log likelihood = -6212.7097

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(5)       =      660.45
Log likelihood  =   -6212.7097                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.019247   .1327464     0.15   0.884     .7896219    1.315648
             |
   agegroup2 |
     60-<70  |   3.076023   .7664798     4.51   0.000     1.887505    5.012922
     70-<80  |   9.863451   2.151888    10.49   0.000     6.431676    15.12633
        80+  |   29.21401   6.208446    15.88   0.000     19.26182    44.30831
             |
      1.male |   1.416219   .1260477     3.91   0.000     1.189518    1.686125
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood = -6300.8997
Iteration 2:   log likelihood = -6233.3966
Iteration 3:   log likelihood = -6210.4026
Iteration 4:   log likelihood = -6210.3305
Iteration 5:   log likelihood = -6210.3305
Refining estimates:
Iteration 0:   log likelihood = -6210.3305

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(7)       =      665.21
Log likelihood  =   -6210.3305                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.006479   .1389918     0.05   0.963     .7678147    1.319329
    1.nsaids |   .6946223    .124832    -2.03   0.043     .4884021    .9879156
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.204777   .5017067     0.45   0.655      .532647    2.725044
             |
   agegroup2 |
     60-<70  |   3.065891   .7640262     4.50   0.000     1.881202    4.996637
     70-<80  |   9.634776   2.104868    10.37   0.000     6.278896    14.78427
        80+  |   27.92829   5.962094    15.60   0.000     18.37939    42.43828
             |
      1.male |   1.415597   .1259956     3.90   0.000      1.18899    1.685393
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_nsai
> ds.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      4.76
(Assumption: A nested in B)                           Prob > chi2 =    0.0926

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4392.2172
Iteration 2:   log likelihood = -4316.3925
Iteration 3:   log likelihood = -4299.6457
Iteration 4:   log likelihood =  -4299.599
Iteration 5:   log likelihood =  -4299.599
Refining estimates:
Iteration 0:   log likelihood =  -4299.599

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(7)       =      745.22
Log likelihood  =    -4299.599                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .981276   .1292696    -0.14   0.886     .7579789    1.270355
             |
   agegroup2 |
     60-<70  |   2.949682   .7365374     4.33   0.000      1.80813    4.811946
     70-<80  |   9.096575    1.99515    10.07   0.000     5.918124    13.98208
        80+  |   26.07436   5.581717    15.23   0.000     17.13948    39.66703
             |
      1.male |   1.420424   .1269214     3.93   0.000     1.192228    1.692298
  1.dmard_pc |    .886351   .0818805    -1.31   0.192     .7395581     1.06228
1.oral_pr~ne |   2.482324   .2211955    10.20   0.000     2.084535    2.956021
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4390.5358
Iteration 2:   log likelihood = -4314.3674
Iteration 3:   log likelihood =  -4297.687
Iteration 4:   log likelihood = -4297.6406
Iteration 5:   log likelihood = -4297.6406
Refining estimates:
Iteration 0:   log likelihood = -4297.6406

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(9)       =      749.14
Log likelihood  =   -4297.6406                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9657415   .1347665    -0.25   0.803     .7346461    1.269532
    1.nsaids |   .7145408   .1288635    -1.86   0.062     .5017848    1.017505
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.224952   .5103801     0.49   0.626     .5413317    2.771883
             |
   agegroup2 |
     60-<70  |   2.929487   .7317011     4.30   0.000     1.795503    4.779661
     70-<80  |   8.862173   1.948274     9.92   0.000     5.759844    13.63546
        80+  |   24.91575   5.366117    14.93   0.000     16.33617    38.00123
             |
      1.male |   1.419741   .1268649     3.92   0.000     1.191647    1.691494
  1.dmard_pc |   .8926814   .0825317    -1.23   0.219     .7447316    1.070023
1.oral_pr~ne |   2.481693   .2211795    10.20   0.000      2.08394    2.955364
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_nsai
> ds.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      3.92
(Assumption: A nested in B)                           Prob > chi2 =    0.1411

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood = -4651.3283
Iteration 2:   log likelihood = -4317.5425
Iteration 3:   log likelihood = -4247.5352
Iteration 4:   log likelihood = -4246.6076
Iteration 5:   log likelihood = -4246.6067
Refining estimates:
Iteration 0:   log likelihood = -4246.6067

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(20)      =      851.20
Log likelihood  =   -4246.6067                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9866893   .1301802    -0.10   0.919     .7618614    1.277865
             |
   agegroup2 |
     60-<70  |   2.580804   .6529356     3.75   0.000     1.571823    4.237468
     70-<80  |   6.989651   1.607094     8.46   0.000     4.453928    10.96902
        80+  |   17.48616   4.050745    12.35   0.000     11.10478    27.53462
             |
      1.male |   1.307799   .1189429     2.95   0.003     1.094272    1.562992
  1.dmard_pc |   .9809436   .0916779    -0.21   0.837     .8167548    1.178139
1.oral_pr~ne |   2.186608   .2022486     8.46   0.000     1.824062    2.621212
    1.nsaids |   .8331056   .1370389    -1.11   0.267     .6035101    1.150047
1.~c_disease |   1.497082   .1405466     4.30   0.000     1.245473     1.79952
1.resp_exc~a |   1.403646   .1380437     3.45   0.001     1.157564    1.702042
             |
egfr_cat_n~s |
      30-59  |   1.233545   .1246941     2.08   0.038     1.011836    1.503832
        <30  |   2.542859   .4994384     4.75   0.000     1.730371    3.736846
             |
1.~r_disease |   1.287308   .4125075     0.79   0.431     .6869451    2.412366
             |
   obese4cat |
Obese I ..)  |   1.063656   .1231849     0.53   0.594     .8476588    1.334692
Obese II..)  |   1.262319   .2153214     1.37   0.172      .903596    1.763452
Obese II..)  |   1.416799   .3562759     1.39   0.166     .8654871    2.319295
             |
1.hyperten~n |   1.089396   .1070109     0.87   0.383     .8986125    1.320684
1.cancer_e~r |   1.268089   .1378575     2.18   0.029     1.024739    1.569229
1.neuro_co~s |   1.757882   .1948617     5.09   0.000     1.414601    2.184468
1.flu_vacc~e |   .8308718   .0890119    -1.73   0.084     .6735102       1.025
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.2087
Iteration 1:   log likelihood =  -4651.228
Iteration 2:   log likelihood = -4317.4366
Iteration 3:   log likelihood = -4247.4406
Iteration 4:   log likelihood = -4246.5125
Iteration 5:   log likelihood = -4246.5117
Refining estimates:
Iteration 0:   log likelihood = -4246.5117

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(21)      =      851.39
Log likelihood  =   -4246.5117                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9679621   .1352445    -0.23   0.816     .7360847    1.272884
    1.nsaids |   .8070802   .1463833    -1.18   0.237     .5656281    1.151602
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.202562   .5011077     0.44   0.658     .5313878    2.721468
             |
   agegroup2 |
     60-<70  |   2.583697   .6537065     3.75   0.000     1.573539    4.242344
     70-<80  |   6.999698   1.609684     8.46   0.000      4.45998    10.98565
        80+  |   17.50736   4.056619    12.35   0.000     11.11705    27.57097
             |
      1.male |   1.308363   .1190016     2.96   0.003     1.094731    1.563683
  1.dmard_pc |   .9810316   .0916942    -0.20   0.838     .8168149    1.178263
1.oral_pr~ne |   2.187214   .2023063     8.46   0.000     1.824565    2.621942
1.~c_disease |   1.497062   .1405415     4.30   0.000     1.245462    1.799489
1.resp_exc~a |   1.403541   .1380307     3.45   0.001     1.157481    1.701908
             |
egfr_cat_n~s |
      30-59  |   1.233592   .1246962     2.08   0.038      1.01188    1.503884
        <30  |   2.541661   .4992091     4.75   0.000     1.729548    3.735103
             |
1.~r_disease |   1.287107   .4124463     0.79   0.431     .6868344    2.412001
             |
   obese4cat |
Obese I ..)  |   1.063253   .1231412     0.53   0.596     .8473329    1.334193
Obese II..)  |   1.262948   .2154338     1.37   0.171     .9040392    1.764345
Obese II..)  |   1.416449   .3561956     1.38   0.166     .8652642    2.318747
             |
1.hyperten~n |   1.089343   .1070096     0.87   0.384     .8985625    1.320629
1.cancer_e~r |   1.267912   .1378371     2.18   0.029     1.024598    1.569007
1.neuro_co~s |   1.757778   .1948533     5.09   0.000     1.414512    2.184346
1.flu_vacc~e |   .8310805   .0890313    -1.73   0.084     .6736841     1.02525
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_nsai
> ds.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.19
(Assumption: A nested in B)                           Prob > chi2 =    0.6628

. 
. 
. 
. 
. 
. 
. /* Print interaction table===================================================
> =*/ 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table3.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 3: Interactions with HCQ use on risk of $tabl
> eoutcome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab _tab ("Age/
> Sex Adjusted") _tab _tab _tab  ///
>                                                 ("DAG Adjusted") _tab _tab _t
> ab ("Fully Adjusted") _tab _tab _tab _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("p (interactio
> n)") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("p (interact
> ion)") _tab ("HR") _tab ("95% CI") _tab ("p (interaction)") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab (
> "p (interaction)") _tab _n

. 
.                                                 
. * Generic program to print model for a level of another variable 
. cap prog drop printinteraction

. prog define printinteraction 
  1. syntax, variable(varname) min(real) max(real) 
  2. 
. * Overall p-values 
. 
. file write tablecontent ("`variable'") _tab _tab _tab _tab ("${univar_p_`vari
> able'}") ///
>                                                 _tab _tab _tab ("${multivar1_
> p_`variable'}") /// 
>                                                 _tab _tab _tab ("${multivar2_
> p_`variable'}") ///
>                                                 _tab _tab _tab ("${multivar3_
> p_`variable'}") _n
  3.         forvalues varlevel = `min'/`max'{ 
  4. 
.                 * Row headings 
.                                                         
.                 file write tablecontent ("`varlevel'") _n       
  5. 
.                 local lab0: label exposure 0
  6.                 local lab1: label exposure 1
  7.                  
.                 /* Counts */
.                         
.                 * First row, exposure = 0 (reference)
.                 
.         file write tablecontent ("`lab0'") _tab
  8. 
.                         cou if exposure == 0 & `variable' == `varlevel'
  9.                         local rowdenom = r(N)
 10.                         cou if exposure == 0  & `variable' == `varlevel' &
>  $outcome == 1
 11.                         local pct = 100*(r(N)/`rowdenom')
 12.                         
.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 13.                 file write tablecontent ("1.00 (ref)") _tab _tab _tab ("1.
> 00 (ref)") _tab _tab _tab ("1.00 (ref)") _tab _tab _tab ("1.00 (ref)") _n
 14.                         
.                 * Second row, exposure = 1 (comparator)
. 
.                 file write tablecontent ("`lab1'") _tab  
 15. 
.                         cou if exposure == 1 & `variable' == `varlevel'
 16.                         local rowdenom = r(N)
 17.                         cou if exposure == 1 & `variable' == `varlevel' & 
> $outcome == 1
 18.                         local pct = 100*(r(N)/`rowdenom')
 19.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 20. 
.                 * Print models 
.                 estimates use $Tempdir/univar_int_`variable' 
 21.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 22.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 23. 
.                 estimates use $Tempdir/multivar1_int_`variable'
 24.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 25.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 26. 
.                 estimates use $Tempdir/multivar2_int_`variable'
 27.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 28.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab 
 29.         
.                 estimates use $Tempdir/multivar3_int_`variable'
 30.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 31.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _n
 32.         } 
 33.                 
. end

. 
. printinteraction, variable(agegroup2) min(3) max(6) 
  57,623
  18
  12,493
  6
  37,669
  40
  7,966
  9
  41,988
  146
  7,127
  24
  26,494
  266
  2,926
  29

. file write tablecontent _n _n

. 
. printinteraction, variable(dmard_pc) min(0) max(1) 
  108,114
  307
  14,800
  40
  55,660
  163
  15,712
  28

. file write tablecontent _n _n

.   
. printinteraction, variable(oral_prednisolone) min(0) max(1) 
  137,042
  290
  23,643
  37
  26,732
  180
  6,869
  31

. file write tablecontent _n _n

. 
. printinteraction, variable(nsaids) min(0) max(1) 
  137,148
  436
  23,867
  60
  26,626
  34
  6,645
  8

. 
. 
. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\07_an_models_in
> teract.log
  log type:  text
 closed on:  21 Jul 2020, 13:18:46
-------------------------------------------------------------------------------
