-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\07_an_models_in
> teract.log
  log type:  text
 opened on:   6 Oct 2020, 12:44:26

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* So few deaths occuring below 60 years this cannot be used as a category, s
> o combining 18-59 */ 
. gen agegroup2 = agegroup

. recode agegroup2(1 = 2)
(agegroup2: 13709 changes made)

. recode agegroup2(2 = 3)
(agegroup2: 33147 changes made)

. tab agegroup2, nolabel 

  agegroup2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     70,233       36.08       36.08
          4 |     45,699       23.48       59.56
          5 |     49,238       25.30       84.86
          6 |     29,467       15.14      100.00
------------+-----------------------------------
      Total |    194,637      100.00

. 
. label define agegroup2  3 "18-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup2 agegroup2

. tab agegroup agegroup2 , m

   Grouped |                  agegroup2
       age |    18-<60     60-<70     70-<80        80+ |     Total
-----------+--------------------------------------------+----------
    18-<40 |    13,709          0          0          0 |    13,709 
    40-<50 |    19,438          0          0          0 |    19,438 
    50-<60 |    37,086          0          0          0 |    37,086 
    60-<70 |         0     45,699          0          0 |    45,699 
    70-<80 |         0          0     49,238          0 |    49,238 
       80+ |         0          0          0     29,467 |    29,467 
-----------+--------------------------------------------+----------
     Total |    70,233     45,699     49,238     29,467 |   194,637 

. 
. 
. foreach intvar of varlist agegroup2 dmard_pc oral_prednisolone nsaids {
  2. /* Check Counts */ 
. 
. bysort `intvar': tab exposure $outcome, row
  3. 
. /* Univariable model */ 
. stcox i.exposure
  4. estimates store A
  5. 
. stcox i.exposure##i.`intvar'
  6. estimates store B
  7. estimates save $Tempdir/univar_int_`intvar', replace 
  8. 
. lrtest A B
  9. global univar_p_`intvar' = round(r(p),0.001)
 10. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. stcox i.exposure i.agegroup2 i.male
 11. estimates store A
 12. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male
 13. estimates store B
 14. estimates save $Tempdir/multivar1_int_`intvar', replace 
 15. 
. cap noi lrtest A B
 16. global multivar1_p_`intvar' = round(r(p),0.001)
 17. 
. * DAG Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone, strata(st
> p population)                                      
 18.                                                                           
>       
. estimates store A
 19. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e, strata(stp population)                  
 20. estimates store B
 21. estimates save $Tempdir/multivar2_int_`intvar', replace 
 22. 
. cap noi lrtest A B
 23. global multivar2_p_`intvar' = round(r(p),0.001)
 24. 
. * Fully Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone i.nsaids i
> .chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_liver
> _disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu_va
> ccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)
 25. estimates store A
 26. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.c
> hronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditi
> ons i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)
 27. estimates store B
 28. estimates save $Tempdir/multivar3_int_`intvar', replace 
 29. 
. cap noi lrtest A B
 30. global multivar3_p_`intvar' = round(r(p),0.001)
 31. 
. }

-------------------------------------------------------------------------------
-> agegroup2 = 18-<60

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    57,701         18 |    57,719 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
       HCQ |    12,508          6 |    12,514 
           |     99.95       0.05 |    100.00 
-----------+----------------------+----------
     Total |    70,209         24 |    70,233 
           |     99.97       0.03 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 60-<70

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    37,686         40 |    37,726 
           |     99.89       0.11 |    100.00 
-----------+----------------------+----------
       HCQ |     7,963         10 |     7,973 
           |     99.87       0.13 |    100.00 
-----------+----------------------+----------
     Total |    45,649         50 |    45,699 
           |     99.89       0.11 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 70-<80

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    41,942        148 |    42,090 
           |     99.65       0.35 |    100.00 
-----------+----------------------+----------
       HCQ |     7,123         25 |     7,148 
           |     99.65       0.35 |    100.00 
-----------+----------------------+----------
     Total |    49,065        173 |    49,238 
           |     99.65       0.35 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 80+

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,262        271 |    26,533 
           |     98.98       1.02 |    100.00 
-----------+----------------------+----------
       HCQ |     2,905         29 |     2,934 
           |     99.01       0.99 |    100.00 
-----------+----------------------+----------
     Total |    29,167        300 |    29,467 
           |     98.98       1.02 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6651.1941
Iteration 2:   log likelihood = -6651.1805
Iteration 3:   log likelihood = -6651.1805
Refining estimates:
Iteration 0:   log likelihood = -6651.1805

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(1)       =        4.13
Log likelihood  =   -6651.1805                  Prob > chi2      =      0.0421

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7771215    .099466    -1.97   0.049     .6047017    .9987036
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6416.5679
Iteration 2:   log likelihood = -6347.5358
Iteration 3:   log likelihood = -6323.7537
Iteration 4:   log likelihood =   -6323.68
Iteration 5:   log likelihood =   -6323.68
Refining estimates:
Iteration 0:   log likelihood =   -6323.68

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(7)       =      659.13
Log likelihood  =     -6323.68                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.508019   .7108871     0.87   0.384     .5986136    3.798981
             |
   agegroup2 |
     60-<70  |   3.376636   .9583674     4.29   0.000     1.935948    5.889453
     70-<80  |   11.20293   2.796525     9.68   0.000     6.868329     18.2731
        80+  |   32.92274   8.013536    14.36   0.000     20.43195    53.04959
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .7759596   .4572386    -0.43   0.667     .2444915    2.462717
 HCQ#70-<80  |   .6547239   .3395607    -0.82   0.414      .236918    1.809333
    HCQ#80+  |   .6380148   .3255721    -0.88   0.378     .2346777    1.734561
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_agegrou
> p2.ster saved

Likelihood-ratio test                                 LR chi2(6)  =    655.00
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6408.7394
Iteration 2:   log likelihood = -6340.1004
Iteration 3:   log likelihood = -6316.4605
Iteration 4:   log likelihood = -6316.3864
Iteration 5:   log likelihood = -6316.3864
Refining estimates:
Iteration 0:   log likelihood = -6316.3864

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(5)       =      673.72
Log likelihood  =   -6316.3864                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.033329   .1327653     0.26   0.799     .8032922    1.329241
             |
   agegroup2 |
     60-<70  |   3.138949    .779584     4.61   0.000     1.929218    5.107251
     70-<80  |   10.03115   2.186117    10.58   0.000     6.544042    15.37643
        80+  |    29.7551   6.319386    15.98   0.000     19.62381    45.11693
             |
      1.male |   1.423256   .1255557     4.00   0.000      1.19727    1.691896
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6408.7302
Iteration 2:   log likelihood = -6339.6266
Iteration 3:   log likelihood = -6315.9258
Iteration 4:   log likelihood = -6315.8525
Iteration 5:   log likelihood = -6315.8525
Refining estimates:
Iteration 0:   log likelihood = -6315.8525

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(8)       =      674.79
Log likelihood  =   -6315.8525                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.576203    .743267     0.96   0.335     .6254947    3.971923
             |
   agegroup2 |
     60-<70  |     3.3447   .9493399     4.25   0.000     1.917596    5.833876
     70-<80  |   11.03447    2.75482     9.62   0.000     6.764631    17.99944
        80+  |   32.79388   7.982243    14.34   0.000     20.35189    52.84218
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .7540244   .4443523    -0.48   0.632     .2375559    2.393343
 HCQ#70-<80  |   .6317973   .3277273    -0.89   0.376     .2285812    1.746284
    HCQ#80+  |   .6095264   .3111251    -0.97   0.332     .2241338    1.657592
             |
      1.male |   1.426215   .1258714     4.02   0.000      1.19967    1.695541
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_ageg
> roup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      1.07
(Assumption: A nested in B)                           Prob > chi2 =    0.7849

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4466.2928
Iteration 2:   log likelihood = -4389.4646
Iteration 3:   log likelihood = -4372.3196
Iteration 4:   log likelihood =  -4372.272
Iteration 5:   log likelihood =  -4372.272
Refining estimates:
Iteration 0:   log likelihood =  -4372.272

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(7)       =      757.00
Log likelihood  =    -4372.272                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9952398   .1293539    -0.04   0.971      .771427    1.283987
             |
   agegroup2 |
     60-<70  |   3.020792   .7518861     4.44   0.000     1.854614    4.920259
     70-<80  |   9.293191   2.036473    10.17   0.000     6.048337    14.27887
        80+  |    26.6908   5.711089    15.35   0.000     17.54802     40.5971
             |
      1.male |    1.42622   .1263201     4.01   0.000     1.198935    1.696591
  1.dmard_pc |   .8920805   .0816758    -1.25   0.212       .74554    1.067424
1.oral_pr~ne |   2.450394   .2168107    10.13   0.000     2.060258    2.914407
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4465.9406
Iteration 2:   log likelihood = -4388.9593
Iteration 3:   log likelihood = -4371.7719
Iteration 4:   log likelihood = -4371.7223
Iteration 5:   log likelihood = -4371.7223
Refining estimates:
Iteration 0:   log likelihood = -4371.7223

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(10)      =      758.10
Log likelihood  =   -4371.7223                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.497136   .7088837     0.85   0.394     .5918658    3.787036
             |
   agegroup2 |
     60-<70  |   3.196383   .9085051     4.09   0.000     1.831144    5.579497
     70-<80  |   10.17906   2.550774     9.26   0.000     6.228802    16.63453
        80+  |   29.34861   7.177398    13.82   0.000     18.17275     47.3974
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .7824789   .4615906    -0.42   0.678     .2462306    2.486584
 HCQ#70-<80  |   .6461652   .3357427    -0.84   0.401      .233381    1.789047
    HCQ#80+  |   .6121009   .3130915    -0.96   0.337     .2246109    1.668074
             |
      1.male |   1.429195   .1266373     4.03   0.000     1.201348    1.700256
  1.dmard_pc |    .890115   .0815219    -1.27   0.204     .7438548    1.065134
1.oral_pr~ne |    2.44874   .2166193    10.12   0.000     2.058941    2.912334
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_ageg
> roup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      1.10
(Assumption: A nested in B)                           Prob > chi2 =    0.7772

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4663.3464
Iteration 2:   log likelihood = -4361.7543
Iteration 3:   log likelihood = -4299.5934
Iteration 4:   log likelihood = -4298.8377
Iteration 5:   log likelihood = -4298.8362
Refining estimates:
Iteration 0:   log likelihood = -4298.8362

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(29)      =      903.87
Log likelihood  =   -4298.8362                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9997978   .1302208    -0.00   0.999     .7745432    1.290562
             |
   agegroup2 |
     60-<70  |   2.574645    .649593     3.75   0.000     1.570203    4.221617
     70-<80  |   6.886204   1.587164     8.37   0.000     4.383197    10.81854
        80+  |   17.37643    4.04764    12.26   0.000     11.00735    27.43078
             |
      1.male |   1.226264   .1123459     2.23   0.026     1.024707    1.467466
  1.dmard_pc |   1.000033   .0928615     0.00   1.000     .8336296    1.199653
1.oral_pr~ne |   2.138553   .1965479     8.27   0.000     1.786029    2.560657
    1.nsaids |   .8321811   .1368665    -1.12   0.264     .6028692    1.148716
1.~c_disease |    1.46875   .1370364     4.12   0.000     1.223291    1.763462
1.resp_exc~a |   1.311412   .1301221     2.73   0.006     1.079644    1.592934
             |
egfr_cat_n~s |
      30-59  |   1.229352   .1226239     2.07   0.038     1.011048    1.494792
        <30  |      2.314   .4574474     4.24   0.000     1.570696    3.409061
             |
1.~r_disease |   1.217453   .3903845     0.61   0.539     .6493947    2.282421
             |
   obese4cat |
Obese I ..)  |   .9739249   .1132569    -0.23   0.820     .7754254    1.223238
Obese II..)  |   1.105949   .1919235     0.58   0.562     .7870819    1.553998
Obese II..)  |   1.225522   .3099493     0.80   0.421     .7465206    2.011871
             |
1.hyperten~n |   1.055056   .1034919     0.55   0.585     .8705222    1.278707
1.cancer_e~r |   1.272395   .1371131     2.24   0.025     1.030141    1.571619
1.neuro_co~s |   1.748473   .1915526     5.10   0.000     1.410608    2.167263
1.flu_vacc~e |   .8207098   .0873546    -1.86   0.063     .6661768     1.01109
             |
         imd |
          2  |   1.324628   .1920189     1.94   0.052     .9970181    1.759886
          3  |    1.53248   .2199949     2.97   0.003     1.156647    2.030434
          4  |   1.437414   .2121784     2.46   0.014     1.076305     1.91968
5 most de..  |   1.610562   .2414535     3.18   0.001     1.200511    2.160671
             |
     diabcat |
Controlle..  |   1.074705   .1237768     0.63   0.532     .8575389    1.346866
Uncontrol..  |    1.44733   .2262144     2.37   0.018     1.065434    1.966113
Diabetes,..  |   1.786926   .4235195     2.45   0.014     1.122957    2.843478
             |
smoke_nomiss |
     Former  |   1.427508   .1470397     3.46   0.001     1.166544    1.746852
    Current  |   1.083025   .1970695     0.44   0.661     .7581448    1.547123
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4663.2085
Iteration 2:   log likelihood =  -4361.327
Iteration 3:   log likelihood = -4299.1053
Iteration 4:   log likelihood = -4298.3276
Iteration 5:   log likelihood = -4298.3262
Refining estimates:
Iteration 0:   log likelihood = -4298.3262

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(32)      =      904.89
Log likelihood  =   -4298.3262                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.479424   .7009476     0.83   0.408     .5845144    3.744466
             |
   agegroup2 |
     60-<70  |   2.722011   .7822456     3.48   0.000     1.549792    4.780863
     70-<80  |   7.518075   1.961275     7.73   0.000     4.508684    12.53613
        80+  |   19.06459   4.987089    11.27   0.000     11.41727    31.83409
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .7884634   .4651859    -0.40   0.687     .2480737    2.506007
 HCQ#70-<80  |   .6613528   .3437695    -0.80   0.426     .2387705    1.831832
    HCQ#80+  |   .6217797   .3182049    -0.93   0.353     .2280456    1.695319
             |
      1.male |   1.228861   .1126391     2.25   0.025     1.026788    1.470704
  1.dmard_pc |   .9979801   .0926967    -0.02   0.983      .831876    1.197251
1.oral_pr~ne |   2.137792   .1964493     8.27   0.000     1.785442    2.559679
    1.nsaids |    .829727   .1365308    -1.13   0.257     .6009949    1.145512
1.~c_disease |   1.468754   .1370217     4.12   0.000     1.223319    1.763432
1.resp_exc~a |   1.312249   .1301956     2.74   0.006     1.080348    1.593928
             |
egfr_cat_n~s |
      30-59  |   1.229888   .1226671     2.07   0.038     1.011505    1.495419
        <30  |   2.311185   .4569095     4.24   0.000      1.56876    3.404967
             |
1.~r_disease |   1.217812   .3905039     0.61   0.539     .6495815    2.283109
             |
   obese4cat |
Obese I ..)  |   .9736788   .1132253    -0.23   0.819      .775234    1.222922
Obese II..)  |   1.105869   .1919225     0.58   0.562     .7870068    1.553921
Obese II..)  |   1.223489   .3094623     0.80   0.425     .7452496    2.008621
             |
1.hyperten~n |    1.05464   .1034357     0.54   0.588     .8702045    1.278167
1.cancer_e~r |   1.272244   .1370946     2.23   0.025     1.030023    1.571428
1.neuro_co~s |   1.746424   .1913351     5.09   0.000     1.408943     2.16474
1.flu_vacc~e |     .81878   .0870855    -1.88   0.060     .6647118    1.008559
             |
         imd |
          2  |   1.324218   .1919596     1.94   0.053     .9967097    1.759342
          3  |   1.532678   .2200251     2.97   0.003     1.156793    2.030701
          4  |   1.436248   .2120167     2.45   0.014     1.075415    1.918149
5 most de..  |    1.60921   .2412541     3.17   0.002     1.199499    2.158865
             |
     diabcat |
Controlle..  |   1.074038   .1237065     0.62   0.535      .856997    1.346047
Uncontrol..  |   1.446723   .2261036     2.36   0.018      1.06501    1.965246
Diabetes,..  |   1.787567    .423656     2.45   0.014     1.123379     2.84445
             |
smoke_nomiss |
     Former  |   1.427666   .1470558     3.46   0.001     1.166673    1.747045
    Current  |   1.084125   .1972718     0.44   0.657     .7589118    1.548701
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_ageg
> roup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      1.02
(Assumption: A nested in B)                           Prob > chi2 =    0.7964

-------------------------------------------------------------------------------
-> dmard_pc = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   107,977        311 |   108,288 
           |     99.71       0.29 |    100.00 
-----------+----------------------+----------
       HCQ |    14,785         41 |    14,826 
           |     99.72       0.28 |    100.00 
-----------+----------------------+----------
     Total |   122,762        352 |   123,114 
           |     99.71       0.29 |    100.00 

-------------------------------------------------------------------------------
-> dmard_pc = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    55,614        166 |    55,780 
           |     99.70       0.30 |    100.00 
-----------+----------------------+----------
       HCQ |    15,714         29 |    15,743 
           |     99.82       0.18 |    100.00 
-----------+----------------------+----------
     Total |    71,328        195 |    71,523 
           |     99.73       0.27 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6651.1941
Iteration 2:   log likelihood = -6651.1805
Iteration 3:   log likelihood = -6651.1805
Refining estimates:
Iteration 0:   log likelihood = -6651.1805

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(1)       =        4.13
Log likelihood  =   -6651.1805                  Prob > chi2      =      0.0421

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7771215    .099466    -1.97   0.049     .6047017    .9987036
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6649.7863
Iteration 2:   log likelihood = -6649.6931
Iteration 3:   log likelihood =  -6649.693
Refining estimates:
Iteration 0:   log likelihood =  -6649.693

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(3)       =        7.11
Log likelihood  =    -6649.693                  Prob > chi2      =      0.0686

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9492075   .1577105    -0.31   0.754     .6853846    1.314583
  1.dmard_pc |   1.030582   .0990621     0.31   0.754     .8536168    1.244234
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .6451357   .1683699    -1.68   0.093     .3868132    1.075972
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_dmard_p
> c.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      2.98
(Assumption: A nested in B)                           Prob > chi2 =    0.2259

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6408.7394
Iteration 2:   log likelihood = -6340.1004
Iteration 3:   log likelihood = -6316.4605
Iteration 4:   log likelihood = -6316.3864
Iteration 5:   log likelihood = -6316.3864
Refining estimates:
Iteration 0:   log likelihood = -6316.3864

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(5)       =      673.72
Log likelihood  =   -6316.3864                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.033329   .1327653     0.26   0.799     .8032922    1.329241
             |
   agegroup2 |
     60-<70  |   3.138949    .779584     4.61   0.000     1.929218    5.107251
     70-<80  |   10.03115   2.186117    10.58   0.000     6.544042    15.37643
        80+  |    29.7551   6.319386    15.98   0.000     19.62381    45.11693
             |
      1.male |   1.423256   .1255557     4.00   0.000      1.19727    1.691896
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6407.0966
Iteration 2:   log likelihood = -6338.4113
Iteration 3:   log likelihood = -6314.8175
Iteration 4:   log likelihood = -6314.7436
Iteration 5:   log likelihood = -6314.7436
Refining estimates:
Iteration 0:   log likelihood = -6314.7436

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(7)       =      677.00
Log likelihood  =   -6314.7436                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.231613   .2050726     1.25   0.211     .8886748     1.70689
  1.dmard_pc |   .9495584   .0915391    -0.54   0.591     .7860757    1.147041
             |
    exposure#|
    dmard_pc |
      HCQ#1  |     .69398   .1811478    -1.40   0.162     .4160639    1.157534
             |
   agegroup2 |
     60-<70  |   3.166315   .7868204     4.64   0.000     1.945507    5.153179
     70-<80  |   10.10984   2.205512    10.60   0.000     6.592506     15.5038
        80+  |   29.83115   6.336882    15.98   0.000     19.67222    45.23624
             |
      1.male |   1.432767    .126572     4.07   0.000     1.204979    1.703615
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_dmar
> d_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      3.29
(Assumption: A nested in B)                           Prob > chi2 =    0.1934

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4466.2928
Iteration 2:   log likelihood = -4389.4646
Iteration 3:   log likelihood = -4372.3196
Iteration 4:   log likelihood =  -4372.272
Iteration 5:   log likelihood =  -4372.272
Refining estimates:
Iteration 0:   log likelihood =  -4372.272

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(7)       =      757.00
Log likelihood  =    -4372.272                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9952398   .1293539    -0.04   0.971      .771427    1.283987
             |
   agegroup2 |
     60-<70  |   3.020792   .7518861     4.44   0.000     1.854614    4.920259
     70-<80  |   9.293191   2.036473    10.17   0.000     6.048337    14.27887
        80+  |    26.6908   5.711089    15.35   0.000     17.54802     40.5971
             |
      1.male |    1.42622   .1263201     4.01   0.000     1.198935    1.696591
  1.dmard_pc |   .8920805   .0816758    -1.25   0.212       .74554    1.067424
1.oral_pr~ne |   2.450394   .2168107    10.13   0.000     2.060258    2.914407
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4465.5587
Iteration 2:   log likelihood = -4388.7043
Iteration 3:   log likelihood = -4371.5725
Iteration 4:   log likelihood =  -4371.525
Iteration 5:   log likelihood =  -4371.525
Refining estimates:
Iteration 0:   log likelihood =  -4371.525

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(8)       =      758.49
Log likelihood  =    -4371.525                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.143072   .1917364     0.80   0.425     .8228015    1.588007
  1.dmard_pc |   .9319194   .0910938    -0.72   0.471     .7694397    1.128709
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .7275562   .1902902    -1.22   0.224     .4357499    1.214775
             |
   agegroup2 |
     60-<70  |   3.017272   .7510247     4.44   0.000     1.852436    4.914573
     70-<80  |   9.264632   2.030405    10.16   0.000     6.029506    14.23556
        80+  |   26.61906   5.696113    15.34   0.000     17.50037     40.4891
             |
      1.male |   1.427439   .1264397     4.02   0.000      1.19994    1.698068
1.oral_pr~ne |    2.44145   .2161931    10.08   0.000     2.052452    2.904175
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_dmar
> d_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      1.49
(Assumption: A nested in B)                           Prob > chi2 =    0.2216

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4663.3464
Iteration 2:   log likelihood = -4361.7543
Iteration 3:   log likelihood = -4299.5934
Iteration 4:   log likelihood = -4298.8377
Iteration 5:   log likelihood = -4298.8362
Refining estimates:
Iteration 0:   log likelihood = -4298.8362

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(29)      =      903.87
Log likelihood  =   -4298.8362                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9997978   .1302208    -0.00   0.999     .7745432    1.290562
             |
   agegroup2 |
     60-<70  |   2.574645    .649593     3.75   0.000     1.570203    4.221617
     70-<80  |   6.886204   1.587164     8.37   0.000     4.383197    10.81854
        80+  |   17.37643    4.04764    12.26   0.000     11.00735    27.43078
             |
      1.male |   1.226264   .1123459     2.23   0.026     1.024707    1.467466
  1.dmard_pc |   1.000033   .0928615     0.00   1.000     .8336296    1.199653
1.oral_pr~ne |   2.138553   .1965479     8.27   0.000     1.786029    2.560657
    1.nsaids |   .8321811   .1368665    -1.12   0.264     .6028692    1.148716
1.~c_disease |    1.46875   .1370364     4.12   0.000     1.223291    1.763462
1.resp_exc~a |   1.311412   .1301221     2.73   0.006     1.079644    1.592934
             |
egfr_cat_n~s |
      30-59  |   1.229352   .1226239     2.07   0.038     1.011048    1.494792
        <30  |      2.314   .4574474     4.24   0.000     1.570696    3.409061
             |
1.~r_disease |   1.217453   .3903845     0.61   0.539     .6493947    2.282421
             |
   obese4cat |
Obese I ..)  |   .9739249   .1132569    -0.23   0.820     .7754254    1.223238
Obese II..)  |   1.105949   .1919235     0.58   0.562     .7870819    1.553998
Obese II..)  |   1.225522   .3099493     0.80   0.421     .7465206    2.011871
             |
1.hyperten~n |   1.055056   .1034919     0.55   0.585     .8705222    1.278707
1.cancer_e~r |   1.272395   .1371131     2.24   0.025     1.030141    1.571619
1.neuro_co~s |   1.748473   .1915526     5.10   0.000     1.410608    2.167263
1.flu_vacc~e |   .8207098   .0873546    -1.86   0.063     .6661768     1.01109
             |
         imd |
          2  |   1.324628   .1920189     1.94   0.052     .9970181    1.759886
          3  |    1.53248   .2199949     2.97   0.003     1.156647    2.030434
          4  |   1.437414   .2121784     2.46   0.014     1.076305     1.91968
5 most de..  |   1.610562   .2414535     3.18   0.001     1.200511    2.160671
             |
     diabcat |
Controlle..  |   1.074705   .1237768     0.63   0.532     .8575389    1.346866
Uncontrol..  |    1.44733   .2262144     2.37   0.018     1.065434    1.966113
Diabetes,..  |   1.786926   .4235195     2.45   0.014     1.122957    2.843478
             |
smoke_nomiss |
     Former  |   1.427508   .1470397     3.46   0.001     1.166544    1.746852
    Current  |   1.083025   .1970695     0.44   0.661     .7581448    1.547123
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4662.7836
Iteration 2:   log likelihood = -4360.9407
Iteration 3:   log likelihood = -4298.7041
Iteration 4:   log likelihood = -4297.9493
Iteration 5:   log likelihood = -4297.9478
Refining estimates:
Iteration 0:   log likelihood = -4297.9478

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(30)      =      905.65
Log likelihood  =   -4297.9478                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    1.16392   .1955167     0.90   0.366     .8374085    1.617741
  1.dmard_pc |   1.049231   .1038952     0.49   0.627     .8641417    1.273965
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .7068851   .1849587    -1.33   0.185     .4232815    1.180507
             |
   agegroup2 |
     60-<70  |   2.572095   .6489747     3.74   0.000     1.568619    4.217517
     70-<80  |   6.870313   1.583638     8.36   0.000     4.372912      10.794
        80+  |   17.34549   4.040886    12.25   0.000     10.98719    27.38334
             |
      1.male |   1.227178   .1124443     2.23   0.025     1.025447    1.468594
1.oral_pr~ne |   2.130226   .1958694     8.22   0.000     1.778933     2.55089
    1.nsaids |   .8313098   .1367236    -1.12   0.261     .6022374    1.147514
1.~c_disease |    1.46913   .1370903     4.12   0.000     1.223577    1.763962
1.resp_exc~a |   1.312316   .1301619     2.74   0.006     1.080469    1.593914
             |
egfr_cat_n~s |
      30-59  |   1.228024   .1225161     2.06   0.040     1.009915    1.493236
        <30  |   2.313001   .4572653     4.24   0.000     1.569997    3.407633
             |
1.~r_disease |   1.216809   .3901866     0.61   0.541     .6490417    2.281245
             |
   obese4cat |
Obese I ..)  |    .973728   .1132356    -0.23   0.819     .7752661    1.222995
Obese II..)  |   1.106771    .192088     0.58   0.559     .7876357    1.555213
Obese II..)  |   1.228098   .3106022     0.81   0.417     .7480887    2.016105
             |
1.hyperten~n |   1.055058    .103469     0.55   0.585     .8705619    1.278655
1.cancer_e~r |    1.27217   .1370925     2.23   0.025     1.029953     1.57135
1.neuro_co~s |   1.749933   .1916967     5.11   0.000      1.41181    2.169034
1.flu_vacc~e |   .8182185    .087115    -1.88   0.060      .664114    1.008082
             |
         imd |
          2  |   1.324662   .1920224     1.94   0.052     .9970462    1.759928
          3  |   1.530932   .2197721     2.97   0.003     1.155479    2.028382
          4  |   1.438717   .2123727     2.46   0.014     1.077277    1.921425
5 most de..  |   1.611087   .2415206     3.18   0.001     1.200919    2.161344
             |
     diabcat |
Controlle..  |   1.074804   .1237916     0.63   0.531     .8576127    1.346999
Uncontrol..  |   1.448777   .2263939     2.37   0.018     1.066567    1.967955
Diabetes,..  |   1.791101    .424511     2.46   0.014     1.125578    2.850128
             |
smoke_nomiss |
     Former  |   1.427787   .1470516     3.46   0.001     1.166799    1.747153
    Current  |   1.085329   .1974729     0.45   0.653     .7597789     1.55037
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_dmar
> d_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      1.78
(Assumption: A nested in B)                           Prob > chi2 =    0.1825

-------------------------------------------------------------------------------
-> oral_prednisolone = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,980        296 |   137,276 
           |     99.78       0.22 |    100.00 
-----------+----------------------+----------
       HCQ |    23,646         38 |    23,684 
           |     99.84       0.16 |    100.00 
-----------+----------------------+----------
     Total |   160,626        334 |   160,960 
           |     99.79       0.21 |    100.00 

-------------------------------------------------------------------------------
-> oral_prednisolone = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,611        181 |    26,792 
           |     99.32       0.68 |    100.00 
-----------+----------------------+----------
       HCQ |     6,853         32 |     6,885 
           |     99.54       0.46 |    100.00 
-----------+----------------------+----------
     Total |    33,464        213 |    33,677 
           |     99.37       0.63 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6651.1941
Iteration 2:   log likelihood = -6651.1805
Iteration 3:   log likelihood = -6651.1805
Refining estimates:
Iteration 0:   log likelihood = -6651.1805

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(1)       =        4.13
Log likelihood  =   -6651.1805                  Prob > chi2      =      0.0421

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7771215    .099466    -1.97   0.049     .6047017    .9987036
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6592.1752
Iteration 2:   log likelihood = -6576.7196
Iteration 3:   log likelihood = -6576.6852
Iteration 4:   log likelihood = -6576.6852
Refining estimates:
Iteration 0:   log likelihood = -6576.6852

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(3)       =      153.12
Log likelihood  =   -6576.6852                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7344202   .1265553    -1.79   0.073     .5239207    1.029494
1.oral_pr~ne |   3.166989    .298828    12.22   0.000     2.632265    3.810337
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |    .920434   .2373025    -0.32   0.748      .555315    1.525618
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_oral_pr
> ednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    148.99
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6408.7394
Iteration 2:   log likelihood = -6340.1004
Iteration 3:   log likelihood = -6316.4605
Iteration 4:   log likelihood = -6316.3864
Iteration 5:   log likelihood = -6316.3864
Refining estimates:
Iteration 0:   log likelihood = -6316.3864

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(5)       =      673.72
Log likelihood  =   -6316.3864                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.033329   .1327653     0.26   0.799     .8032922    1.329241
             |
   agegroup2 |
     60-<70  |   3.138949    .779584     4.61   0.000     1.929218    5.107251
     70-<80  |   10.03115   2.186117    10.58   0.000     6.544042    15.37643
        80+  |    29.7551   6.319386    15.98   0.000     19.62381    45.11693
             |
      1.male |   1.423256   .1255557     4.00   0.000      1.19727    1.691896
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6378.5331
Iteration 2:   log likelihood = -6293.8719
Iteration 3:   log likelihood = -6269.5504
Iteration 4:   log likelihood = -6269.4729
Iteration 5:   log likelihood = -6269.4729
Refining estimates:
Iteration 0:   log likelihood = -6269.4729

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(7)       =      767.55
Log likelihood  =   -6269.4729                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9664862   .1669564    -0.20   0.844     .6888969     1.35593
1.oral_pr~ne |   2.443144   .2311495     9.44   0.000     2.029624    2.940915
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9972098   .2571163    -0.01   0.991     .6016118    1.652939
             |
   agegroup2 |
     60-<70  |   2.983139    .741191     4.40   0.000      1.83309    4.854708
     70-<80  |   9.123689   1.991575    10.13   0.000     5.947918     13.9951
        80+  |   26.48335   5.638257    15.39   0.000     17.44833    40.19687
             |
      1.male |   1.413676   .1247195     3.92   0.000     1.189197    1.680529
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_oral
> _prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     93.83
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4466.2928
Iteration 2:   log likelihood = -4389.4646
Iteration 3:   log likelihood = -4372.3196
Iteration 4:   log likelihood =  -4372.272
Iteration 5:   log likelihood =  -4372.272
Refining estimates:
Iteration 0:   log likelihood =  -4372.272

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(7)       =      757.00
Log likelihood  =    -4372.272                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9952398   .1293539    -0.04   0.971      .771427    1.283987
             |
   agegroup2 |
     60-<70  |   3.020792   .7518861     4.44   0.000     1.854614    4.920259
     70-<80  |   9.293191   2.036473    10.17   0.000     6.048337    14.27887
        80+  |    26.6908   5.711089    15.35   0.000     17.54802     40.5971
             |
      1.male |    1.42622   .1263201     4.01   0.000     1.198935    1.696591
  1.dmard_pc |   .8920805   .0816758    -1.25   0.212       .74554    1.067424
1.oral_pr~ne |   2.450394   .2168107    10.13   0.000     2.060258    2.914407
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4468.8887
Iteration 2:   log likelihood = -4389.6953
Iteration 3:   log likelihood = -4372.3199
Iteration 4:   log likelihood = -4372.2714
Iteration 5:   log likelihood = -4372.2714
Refining estimates:
Iteration 0:   log likelihood = -4372.2714

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(8)       =      757.00
Log likelihood  =   -4372.2714                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9994076   .1738911    -0.00   0.997     .7106218    1.405551
1.oral_pr~ne |   2.453458   .2331076     9.45   0.000     2.036593    2.955649
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9907323   .2558501    -0.04   0.971     .5972265    1.643515
             |
   agegroup2 |
     60-<70  |   3.020618   .7518576     4.44   0.000      1.85449    4.920023
     70-<80  |   9.292938   2.036429    10.17   0.000     6.048156    14.27851
        80+  |   26.69041   5.711032    15.35   0.000     17.54773    40.59659
             |
      1.male |   1.426279   .1263365     4.01   0.000     1.198967    1.696688
  1.dmard_pc |   .8919867   .0817099    -1.25   0.212     .7453918    1.067412
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_oral
> _prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.00
(Assumption: A nested in B)                           Prob > chi2 =    0.9712

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4663.3464
Iteration 2:   log likelihood = -4361.7543
Iteration 3:   log likelihood = -4299.5934
Iteration 4:   log likelihood = -4298.8377
Iteration 5:   log likelihood = -4298.8362
Refining estimates:
Iteration 0:   log likelihood = -4298.8362

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(29)      =      903.87
Log likelihood  =   -4298.8362                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9997978   .1302208    -0.00   0.999     .7745432    1.290562
             |
   agegroup2 |
     60-<70  |   2.574645    .649593     3.75   0.000     1.570203    4.221617
     70-<80  |   6.886204   1.587164     8.37   0.000     4.383197    10.81854
        80+  |   17.37643    4.04764    12.26   0.000     11.00735    27.43078
             |
      1.male |   1.226264   .1123459     2.23   0.026     1.024707    1.467466
  1.dmard_pc |   1.000033   .0928615     0.00   1.000     .8336296    1.199653
1.oral_pr~ne |   2.138553   .1965479     8.27   0.000     1.786029    2.560657
    1.nsaids |   .8321811   .1368665    -1.12   0.264     .6028692    1.148716
1.~c_disease |    1.46875   .1370364     4.12   0.000     1.223291    1.763462
1.resp_exc~a |   1.311412   .1301221     2.73   0.006     1.079644    1.592934
             |
egfr_cat_n~s |
      30-59  |   1.229352   .1226239     2.07   0.038     1.011048    1.494792
        <30  |      2.314   .4574474     4.24   0.000     1.570696    3.409061
             |
1.~r_disease |   1.217453   .3903845     0.61   0.539     .6493947    2.282421
             |
   obese4cat |
Obese I ..)  |   .9739249   .1132569    -0.23   0.820     .7754254    1.223238
Obese II..)  |   1.105949   .1919235     0.58   0.562     .7870819    1.553998
Obese II..)  |   1.225522   .3099493     0.80   0.421     .7465206    2.011871
             |
1.hyperten~n |   1.055056   .1034919     0.55   0.585     .8705222    1.278707
1.cancer_e~r |   1.272395   .1371131     2.24   0.025     1.030141    1.571619
1.neuro_co~s |   1.748473   .1915526     5.10   0.000     1.410608    2.167263
1.flu_vacc~e |   .8207098   .0873546    -1.86   0.063     .6661768     1.01109
             |
         imd |
          2  |   1.324628   .1920189     1.94   0.052     .9970181    1.759886
          3  |    1.53248   .2199949     2.97   0.003     1.156647    2.030434
          4  |   1.437414   .2121784     2.46   0.014     1.076305     1.91968
5 most de..  |   1.610562   .2414535     3.18   0.001     1.200511    2.160671
             |
     diabcat |
Controlle..  |   1.074705   .1237768     0.63   0.532     .8575389    1.346866
Uncontrol..  |    1.44733   .2262144     2.37   0.018     1.065434    1.966113
Diabetes,..  |   1.786926   .4235195     2.45   0.014     1.122957    2.843478
             |
smoke_nomiss |
     Former  |   1.427508   .1470397     3.46   0.001     1.166544    1.746852
    Current  |   1.083025   .1970695     0.44   0.661     .7581448    1.547123
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4665.8639
Iteration 2:   log likelihood = -4362.0845
Iteration 3:   log likelihood = -4299.5887
Iteration 4:   log likelihood = -4298.8338
Iteration 5:   log likelihood = -4298.8324
Refining estimates:
Iteration 0:   log likelihood = -4298.8324

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(30)      =      903.88
Log likelihood  =   -4298.8324                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.010048    .176015     0.06   0.954     .7178079    1.421267
1.oral_pr~ne |   2.145107   .2108247     7.77   0.000      1.76926    2.600798
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9775997   .2525799    -0.09   0.930     .5891668    1.622123
             |
   agegroup2 |
     60-<70  |   2.574395   .6495342     3.75   0.000     1.570046    4.221221
     70-<80  |   6.886033   1.587124     8.37   0.000     4.383089    10.81827
        80+  |   17.37706   4.047807    12.26   0.000     11.00773    27.43184
             |
      1.male |   1.226461    .112386     2.23   0.026     1.024836    1.467753
  1.dmard_pc |   .9997891   .0928827    -0.00   0.998     .8333545    1.199463
    1.nsaids |   .8320956   .1368564    -1.12   0.264     .6028017    1.148609
1.~c_disease |   1.468805   .1370423     4.12   0.000     1.223335     1.76353
1.resp_exc~a |    1.31129   .1301154     2.73   0.006     1.079534    1.592798
             |
egfr_cat_n~s |
      30-59  |   1.229439   .1226349     2.07   0.038     1.011116    1.494904
        <30  |   2.313786   .4574101     4.24   0.000     1.570544     3.40876
             |
1.~r_disease |   1.217514   .3904055     0.61   0.539     .6494256     2.28254
             |
   obese4cat |
Obese I ..)  |   .9738814   .1132528    -0.23   0.820     .7753892    1.223186
Obese II..)  |   1.105913   .1919176     0.58   0.562      .787056    1.553949
Obese II..)  |   1.225657   .3099875     0.80   0.421     .7465984    2.012107
             |
1.hyperten~n |   1.055066   .1034919     0.55   0.585     .8705323    1.278717
1.cancer_e~r |   1.272415   .1371156     2.24   0.025     1.030157    1.571645
1.neuro_co~s |   1.748497   .1915542     5.10   0.000     1.410629     2.16729
1.flu_vacc~e |   .8206545   .0873509    -1.86   0.063     .6661286    1.011027
             |
         imd |
          2  |   1.324666   .1920247     1.94   0.052     .9970465    1.759937
          3  |   1.532554   .2200064     2.97   0.003     1.156701    2.030535
          4  |   1.437513   .2121972     2.46   0.014     1.076372    1.919823
5 most de..  |   1.610733   .2414881     3.18   0.001     1.200626    2.160923
             |
     diabcat |
Controlle..  |   1.074636   .1237731     0.62   0.532     .8574776    1.346791
Uncontrol..  |   1.447188    .226199     2.36   0.018      1.06532    1.965938
Diabetes,..  |   1.787471    .423689     2.45   0.014      1.12325    2.844472
             |
smoke_nomiss |
     Former  |    1.42749   .1470366     3.46   0.001     1.166531    1.746826
    Current  |   1.083047    .197073     0.44   0.661     .7581603    1.547153
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_oral
> _prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.01
(Assumption: A nested in B)                           Prob > chi2 =    0.9301

-------------------------------------------------------------------------------
-> nsaids = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,939        443 |   137,382 
           |     99.68       0.32 |    100.00 
-----------+----------------------+----------
       HCQ |    23,837         62 |    23,899 
           |     99.74       0.26 |    100.00 
-----------+----------------------+----------
     Total |   160,776        505 |   161,281 
           |     99.69       0.31 |    100.00 

-------------------------------------------------------------------------------
-> nsaids = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,652         34 |    26,686 
           |     99.87       0.13 |    100.00 
-----------+----------------------+----------
       HCQ |     6,662          8 |     6,670 
           |     99.88       0.12 |    100.00 
-----------+----------------------+----------
     Total |    33,314         42 |    33,356 
           |     99.87       0.13 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6651.1941
Iteration 2:   log likelihood = -6651.1805
Iteration 3:   log likelihood = -6651.1805
Refining estimates:
Iteration 0:   log likelihood = -6651.1805

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(1)       =        4.13
Log likelihood  =   -6651.1805                  Prob > chi2      =      0.0421

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7771215    .099466    -1.97   0.049     .6047017    .9987036
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6631.9543
Iteration 2:   log likelihood = -6630.7369
Iteration 3:   log likelihood = -6630.7266
Iteration 4:   log likelihood = -6630.7266
Refining estimates:
Iteration 0:   log likelihood = -6630.7266

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(3)       =       45.04
Log likelihood  =   -6630.7266                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7942211   .1076935    -1.70   0.089     .6088657    1.036004
    1.nsaids |   .3947775   .0702539    -5.22   0.000     .2785314    .5595394
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.167456   .4852997     0.37   0.710     .5168977    2.636795
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_nsaids.
> ster saved

Likelihood-ratio test                                 LR chi2(2)  =     40.91
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6408.7394
Iteration 2:   log likelihood = -6340.1004
Iteration 3:   log likelihood = -6316.4605
Iteration 4:   log likelihood = -6316.3864
Iteration 5:   log likelihood = -6316.3864
Refining estimates:
Iteration 0:   log likelihood = -6316.3864

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(5)       =      673.72
Log likelihood  =   -6316.3864                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.033329   .1327653     0.26   0.799     .8032922    1.329241
             |
   agegroup2 |
     60-<70  |   3.138949    .779584     4.61   0.000     1.929218    5.107251
     70-<80  |   10.03115   2.186117    10.58   0.000     6.544042    15.37643
        80+  |    29.7551   6.319386    15.98   0.000     19.62381    45.11693
             |
      1.male |   1.423256   .1255557     4.00   0.000      1.19727    1.691896
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood =  -6406.351
Iteration 2:   log likelihood = -6337.3899
Iteration 3:   log likelihood = -6313.8043
Iteration 4:   log likelihood = -6313.7306
Iteration 5:   log likelihood = -6313.7305
Refining estimates:
Iteration 0:   log likelihood = -6313.7305

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(7)       =      679.03
Log likelihood  =   -6313.7305                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.022967   .1391165     0.17   0.867     .7836171    1.335424
    1.nsaids |   .6831431   .1226775    -2.12   0.034      .480457    .9713346
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.184388   .4923984     0.41   0.684     .5243424    2.675304
             |
   agegroup2 |
     60-<70  |   3.127531   .7768188     4.59   0.000     1.922115    5.088898
     70-<80  |   9.784164   2.135122    10.45   0.000     6.379294    15.00634
        80+  |    28.3747   6.052619    15.68   0.000     18.67933     43.1024
             |
      1.male |   1.422526   .1254944     3.99   0.000     1.196651    1.691035
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_nsai
> ds.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      5.31
(Assumption: A nested in B)                           Prob > chi2 =    0.0702

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4466.2928
Iteration 2:   log likelihood = -4389.4646
Iteration 3:   log likelihood = -4372.3196
Iteration 4:   log likelihood =  -4372.272
Iteration 5:   log likelihood =  -4372.272
Refining estimates:
Iteration 0:   log likelihood =  -4372.272

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(7)       =      757.00
Log likelihood  =    -4372.272                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9952398   .1293539    -0.04   0.971      .771427    1.283987
             |
   agegroup2 |
     60-<70  |   3.020792   .7518861     4.44   0.000     1.854614    4.920259
     70-<80  |   9.293191   2.036473    10.17   0.000     6.048337    14.27887
        80+  |    26.6908   5.711089    15.35   0.000     17.54802     40.5971
             |
      1.male |    1.42622   .1263201     4.01   0.000     1.198935    1.696591
  1.dmard_pc |   .8920805   .0816758    -1.25   0.212       .74554    1.067424
1.oral_pr~ne |   2.450394   .2168107    10.13   0.000     2.060258    2.914407
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood =  -4464.428
Iteration 2:   log likelihood = -4387.2116
Iteration 3:   log likelihood = -4370.1366
Iteration 4:   log likelihood = -4370.0893
Iteration 5:   log likelihood = -4370.0893
Refining estimates:
Iteration 0:   log likelihood = -4370.0893

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(9)       =      761.36
Log likelihood  =   -4370.0893                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9817683   .1349319    -0.13   0.893      .749932    1.285275
    1.nsaids |   .7035929   .1267792    -1.95   0.051     .4942479    1.001609
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.205632   .5014904     0.45   0.653     .5335219    2.724442
             |
   agegroup2 |
     60-<70  |   2.999047   .7466847     4.41   0.000      1.84101    4.885514
     70-<80  |   9.040831   1.985701    10.02   0.000     5.878318    13.90477
        80+  |   25.44562   5.476699    15.04   0.000     16.68813    38.79881
             |
      1.male |   1.425333   .1262459     4.00   0.000     1.198183    1.695547
  1.dmard_pc |    .898701   .0823463    -1.17   0.244     .7509675    1.075497
1.oral_pr~ne |   2.449478     .21677    10.12   0.000     2.059422    2.913411
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_nsai
> ds.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      4.37
(Assumption: A nested in B)                           Prob > chi2 =    0.1127

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4663.3464
Iteration 2:   log likelihood = -4361.7543
Iteration 3:   log likelihood = -4299.5934
Iteration 4:   log likelihood = -4298.8377
Iteration 5:   log likelihood = -4298.8362
Refining estimates:
Iteration 0:   log likelihood = -4298.8362

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(29)      =      903.87
Log likelihood  =   -4298.8362                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9997978   .1302208    -0.00   0.999     .7745432    1.290562
             |
   agegroup2 |
     60-<70  |   2.574645    .649593     3.75   0.000     1.570203    4.221617
     70-<80  |   6.886204   1.587164     8.37   0.000     4.383197    10.81854
        80+  |   17.37643    4.04764    12.26   0.000     11.00735    27.43078
             |
      1.male |   1.226264   .1123459     2.23   0.026     1.024707    1.467466
  1.dmard_pc |   1.000033   .0928615     0.00   1.000     .8336296    1.199653
1.oral_pr~ne |   2.138553   .1965479     8.27   0.000     1.786029    2.560657
    1.nsaids |   .8321811   .1368665    -1.12   0.264     .6028692    1.148716
1.~c_disease |    1.46875   .1370364     4.12   0.000     1.223291    1.763462
1.resp_exc~a |   1.311412   .1301221     2.73   0.006     1.079644    1.592934
             |
egfr_cat_n~s |
      30-59  |   1.229352   .1226239     2.07   0.038     1.011048    1.494792
        <30  |      2.314   .4574474     4.24   0.000     1.570696    3.409061
             |
1.~r_disease |   1.217453   .3903845     0.61   0.539     .6493947    2.282421
             |
   obese4cat |
Obese I ..)  |   .9739249   .1132569    -0.23   0.820     .7754254    1.223238
Obese II..)  |   1.105949   .1919235     0.58   0.562     .7870819    1.553998
Obese II..)  |   1.225522   .3099493     0.80   0.421     .7465206    2.011871
             |
1.hyperten~n |   1.055056   .1034919     0.55   0.585     .8705222    1.278707
1.cancer_e~r |   1.272395   .1371131     2.24   0.025     1.030141    1.571619
1.neuro_co~s |   1.748473   .1915526     5.10   0.000     1.410608    2.167263
1.flu_vacc~e |   .8207098   .0873546    -1.86   0.063     .6661768     1.01109
             |
         imd |
          2  |   1.324628   .1920189     1.94   0.052     .9970181    1.759886
          3  |    1.53248   .2199949     2.97   0.003     1.156647    2.030434
          4  |   1.437414   .2121784     2.46   0.014     1.076305     1.91968
5 most de..  |   1.610562   .2414535     3.18   0.001     1.200511    2.160671
             |
     diabcat |
Controlle..  |   1.074705   .1237768     0.63   0.532     .8575389    1.346866
Uncontrol..  |    1.44733   .2262144     2.37   0.018     1.065434    1.966113
Diabetes,..  |   1.786926   .4235195     2.45   0.014     1.122957    2.843478
             |
smoke_nomiss |
     Former  |   1.427508   .1470397     3.46   0.001     1.166544    1.746852
    Current  |   1.083025   .1970695     0.44   0.661     .7581448    1.547123
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4663.2577
Iteration 2:   log likelihood = -4361.6841
Iteration 3:   log likelihood = -4299.5124
Iteration 4:   log likelihood = -4298.7557
Iteration 5:   log likelihood = -4298.7543
Refining estimates:
Iteration 0:   log likelihood = -4298.7543

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(30)      =      904.03
Log likelihood  =   -4298.7543                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9826039   .1353004    -0.13   0.899     .7501907     1.28702
    1.nsaids |   .8079327   .1465187    -1.18   0.240      .566252    1.152765
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.186306   .4935955     0.41   0.681     .5248448    2.681407
             |
   agegroup2 |
     60-<70  |   2.577518   .6503627     3.75   0.000     1.571902    4.226472
     70-<80  |   6.895367   1.589544     8.38   0.000     4.388695    10.83376
        80+  |    17.3967   4.053289    12.26   0.000     11.01905    27.46565
             |
      1.male |   1.226776   .1124002     2.23   0.026     1.025124    1.468096
  1.dmard_pc |   1.000135   .0928784     0.00   0.999     .8337019    1.199792
1.oral_pr~ne |   2.139238   .1966149     8.27   0.000     1.786595    2.561486
1.~c_disease |   1.468766   .1370345     4.12   0.000     1.223309    1.763474
1.resp_exc~a |   1.311393   .1301182     2.73   0.006     1.079631    1.592906
             |
egfr_cat_n~s |
      30-59  |   1.229381   .1226245     2.07   0.038     1.011075    1.494822
        <30  |   2.312973   .4572445     4.24   0.000     1.569998    3.407548
             |
1.~r_disease |   1.217226   .3903158     0.61   0.540     .6492693     2.28201
             |
   obese4cat |
Obese I ..)  |   .9737386   .1132341    -0.23   0.819     .7752787    1.223001
Obese II..)  |   1.106388   .1920003     0.58   0.560     .7873934    1.554616
Obese II..)  |    1.22522   .3098732     0.80   0.422     .7463364    2.011377
             |
1.hyperten~n |   1.055073   .1034981     0.55   0.585     .8705289    1.278738
1.cancer_e~r |   1.272205   .1370922     2.23   0.025     1.029988    1.571383
1.neuro_co~s |   1.748376    .191544     5.10   0.000     1.410526    2.167148
1.flu_vacc~e |   .8208436   .0873673    -1.85   0.064     .6662879    1.011251
             |
         imd |
          2  |   1.324637   .1920203     1.94   0.052      .997025    1.759898
          3  |   1.532719   .2200288     2.97   0.003     1.156828     2.03075
          4  |   1.437024   .2121219     2.46   0.014     1.076011    1.919162
5 most de..  |   1.610211   .2413967     3.18   0.001     1.200256    2.160189
             |
     diabcat |
Controlle..  |   1.074217   .1237278     0.62   0.534     .8571386    1.346272
Uncontrol..  |   1.447566   .2262524     2.37   0.018     1.065606    1.966436
Diabetes,..  |   1.787077   .4235534     2.45   0.014     1.123054    2.843712
             |
smoke_nomiss |
     Former  |   1.427621   .1470513     3.46   0.001     1.166636     1.74699
    Current  |   1.082854   .1970399     0.44   0.662     .7580225    1.546883
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_nsai
> ds.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.16
(Assumption: A nested in B)                           Prob > chi2 =    0.6856

. 
. 
. 
. 
. 
. 
. /* Print interaction table===================================================
> =*/ 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table3.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 3: Interactions with HCQ use on risk of $tabl
> eoutcome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab _tab ("Age/
> Sex Adjusted") _tab _tab _tab  ///
>                                                 ("DAG Adjusted") _tab _tab _t
> ab ("Fully Adjusted") _tab _tab _tab _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("p (interactio
> n)") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("p (interact
> ion)") _tab ("HR") _tab ("95% CI") _tab ("p (interaction)") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab (
> "p (interaction)") _tab _n

. 
.                                                 
. * Generic program to print model for a level of another variable 
. cap prog drop printinteraction

. prog define printinteraction 
  1. syntax, variable(varname) min(real) max(real) 
  2. 
. * Overall p-values 
. 
. file write tablecontent ("`variable'") _tab _tab _tab _tab ("${univar_p_`vari
> able'}") ///
>                                                 _tab _tab _tab ("${multivar1_
> p_`variable'}") /// 
>                                                 _tab _tab _tab ("${multivar2_
> p_`variable'}") ///
>                                                 _tab _tab _tab ("${multivar3_
> p_`variable'}") _n
  3.         forvalues varlevel = `min'/`max'{ 
  4. 
.                 * Row headings 
.                                                         
.                 file write tablecontent ("`varlevel'") _n       
  5. 
.                 local lab0: label exposure 0
  6.                 local lab1: label exposure 1
  7.                  
.                 /* Counts */
.                         
.                 * First row, exposure = 0 (reference)
.                 
.         file write tablecontent ("`lab0'") _tab
  8. 
.                         cou if exposure == 0 & `variable' == `varlevel'
  9.                         local rowdenom = r(N)
 10.                         cou if exposure == 0  & `variable' == `varlevel' &
>  $outcome == 1
 11.                         local pct = 100*(r(N)/`rowdenom')
 12.                         
.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 13.                 file write tablecontent ("1.00 (ref)") _tab _tab _tab ("1.
> 00 (ref)") _tab _tab _tab ("1.00 (ref)") _tab _tab _tab ("1.00 (ref)") _n
 14.                         
.                 * Second row, exposure = 1 (comparator)
. 
.                 file write tablecontent ("`lab1'") _tab  
 15. 
.                         cou if exposure == 1 & `variable' == `varlevel'
 16.                         local rowdenom = r(N)
 17.                         cou if exposure == 1 & `variable' == `varlevel' & 
> $outcome == 1
 18.                         local pct = 100*(r(N)/`rowdenom')
 19.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 20. 
.                 * Print models 
.                 estimates use $Tempdir/univar_int_`variable' 
 21.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 22.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 23. 
.                 estimates use $Tempdir/multivar1_int_`variable'
 24.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 25.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 26. 
.                 estimates use $Tempdir/multivar2_int_`variable'
 27.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 28.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab 
 29.         
.                 estimates use $Tempdir/multivar3_int_`variable'
 30.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 31.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _n
 32.         } 
 33.                 
. end

. 
. printinteraction, variable(agegroup2) min(3) max(6) 
  57,719
  18
  12,514
  6
  37,726
  40
  7,973
  10
  42,090
  148
  7,148
  25
  26,533
  271
  2,934
  29

. file write tablecontent _n _n

. 
. printinteraction, variable(dmard_pc) min(0) max(1) 
  108,288
  311
  14,826
  41
  55,780
  166
  15,743
  29

. file write tablecontent _n _n

.   
. printinteraction, variable(oral_prednisolone) min(0) max(1) 
  137,276
  296
  23,684
  38
  26,792
  181
  6,885
  32

. file write tablecontent _n _n

. 
. printinteraction, variable(nsaids) min(0) max(1) 
  137,382
  443
  23,899
  62
  26,686
  34
  6,670
  8

. 
. 
. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\07_an_models_in
> teract.log
  log type:  text
 closed on:   6 Oct 2020, 12:50:34
-------------------------------------------------------------------------------
