-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\07_an_models_in
> teract.log
  log type:  text
 opened on:  19 Jul 2020, 18:06:21

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* So few deaths occuring below 60 years this cannot be used as a category, s
> o combining 18-59 */ 
. gen agegroup2 = agegroup

. recode agegroup2(1 = 2)
(agegroup2: 13683 changes made)

. recode agegroup2(2 = 3)
(agegroup2: 33089 changes made)

. tab agegroup2, nolabel 

  agegroup2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     70,113       36.10       36.10
          4 |     45,617       23.49       59.58
          5 |     49,101       25.28       84.86
          6 |     29,405       15.14      100.00
------------+-----------------------------------
      Total |    194,236      100.00

. 
. label define agegroup2  3 "18-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup2 agegroup2

. tab agegroup agegroup2 , m

   Grouped |                  agegroup2
       age |    18-<60     60-<70     70-<80        80+ |     Total
-----------+--------------------------------------------+----------
    18-<40 |    13,683          0          0          0 |    13,683 
    40-<50 |    19,406          0          0          0 |    19,406 
    50-<60 |    37,024          0          0          0 |    37,024 
    60-<70 |         0     45,617          0          0 |    45,617 
    70-<80 |         0          0     49,101          0 |    49,101 
       80+ |         0          0          0     29,405 |    29,405 
-----------+--------------------------------------------+----------
     Total |    70,113     45,617     49,101     29,405 |   194,236 

. 
. 
. foreach intvar of varlist agegroup2 dmard_pc oral_prednisolone nsaids {
  2. /* Check Counts */ 
. 
. bysort `intvar': tab exposure $outcome, row
  3. 
. /* Univariable model */ 
. stcox i.exposure
  4. estimates store A
  5. 
. stcox i.exposure##i.`intvar'
  6. estimates store B
  7. estimates save $Tempdir/univar_int_`intvar', replace 
  8. 
. lrtest A B
  9. global univar_p_`intvar' = round(r(p),0.001)
 10. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. stcox i.exposure i.agegroup2 i.male
 11. estimates store A
 12. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male
 13. estimates store B
 14. estimates save $Tempdir/multivar1_int_`intvar', replace 
 15. 
. lrtest A B
 16. global multivar1_p_`intvar' = round(r(p),0.001)
 17. 
. * DAG Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone, strata(st
> p population)                                      
 18.                                                                           
>       
. estimates store A
 19. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e, strata(stp population)                  
 20. estimates store B
 21. estimates save $Tempdir/multivar2_int_`intvar', replace 
 22. 
. lrtest A B
 23. global multivar2_p_`intvar' = round(r(p),0.001)
 24. 
. * Fully Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone i.nsaids i
> .chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_liver
> _disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu_va
> ccine, strata(stp population)
 25. estimates store A
 26. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.c
> hronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditi
> ons i.flu_vaccine, strata(stp population)
 27. estimates store B
 28. estimates save $Tempdir/multivar3_int_`intvar', replace 
 29. 
. lrtest A B
 30. global multivar3_p_`intvar' = round(r(p),0.001)
 31. 
. }

-------------------------------------------------------------------------------
-> agegroup2 = 18-<60

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    57,603         18 |    57,621 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
       HCQ |    12,486          6 |    12,492 
           |     99.95       0.05 |    100.00 
-----------+----------------------+----------
     Total |    70,089         24 |    70,113 
           |     99.97       0.03 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 60-<70

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    37,615         40 |    37,655 
           |     99.89       0.11 |    100.00 
-----------+----------------------+----------
       HCQ |     7,953          9 |     7,962 
           |     99.89       0.11 |    100.00 
-----------+----------------------+----------
     Total |    45,568         49 |    45,617 
           |     99.89       0.11 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 70-<80

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    41,830        146 |    41,976 
           |     99.65       0.35 |    100.00 
-----------+----------------------+----------
       HCQ |     7,101         24 |     7,125 
           |     99.66       0.34 |    100.00 
-----------+----------------------+----------
     Total |    48,931        170 |    49,101 
           |     99.65       0.35 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 80+

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,217        266 |    26,483 
           |     99.00       1.00 |    100.00 
-----------+----------------------+----------
       HCQ |     2,893         29 |     2,922 
           |     99.01       0.99 |    100.00 
-----------+----------------------+----------
     Total |    29,110        295 |    29,405 
           |     99.00       1.00 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood =  -6540.562
Iteration 2:   log likelihood = -6540.5456
Iteration 3:   log likelihood = -6540.5456
Refining estimates:
Iteration 0:   log likelihood = -6540.5456

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(1)       =        4.49
Log likelihood  =   -6540.5456                  Prob > chi2      =      0.0341

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7664091   .0994371    -2.05   0.040     .5943225    .9883235
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood = -6310.2475
Iteration 2:   log likelihood = -6242.7189
Iteration 3:   log likelihood = -6219.5672
Iteration 4:   log likelihood = -6219.4942
Iteration 5:   log likelihood = -6219.4941
Refining estimates:
Iteration 0:   log likelihood = -6219.4941

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(7)       =      646.59
Log likelihood  =   -6219.4941                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.508341   .7110388     0.87   0.383     .5987413    3.799792
             |
   agegroup2 |
     60-<70  |   3.377282   .9585507     4.29   0.000     1.936318    5.890579
     70-<80  |   11.06172   2.763325     9.62   0.000     6.779293    18.04933
        80+  |   32.30683   7.868223    14.27   0.000     20.04412    52.07169
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .6979434   .4177956    -0.60   0.548      .215915    2.256096
 HCQ#70-<80  |   .6373482   .3316282    -0.87   0.387     .2298662     1.76717
    HCQ#80+  |    .651335   .3324135    -0.84   0.401     .2395453    1.771011
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_agegrou
> p2.ster saved

Likelihood-ratio test                                 LR chi2(6)  =    642.10
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood =  -6302.909
Iteration 2:   log likelihood = -6235.6564
Iteration 3:   log likelihood = -6212.5409
Iteration 4:   log likelihood = -6212.4681
Iteration 5:   log likelihood = -6212.4681
Refining estimates:
Iteration 0:   log likelihood = -6212.4681

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(5)       =      660.65
Log likelihood  =   -6212.4681                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.019756   .1328146     0.15   0.881     .7900134     1.31631
             |
   agegroup2 |
     60-<70  |   3.077215   .7667764     4.51   0.000     1.888237    5.014864
     70-<80  |   9.866062   2.152456    10.49   0.000     6.433379    15.13033
        80+  |   29.23248   6.212379    15.88   0.000     19.27398    44.33635
             |
      1.male |   1.416469   .1260706     3.91   0.000     1.189727    1.686425
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood = -6302.7624
Iteration 2:   log likelihood = -6235.1664
Iteration 3:   log likelihood = -6212.0922
Iteration 4:   log likelihood = -6212.0195
Iteration 5:   log likelihood = -6212.0195
Refining estimates:
Iteration 0:   log likelihood = -6212.0195

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(8)       =      661.54
Log likelihood  =   -6212.0195                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.575629   .7430008     0.96   0.335     .6252636    3.970499
             |
   agegroup2 |
     60-<70  |   3.345959   .9496973     4.26   0.000     1.918318    5.836072
     70-<80  |   10.89801   2.722775     9.56   0.000      6.67854    17.78331
        80+  |   32.18204   7.837902    14.25   0.000     19.96661    51.87078
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .6785696   .4062332    -0.65   0.517     .2099003    2.193692
 HCQ#70-<80  |   .6154277   .3202784    -0.93   0.351     .2219209    1.706695
    HCQ#80+  |   .6227073   .3178966    -0.93   0.353     .2289493    1.693669
             |
      1.male |   1.419028   .1263536     3.93   0.000     1.191786    1.689601
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_ageg
> roup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.90
(Assumption: A nested in B)                           Prob > chi2 =    0.8261

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4392.1848
Iteration 2:   log likelihood = -4316.3325
Iteration 3:   log likelihood = -4299.5487
Iteration 4:   log likelihood = -4299.5018
Iteration 5:   log likelihood = -4299.5018
Refining estimates:
Iteration 0:   log likelihood = -4299.5018

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(7)       =      745.23
Log likelihood  =   -4299.5018                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9819028   .1293615    -0.14   0.890     .7584489    1.271191
             |
   agegroup2 |
     60-<70  |   2.949933    .736597     4.33   0.000     1.808287    4.812345
     70-<80  |   9.096063   1.995026    10.07   0.000     5.917805    13.98126
        80+  |   26.07847   5.582563    15.23   0.000     17.14222    39.67318
             |
      1.male |   1.420295     .12691     3.93   0.000     1.192119    1.692144
  1.dmard_pc |    .886482   .0818955    -1.30   0.192     .7396627    1.062444
1.oral_pr~ne |   2.481657   .2211355    10.20   0.000     2.083977    2.955226
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4391.9931
Iteration 2:   log likelihood = -4315.9158
Iteration 3:   log likelihood = -4299.1075
Iteration 4:   log likelihood = -4299.0587
Iteration 5:   log likelihood = -4299.0587
Refining estimates:
Iteration 0:   log likelihood = -4299.0587

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(10)      =      746.12
Log likelihood  =   -4299.0587                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.500413   .7104978     0.86   0.392      .593113    3.795635
             |
   agegroup2 |
     60-<70  |   3.185823    .905457     4.08   0.000     1.825147    5.560904
     70-<80  |   10.01099    2.51025     9.19   0.000     6.124051    16.36498
        80+  |   28.66303   7.013237    13.71   0.000     17.74398    46.30129
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .7039226   .4218396    -0.59   0.558     .2174831    2.278371
 HCQ#70-<80  |   .6274895   .3271142    -0.89   0.371     .2258758    1.743184
    HCQ#80+  |    .623082   .3187635    -0.92   0.355     .2286007    1.698294
             |
      1.male |   1.422896   .1271963     3.95   0.000     1.194214    1.695369
  1.dmard_pc |   .8846989   .0817486    -1.33   0.185     .7381458    1.060349
1.oral_pr~ne |   2.479478   .2209039    10.19   0.000     2.082208    2.952543
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_ageg
> roup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.89
(Assumption: A nested in B)                           Prob > chi2 =    0.8288

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4652.7717
Iteration 2:   log likelihood = -4318.0474
Iteration 3:   log likelihood = -4247.5141
Iteration 4:   log likelihood = -4246.5657
Iteration 5:   log likelihood = -4246.5648
Refining estimates:
Iteration 0:   log likelihood = -4246.5648

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(20)      =      851.11
Log likelihood  =   -4246.5648                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9871998   .1302568    -0.10   0.922     .7622416    1.278549
             |
   agegroup2 |
     60-<70  |   2.581125   .6530157     3.75   0.000     1.572019    4.237991
     70-<80  |   6.990257   1.607223     8.46   0.000     4.454326    10.96994
        80+  |   17.48365   4.050174    12.35   0.000     11.10317     27.5307
             |
      1.male |    1.30691   .1188579     2.94   0.003     1.093534     1.56192
  1.dmard_pc |   .9810657   .0916931    -0.20   0.838     .8168503    1.178294
1.oral_pr~ne |   2.185378   .2021242     8.45   0.000     1.823054    2.619713
    1.nsaids |   .8333265    .137077    -1.11   0.268     .6036676    1.150357
1.~c_disease |   1.497038   .1405616     4.30   0.000     1.245405    1.799512
1.resp_exc~a |    1.40452   .1381135     3.45   0.001     1.158311    1.703064
             |
egfr_cat_n~s |
      30-59  |     1.2336   .1247044     2.08   0.038     1.011875    1.503911
        <30  |   2.534572   .4979228     4.73   0.000     1.724583    3.724991
             |
1.~r_disease |   1.287813   .4126695     0.79   0.430     .6872141    2.413313
             |
   obese4cat |
Obese I ..)  |   1.063228    .123131     0.53   0.597     .8473248    1.334145
Obese II..)  |   1.258645   .2146715     1.35   0.177     .9009995    1.758257
Obese II..)  |   1.418284   .3566418     1.39   0.165     .8664031    2.321702
             |
1.hyperten~n |   1.089432   .1070188     0.87   0.383     .8986353    1.320738
1.cancer_e~r |   1.269389   .1379915     2.19   0.028     1.025801     1.57082
1.neuro_co~s |   1.756888   .1947684     5.08   0.000     1.413773    2.183273
1.flu_vacc~e |   .8308401   .0890095    -1.73   0.084     .6734829    1.024963
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4652.6736
Iteration 2:   log likelihood = -4317.5753
Iteration 3:   log likelihood = -4247.1244
Iteration 4:   log likelihood = -4246.1401
Iteration 5:   log likelihood = -4246.1392
Refining estimates:
Iteration 0:   log likelihood = -4246.1392

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(23)      =      851.96
Log likelihood  =   -4246.1392                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.498554   .7101178     0.85   0.393     .5919901    3.793413
             |
   agegroup2 |
     60-<70  |   2.788745   .8011149     3.57   0.000     1.588131    4.897011
     70-<80  |   7.690822   2.002673     7.83   0.000     4.616594     12.8122
        80+  |   19.20452   5.002531    11.34   0.000     11.52594    31.99857
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .7046429   .4223232    -0.58   0.559     .2176741    2.281031
 HCQ#70-<80  |   .6316176   .3293907    -0.88   0.378      .227274     1.75533
    HCQ#80+  |   .6288043   .3218531    -0.91   0.365     .2305836    1.714757
             |
      1.male |   1.309372   .1191348     2.96   0.003     1.095508    1.564987
  1.dmard_pc |   .9792042    .091536    -0.22   0.822     .8152729    1.176098
1.oral_pr~ne |   2.183586   .2019312     8.45   0.000     1.821604    2.617501
    1.nsaids |   .8311824   .1367888    -1.12   0.261     .6020228    1.147571
1.~c_disease |   1.496539   .1405024     4.29   0.000     1.245011    1.798884
1.resp_exc~a |   1.405354   .1381865     3.46   0.001     1.159013    1.704053
             |
egfr_cat_n~s |
      30-59  |    1.23401   .1247388     2.08   0.038     1.012222    1.504394
        <30  |   2.532478    .497545     4.73   0.000     1.723113     3.72201
             |
1.~r_disease |   1.287738   .4126419     0.79   0.430      .687178    2.413159
             |
   obese4cat |
Obese I ..)  |   1.062924   .1230946     0.53   0.598     .8470846     1.33376
Obese II..)  |   1.258151   .2146038     1.35   0.178     .9006226    1.757612
Obese II..)  |   1.416365    .356203     1.38   0.166     .8651784    2.318701
             |
1.hyperten~n |   1.088742    .106936     0.87   0.387     .8980907    1.319866
1.cancer_e~r |   1.269112   .1379599     2.19   0.028     1.025579    1.570473
1.neuro_co~s |   1.755352   .1946041     5.08   0.000     1.412528    2.181379
1.flu_vacc~e |   .8290434   .0887492    -1.75   0.080     .6721343    1.022583
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_ageg
> roup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      0.85
(Assumption: A nested in B)                           Prob > chi2 =    0.8372

-------------------------------------------------------------------------------
-> dmard_pc = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   107,790        307 |   108,097 
           |     99.72       0.28 |    100.00 
-----------+----------------------+----------
       HCQ |    14,757         40 |    14,797 
           |     99.73       0.27 |    100.00 
-----------+----------------------+----------
     Total |   122,547        347 |   122,894 
           |     99.72       0.28 |    100.00 

-------------------------------------------------------------------------------
-> dmard_pc = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    55,475        163 |    55,638 
           |     99.71       0.29 |    100.00 
-----------+----------------------+----------
       HCQ |    15,676         28 |    15,704 
           |     99.82       0.18 |    100.00 
-----------+----------------------+----------
     Total |    71,151        191 |    71,342 
           |     99.73       0.27 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood =  -6540.562
Iteration 2:   log likelihood = -6540.5456
Iteration 3:   log likelihood = -6540.5456
Refining estimates:
Iteration 0:   log likelihood = -6540.5456

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(1)       =        4.49
Log likelihood  =   -6540.5456                  Prob > chi2      =      0.0341

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7664091   .0994371    -2.05   0.040     .5943225    .9883235
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood = -6539.1519
Iteration 2:   log likelihood =  -6539.047
Iteration 3:   log likelihood = -6539.0469
Refining estimates:
Iteration 0:   log likelihood = -6539.0469

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(3)       =        7.49
Log likelihood  =   -6539.0469                  Prob > chi2      =      0.0579

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .938381   .1577411    -0.38   0.705     .6749831    1.304564
  1.dmard_pc |   1.026036   .0994372     0.27   0.791     .8485345    1.240669
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .6417195   .1699122    -1.68   0.094     .3819153     1.07826
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_dmard_p
> c.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      3.00
(Assumption: A nested in B)                           Prob > chi2 =    0.2234

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood =  -6302.909
Iteration 2:   log likelihood = -6235.6564
Iteration 3:   log likelihood = -6212.5409
Iteration 4:   log likelihood = -6212.4681
Iteration 5:   log likelihood = -6212.4681
Refining estimates:
Iteration 0:   log likelihood = -6212.4681

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(5)       =      660.65
Log likelihood  =   -6212.4681                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.019756   .1328146     0.15   0.881     .7900134     1.31631
             |
   agegroup2 |
     60-<70  |   3.077215   .7667764     4.51   0.000     1.888237    5.014864
     70-<80  |   9.866062   2.152456    10.49   0.000     6.433379    15.13033
        80+  |   29.23248   6.212379    15.88   0.000     19.27398    44.33635
             |
      1.male |   1.416469   .1260706     3.91   0.000     1.189727    1.686425
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood = -6301.2275
Iteration 2:   log likelihood =  -6233.923
Iteration 3:   log likelihood = -6210.8538
Iteration 4:   log likelihood = -6210.7813
Iteration 5:   log likelihood = -6210.7812
Refining estimates:
Iteration 0:   log likelihood = -6210.7812

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(7)       =      664.02
Log likelihood  =   -6210.7812                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.218323   .2052406     1.17   0.241     .8757246    1.694951
  1.dmard_pc |   .9456278    .091913    -0.58   0.565     .7816012    1.144077
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .6902949   .1828036    -1.40   0.162       .41079    1.159977
             |
   agegroup2 |
     60-<70  |   3.105317   .7742162     4.54   0.000     1.904955    5.062058
     70-<80  |   9.948841   2.172776    10.52   0.000     6.484469    15.26408
        80+  |   29.31334     6.2309    15.89   0.000     19.32557    44.46296
             |
      1.male |   1.426226   .1271165     3.98   0.000      1.19763    1.698455
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_dmar
> d_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      3.37
(Assumption: A nested in B)                           Prob > chi2 =    0.1851

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4392.1848
Iteration 2:   log likelihood = -4316.3325
Iteration 3:   log likelihood = -4299.5487
Iteration 4:   log likelihood = -4299.5018
Iteration 5:   log likelihood = -4299.5018
Refining estimates:
Iteration 0:   log likelihood = -4299.5018

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(7)       =      745.23
Log likelihood  =   -4299.5018                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9819028   .1293615    -0.14   0.890     .7584489    1.271191
             |
   agegroup2 |
     60-<70  |   2.949933    .736597     4.33   0.000     1.808287    4.812345
     70-<80  |   9.096063   1.995026    10.07   0.000     5.917805    13.98126
        80+  |   26.07847   5.582563    15.23   0.000     17.14222    39.67318
             |
      1.male |   1.420295     .12691     3.93   0.000     1.192119    1.692144
  1.dmard_pc |    .886482   .0818955    -1.30   0.192     .7396627    1.062444
1.oral_pr~ne |   2.481657   .2211355    10.20   0.000     2.083977    2.955226
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4391.4454
Iteration 2:   log likelihood = -4315.5596
Iteration 3:   log likelihood = -4298.7902
Iteration 4:   log likelihood = -4298.7434
Iteration 5:   log likelihood = -4298.7434
Refining estimates:
Iteration 0:   log likelihood = -4298.7434

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(8)       =      746.75
Log likelihood  =   -4298.7434                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.130607    .191865     0.72   0.469     .8107036    1.576745
  1.dmard_pc |   .9264987   .0912998    -0.77   0.439     .7637743    1.123892
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .7225112   .1917087    -1.22   0.221     .4295261    1.215345
             |
   agegroup2 |
     60-<70  |   2.946383   .7357254     4.33   0.000     1.806094    4.806602
     70-<80  |   9.068034    1.98906    10.05   0.000     5.899338    13.93872
        80+  |   26.00807   5.567833    15.22   0.000     17.09551     39.5671
             |
      1.male |   1.421485   .1270277     3.94   0.000     1.193099    1.693588
1.oral_pr~ne |   2.472609   .2205021    10.15   0.000     2.076094    2.944854
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_dmar
> d_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      1.52
(Assumption: A nested in B)                           Prob > chi2 =    0.2181

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4652.7717
Iteration 2:   log likelihood = -4318.0474
Iteration 3:   log likelihood = -4247.5141
Iteration 4:   log likelihood = -4246.5657
Iteration 5:   log likelihood = -4246.5648
Refining estimates:
Iteration 0:   log likelihood = -4246.5648

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(20)      =      851.11
Log likelihood  =   -4246.5648                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9871998   .1302568    -0.10   0.922     .7622416    1.278549
             |
   agegroup2 |
     60-<70  |   2.581125   .6530157     3.75   0.000     1.572019    4.237991
     70-<80  |   6.990257   1.607223     8.46   0.000     4.454326    10.96994
        80+  |   17.48365   4.050174    12.35   0.000     11.10317     27.5307
             |
      1.male |    1.30691   .1188579     2.94   0.003     1.093534     1.56192
  1.dmard_pc |   .9810657   .0916931    -0.20   0.838     .8168503    1.178294
1.oral_pr~ne |   2.185378   .2021242     8.45   0.000     1.823054    2.619713
    1.nsaids |   .8333265    .137077    -1.11   0.268     .6036676    1.150357
1.~c_disease |   1.497038   .1405616     4.30   0.000     1.245405    1.799512
1.resp_exc~a |    1.40452   .1381135     3.45   0.001     1.158311    1.703064
             |
egfr_cat_n~s |
      30-59  |     1.2336   .1247044     2.08   0.038     1.011875    1.503911
        <30  |   2.534572   .4979228     4.73   0.000     1.724583    3.724991
             |
1.~r_disease |   1.287813   .4126695     0.79   0.430     .6872141    2.413313
             |
   obese4cat |
Obese I ..)  |   1.063228    .123131     0.53   0.597     .8473248    1.334145
Obese II..)  |   1.258645   .2146715     1.35   0.177     .9009995    1.758257
Obese II..)  |   1.418284   .3566418     1.39   0.165     .8664031    2.321702
             |
1.hyperten~n |   1.089432   .1070188     0.87   0.383     .8986353    1.320738
1.cancer_e~r |   1.269389   .1379915     2.19   0.028     1.025801     1.57082
1.neuro_co~s |   1.756888   .1947684     5.08   0.000     1.413773    2.183273
1.flu_vacc~e |   .8308401   .0890095    -1.73   0.084     .6734829    1.024963
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4652.1379
Iteration 2:   log likelihood = -4317.1163
Iteration 3:   log likelihood = -4246.6278
Iteration 4:   log likelihood = -4245.6841
Iteration 5:   log likelihood = -4245.6832
Refining estimates:
Iteration 0:   log likelihood = -4245.6832

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(21)      =      852.87
Log likelihood  =   -4245.6832                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.150306   .1954267     0.82   0.410     .8245215    1.604815
  1.dmard_pc |   1.029239    .102513     0.29   0.772     .8467123    1.251113
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .7043855   .1869625    -1.32   0.187      .418677    1.185064
             |
   agegroup2 |
     60-<70  |   2.578736   .6524339     3.74   0.000     1.570537    4.234141
     70-<80  |   6.972899   1.603358     8.45   0.000     4.443108    10.94309
        80+  |   17.44865   4.042425    12.34   0.000      11.0805    27.47669
             |
      1.male |   1.307873   .1189698     2.95   0.003     1.094301    1.563128
1.oral_pr~ne |   2.176892   .2014212     8.41   0.000     1.815841    2.609732
    1.nsaids |    .832627   .1369622    -1.11   0.265     .6031604    1.149392
1.~c_disease |    1.49806   .1406667     4.30   0.000     1.246242    1.800763
1.resp_exc~a |   1.405444   .1381602     3.46   0.001     1.159144    1.704079
             |
egfr_cat_n~s |
      30-59  |   1.232106   .1245821     2.06   0.039     1.010603    1.502159
        <30  |   2.533385   .4976959     4.73   0.000     1.723767    3.723264
             |
1.~r_disease |   1.286818   .4123612     0.79   0.431     .6866718    2.411487
             |
   obese4cat |
Obese I ..)  |   1.063181   .1231279     0.53   0.597     .8472841    1.334092
Obese II..)  |   1.260295   .2149761     1.36   0.175      .902148    1.760625
Obese II..)  |   1.419996   .3570828     1.39   0.163     .8674365    2.324538
             |
1.hyperten~n |   1.089254   .1069868     0.87   0.384     .8985121    1.320488
1.cancer_e~r |   1.269694   .1380265     2.20   0.028     1.026045    1.571202
1.neuro_co~s |   1.758651   .1949472     5.09   0.000     1.415218    2.185424
1.flu_vacc~e |    .828121   .0887506    -1.76   0.078     .6712274    1.021687
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_dmar
> d_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      1.76
(Assumption: A nested in B)                           Prob > chi2 =    0.1842

-------------------------------------------------------------------------------
-> oral_prednisolone = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,718        290 |   137,008 
           |     99.79       0.21 |    100.00 
-----------+----------------------+----------
       HCQ |    23,598         37 |    23,635 
           |     99.84       0.16 |    100.00 
-----------+----------------------+----------
     Total |   160,316        327 |   160,643 
           |     99.80       0.20 |    100.00 

-------------------------------------------------------------------------------
-> oral_prednisolone = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,547        180 |    26,727 
           |     99.33       0.67 |    100.00 
-----------+----------------------+----------
       HCQ |     6,835         31 |     6,866 
           |     99.55       0.45 |    100.00 
-----------+----------------------+----------
     Total |    33,382        211 |    33,593 
           |     99.37       0.63 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood =  -6540.562
Iteration 2:   log likelihood = -6540.5456
Iteration 3:   log likelihood = -6540.5456
Refining estimates:
Iteration 0:   log likelihood = -6540.5456

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(1)       =        4.49
Log likelihood  =   -6540.5456                  Prob > chi2      =      0.0341

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7664091   .0994371    -2.05   0.040     .5943225    .9883235
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood = -6481.6991
Iteration 2:   log likelihood = -6465.4448
Iteration 3:   log likelihood = -6465.4104
Iteration 4:   log likelihood = -6465.4104
Refining estimates:
Iteration 0:   log likelihood = -6465.4104

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(3)       =      154.76
Log likelihood  =   -6465.4104                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7300683   .1274493    -1.80   0.072     .5185226     1.02792
1.oral_pr~ne |   3.215374   .3051026    12.31   0.000     2.669698    3.872585
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9024447   .2358282    -0.39   0.694     .5407336    1.506114
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_oral_pr
> ednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    150.27
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood =  -6302.909
Iteration 2:   log likelihood = -6235.6564
Iteration 3:   log likelihood = -6212.5409
Iteration 4:   log likelihood = -6212.4681
Iteration 5:   log likelihood = -6212.4681
Refining estimates:
Iteration 0:   log likelihood = -6212.4681

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(5)       =      660.65
Log likelihood  =   -6212.4681                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.019756   .1328146     0.15   0.881     .7900134     1.31631
             |
   agegroup2 |
     60-<70  |   3.077215   .7667764     4.51   0.000     1.888237    5.014864
     70-<80  |   9.866062   2.152456    10.49   0.000     6.433379    15.13033
        80+  |   29.23248   6.212379    15.88   0.000     19.27398    44.33635
             |
      1.male |   1.416469   .1260706     3.91   0.000     1.189727    1.686425
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood = -6272.9453
Iteration 2:   log likelihood = -6188.8381
Iteration 3:   log likelihood = -6164.9944
Iteration 4:   log likelihood = -6164.9178
Iteration 5:   log likelihood = -6164.9177
Refining estimates:
Iteration 0:   log likelihood = -6164.9177

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(7)       =      755.75
Log likelihood  =   -6164.9177                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9613977   .1682486    -0.22   0.822     .6822432    1.354774
1.oral_pr~ne |   2.480374   .2360089     9.55   0.000     2.058377    2.988887
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |    .976894   .2553036    -0.09   0.929      .585319    1.630431
             |
   agegroup2 |
     60-<70  |   2.921359   .7282435     4.30   0.000     1.792236    4.761837
     70-<80  |     8.9576     1.9575    10.03   0.000     5.836856    13.74688
        80+  |   25.95564   5.529884    15.28   0.000     17.09551    39.40773
             |
      1.male |   1.407174   .1252518     3.84   0.000     1.181906    1.675378
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_oral
> _prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     95.10
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4392.1848
Iteration 2:   log likelihood = -4316.3325
Iteration 3:   log likelihood = -4299.5487
Iteration 4:   log likelihood = -4299.5018
Iteration 5:   log likelihood = -4299.5018
Refining estimates:
Iteration 0:   log likelihood = -4299.5018

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(7)       =      745.23
Log likelihood  =   -4299.5018                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9819028   .1293615    -0.14   0.890     .7584489    1.271191
             |
   agegroup2 |
     60-<70  |   2.949933    .736597     4.33   0.000     1.808287    4.812345
     70-<80  |   9.096063   1.995026    10.07   0.000     5.917805    13.98126
        80+  |   26.07847   5.582563    15.23   0.000     17.14222    39.67318
             |
      1.male |   1.420295     .12691     3.93   0.000     1.192119    1.692144
  1.dmard_pc |    .886482   .0818955    -1.30   0.192     .7396627    1.062444
1.oral_pr~ne |   2.481657   .2211355    10.20   0.000     2.083977    2.955226
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4395.1968
Iteration 2:   log likelihood = -4316.5843
Iteration 3:   log likelihood = -4299.5437
Iteration 4:   log likelihood = -4299.4958
Iteration 5:   log likelihood = -4299.4958
Refining estimates:
Iteration 0:   log likelihood = -4299.4958

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(8)       =      745.24
Log likelihood  =   -4299.4958                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9946484   .1753235    -0.03   0.976     .7040946    1.405103
1.oral_pr~ne |   2.491075   .2380307     9.55   0.000     2.065625    3.004153
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9717533   .2543526    -0.11   0.913     .5817782    1.623135
             |
   agegroup2 |
     60-<70  |   2.949407   .7364795     4.33   0.000     1.807948    4.811531
     70-<80  |   9.095345   1.994881    10.07   0.000     5.917322    13.98019
        80+  |   26.07739   5.582389    15.23   0.000     17.14144    39.67171
             |
      1.male |   1.420482   .1269387     3.93   0.000     1.192257    1.692395
  1.dmard_pc |   .8861994   .0819139    -1.31   0.191     .7393542     1.06221
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_oral
> _prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.01
(Assumption: A nested in B)                           Prob > chi2 =    0.9128

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4652.7717
Iteration 2:   log likelihood = -4318.0474
Iteration 3:   log likelihood = -4247.5141
Iteration 4:   log likelihood = -4246.5657
Iteration 5:   log likelihood = -4246.5648
Refining estimates:
Iteration 0:   log likelihood = -4246.5648

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(20)      =      851.11
Log likelihood  =   -4246.5648                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9871998   .1302568    -0.10   0.922     .7622416    1.278549
             |
   agegroup2 |
     60-<70  |   2.581125   .6530157     3.75   0.000     1.572019    4.237991
     70-<80  |   6.990257   1.607223     8.46   0.000     4.454326    10.96994
        80+  |   17.48365   4.050174    12.35   0.000     11.10317     27.5307
             |
      1.male |    1.30691   .1188579     2.94   0.003     1.093534     1.56192
  1.dmard_pc |   .9810657   .0916931    -0.20   0.838     .8168503    1.178294
1.oral_pr~ne |   2.185378   .2021242     8.45   0.000     1.823054    2.619713
    1.nsaids |   .8333265    .137077    -1.11   0.268     .6036676    1.150357
1.~c_disease |   1.497038   .1405616     4.30   0.000     1.245405    1.799512
1.resp_exc~a |    1.40452   .1381135     3.45   0.001     1.158311    1.703064
             |
egfr_cat_n~s |
      30-59  |     1.2336   .1247044     2.08   0.038     1.011875    1.503911
        <30  |   2.534572   .4979228     4.73   0.000     1.724583    3.724991
             |
1.~r_disease |   1.287813   .4126695     0.79   0.430     .6872141    2.413313
             |
   obese4cat |
Obese I ..)  |   1.063228    .123131     0.53   0.597     .8473248    1.334145
Obese II..)  |   1.258645   .2146715     1.35   0.177     .9009995    1.758257
Obese II..)  |   1.418284   .3566418     1.39   0.165     .8664031    2.321702
             |
1.hyperten~n |   1.089432   .1070188     0.87   0.383     .8986353    1.320738
1.cancer_e~r |   1.269389   .1379915     2.19   0.028     1.025801     1.57082
1.neuro_co~s |   1.756888   .1947684     5.08   0.000     1.413773    2.183273
1.flu_vacc~e |   .8308401   .0890095    -1.73   0.084     .6734829    1.024963
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4655.9133
Iteration 2:   log likelihood = -4318.5371
Iteration 3:   log likelihood =  -4247.512
Iteration 4:   log likelihood = -4246.5592
Iteration 5:   log likelihood = -4246.5583
Refining estimates:
Iteration 0:   log likelihood = -4246.5583

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(21)      =      851.12
Log likelihood  =   -4246.5583                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.000545   .1765892     0.00   0.998     .7079551     1.41406
1.oral_pr~ne |   2.194061   .2167586     7.95   0.000     1.807822    2.662819
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9706404   .2540786    -0.11   0.909     .5810915    1.621333
             |
   agegroup2 |
     60-<70  |   2.580768   .6529307     3.75   0.000     1.571796    4.237423
     70-<80  |   6.990065   1.607178     8.46   0.000     4.454206    10.96963
        80+  |   17.48424   4.050332    12.35   0.000     11.10352    27.53169
             |
      1.male |   1.307155   .1188994     2.94   0.003     1.093708    1.562258
  1.dmard_pc |   .9807477   .0917094    -0.21   0.835     .8165103    1.178021
    1.nsaids |   .8332354    .137065    -1.11   0.267     .6035973    1.150239
1.~c_disease |   1.497066   .1405644     4.30   0.000     1.245429    1.799546
1.resp_exc~a |   1.404361   .1381025     3.45   0.001     1.158171    1.702881
             |
egfr_cat_n~s |
      30-59  |   1.233692   .1247147     2.08   0.038     1.011948    1.504026
        <30  |   2.534281   .4978697     4.73   0.000      1.72438    3.724576
             |
1.~r_disease |   1.287799   .4126657     0.79   0.430     .6872056    2.413289
             |
   obese4cat |
Obese I ..)  |   1.063202   .1231274     0.53   0.597     .8473049    1.334111
Obese II..)  |   1.258547   .2146567     1.35   0.178     .9009262    1.758125
Obese II..)  |   1.418502   .3566996     1.39   0.164     .8665323    2.322068
             |
1.hyperten~n |    1.08942   .1070167     0.87   0.383     .8986267    1.320721
1.cancer_e~r |   1.269396   .1379924     2.19   0.028     1.025806    1.570828
1.neuro_co~s |   1.756872   .1947654     5.08   0.000     1.413763    2.183251
1.flu_vacc~e |   .8307478   .0890027    -1.73   0.083     .6734031    1.024857
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_oral
> _prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.01
(Assumption: A nested in B)                           Prob > chi2 =    0.9093

-------------------------------------------------------------------------------
-> nsaids = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,685        436 |   137,121 
           |     99.68       0.32 |    100.00 
-----------+----------------------+----------
       HCQ |    23,799         60 |    23,859 
           |     99.75       0.25 |    100.00 
-----------+----------------------+----------
     Total |   160,484        496 |   160,980 
           |     99.69       0.31 |    100.00 

-------------------------------------------------------------------------------
-> nsaids = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,580         34 |    26,614 
           |     99.87       0.13 |    100.00 
-----------+----------------------+----------
       HCQ |     6,634          8 |     6,642 
           |     99.88       0.12 |    100.00 
-----------+----------------------+----------
     Total |    33,214         42 |    33,256 
           |     99.87       0.13 |    100.00 


         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood =  -6540.562
Iteration 2:   log likelihood = -6540.5456
Iteration 3:   log likelihood = -6540.5456
Refining estimates:
Iteration 0:   log likelihood = -6540.5456

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(1)       =        4.49
Log likelihood  =   -6540.5456                  Prob > chi2      =      0.0341

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7664091   .0994371    -2.05   0.040     .5943225    .9883235
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood = -6522.2397
Iteration 2:   log likelihood = -6521.1245
Iteration 3:   log likelihood = -6521.1158
Iteration 4:   log likelihood = -6521.1158
Refining estimates:
Iteration 0:   log likelihood = -6521.1158

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(3)       =       43.35
Log likelihood  =   -6521.1158                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7808497   .1075201    -1.80   0.072     .5961564    1.022762
    1.nsaids |   .4014621   .0714843    -5.13   0.000     .2831912    .5691274
             |
    exposure#|
      nsaids |
      HCQ#1  |    1.18944   .4952587     0.42   0.677       .52592    2.690083
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_int_nsaids.
> ster saved

Likelihood-ratio test                                 LR chi2(2)  =     38.86
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood =  -6302.909
Iteration 2:   log likelihood = -6235.6564
Iteration 3:   log likelihood = -6212.5409
Iteration 4:   log likelihood = -6212.4681
Iteration 5:   log likelihood = -6212.4681
Refining estimates:
Iteration 0:   log likelihood = -6212.4681

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(5)       =      660.65
Log likelihood  =   -6212.4681                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.019756   .1328146     0.15   0.881     .7900134     1.31631
             |
   agegroup2 |
     60-<70  |   3.077215   .7667764     4.51   0.000     1.888237    5.014864
     70-<80  |   9.866062   2.152456    10.49   0.000     6.433379    15.13033
        80+  |   29.23248   6.212379    15.88   0.000     19.27398    44.33635
             |
      1.male |   1.416469   .1260706     3.91   0.000     1.189727    1.686425
------------------------------------------------------------------------------

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.7911
Iteration 1:   log likelihood = -6300.7655
Iteration 2:   log likelihood = -6233.2368
Iteration 3:   log likelihood = -6210.1714
Iteration 4:   log likelihood = -6210.0989
Iteration 5:   log likelihood = -6210.0989
Refining estimates:
Iteration 0:   log likelihood = -6210.0989

Cox regression -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(7)       =      665.38
Log likelihood  =   -6210.0989                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.006925   .1390542     0.05   0.960     .7681534    1.319916
    1.nsaids |   .6950944   .1249176    -2.02   0.043     .4887329    .9885893
             |
    exposure#|
      nsaids |
      HCQ#1  |    1.20506   .5018251     0.45   0.654     .5327719    2.725687
             |
   agegroup2 |
     60-<70  |   3.067008   .7643044     4.50   0.000     1.881888    4.998458
     70-<80  |   9.637709   2.105512    10.37   0.000     6.280803    14.78878
        80+  |   27.94793    5.96636    15.60   0.000     18.39222    42.46834
             |
      1.male |   1.415823   .1260165     3.91   0.000     1.189179    1.685664
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_int_nsai
> ds.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      4.74
(Assumption: A nested in B)                           Prob > chi2 =    0.0936

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4392.1848
Iteration 2:   log likelihood = -4316.3325
Iteration 3:   log likelihood = -4299.5487
Iteration 4:   log likelihood = -4299.5018
Iteration 5:   log likelihood = -4299.5018
Refining estimates:
Iteration 0:   log likelihood = -4299.5018

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(7)       =      745.23
Log likelihood  =   -4299.5018                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9819028   .1293615    -0.14   0.890     .7584489    1.271191
             |
   agegroup2 |
     60-<70  |   2.949933    .736597     4.33   0.000     1.808287    4.812345
     70-<80  |   9.096063   1.995026    10.07   0.000     5.917805    13.98126
        80+  |   26.07847   5.582563    15.23   0.000     17.14222    39.67318
             |
      1.male |   1.420295     .12691     3.93   0.000     1.192119    1.692144
  1.dmard_pc |    .886482   .0818955    -1.30   0.192     .7396627    1.062444
1.oral_pr~ne |   2.481657   .2211355    10.20   0.000     2.083977    2.955226
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4390.5063
Iteration 2:   log likelihood = -4314.3101
Iteration 3:   log likelihood = -4297.5929
Iteration 4:   log likelihood = -4297.5464
Iteration 5:   log likelihood = -4297.5464
Refining estimates:
Iteration 0:   log likelihood = -4297.5464

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(9)       =      749.14
Log likelihood  =   -4297.5464                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9663897   .1348662    -0.24   0.806     .7351254    1.270408
    1.nsaids |   .7147253   .1288968    -1.86   0.063     .5019143    1.017768
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.224491   .5101896     0.49   0.627     .5411265    2.770847
             |
   agegroup2 |
     60-<70  |   2.929697   .7317509     4.30   0.000     1.795635    4.779995
     70-<80  |   8.861781    1.94818     9.92   0.000       5.7596    13.63483
        80+  |   24.92027   5.367076    14.93   0.000     16.33916    38.00808
             |
      1.male |   1.419601   .1268526     3.92   0.000      1.19153    1.691328
  1.dmard_pc |   .8928233   .0825479    -1.23   0.220     .7448449    1.070201
1.oral_pr~ne |   2.481022   .2211188    10.20   0.000     2.083378    2.954563
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_int_nsai
> ds.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      3.91
(Assumption: A nested in B)                           Prob > chi2 =    0.1415

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4652.7717
Iteration 2:   log likelihood = -4318.0474
Iteration 3:   log likelihood = -4247.5141
Iteration 4:   log likelihood = -4246.5657
Iteration 5:   log likelihood = -4246.5648
Refining estimates:
Iteration 0:   log likelihood = -4246.5648

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(20)      =      851.11
Log likelihood  =   -4246.5648                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9871998   .1302568    -0.10   0.922     .7622416    1.278549
             |
   agegroup2 |
     60-<70  |   2.581125   .6530157     3.75   0.000     1.572019    4.237991
     70-<80  |   6.990257   1.607223     8.46   0.000     4.454326    10.96994
        80+  |   17.48365   4.050174    12.35   0.000     11.10317     27.5307
             |
      1.male |    1.30691   .1188579     2.94   0.003     1.093534     1.56192
  1.dmard_pc |   .9810657   .0916931    -0.20   0.838     .8168503    1.178294
1.oral_pr~ne |   2.185378   .2021242     8.45   0.000     1.823054    2.619713
    1.nsaids |   .8333265    .137077    -1.11   0.268     .6036676    1.150357
1.~c_disease |   1.497038   .1405616     4.30   0.000     1.245405    1.799512
1.resp_exc~a |    1.40452   .1381135     3.45   0.001     1.158311    1.703064
             |
egfr_cat_n~s |
      30-59  |     1.2336   .1247044     2.08   0.038     1.011875    1.503911
        <30  |   2.534572   .4979228     4.73   0.000     1.724583    3.724991
             |
1.~r_disease |   1.287813   .4126695     0.79   0.430     .6872141    2.413313
             |
   obese4cat |
Obese I ..)  |   1.063228    .123131     0.53   0.597     .8473248    1.334145
Obese II..)  |   1.258645   .2146715     1.35   0.177     .9009995    1.758257
Obese II..)  |   1.418284   .3566418     1.39   0.165     .8664031    2.321702
             |
1.hyperten~n |   1.089432   .1070188     0.87   0.383     .8986353    1.320738
1.cancer_e~r |   1.269389   .1379915     2.19   0.028     1.025801     1.57082
1.neuro_co~s |   1.756888   .1947684     5.08   0.000     1.413773    2.183273
1.flu_vacc~e |   .8308401   .0890095    -1.73   0.084     .6734829    1.024963
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4672.1179
Iteration 1:   log likelihood = -4652.6775
Iteration 2:   log likelihood = -4317.9438
Iteration 3:   log likelihood = -4247.4205
Iteration 4:   log likelihood = -4246.4715
Iteration 5:   log likelihood = -4246.4706
Refining estimates:
Iteration 0:   log likelihood = -4246.4706

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,236                  Number of obs    =     194,236
No. of failures =          538
Time at risk    =     22940752
                                                LR chi2(21)      =      851.29
Log likelihood  =   -4246.4706                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9685456    .135335    -0.23   0.819     .7365149    1.273675
    1.nsaids |   .8074092   .1464441    -1.18   0.238     .5658572    1.152075
             |
    exposure#|
      nsaids |
      HCQ#1  |   1.201502   .5006649     0.44   0.660     .5309209    2.719064
             |
   agegroup2 |
     60-<70  |   2.584012   .6537851     3.75   0.000     1.573732    4.242858
     70-<80  |   7.000288   1.609811     8.46   0.000     4.460367    10.98655
        80+  |   17.50481   4.056041    12.35   0.000     11.11541    27.56699
             |
      1.male |   1.307467   .1189159     2.95   0.003     1.093988    1.562603
  1.dmard_pc |   .9811575   .0917097    -0.20   0.839     .8169136    1.178423
1.oral_pr~ne |   2.185972   .2021807     8.46   0.000     1.823547    2.620428
1.~c_disease |   1.497015   .1405564     4.30   0.000     1.245392    1.799478
1.resp_exc~a |   1.404418   .1381007     3.45   0.001     1.158231    1.702933
             |
egfr_cat_n~s |
      30-59  |   1.233649   .1247065     2.08   0.038     1.011919    1.503964
        <30  |    2.53337    .497693     4.73   0.000     1.723756    3.723243
             |
1.~r_disease |   1.287617   .4126099     0.79   0.430     .6871057    2.412957
             |
   obese4cat |
Obese I ..)  |    1.06283   .1230877     0.53   0.599      .847003    1.333652
Obese II..)  |   1.259227    .214775     1.35   0.177     .9014098    1.759081
Obese II..)  |   1.417947   .3565646     1.39   0.165      .866188    2.321174
             |
1.hyperten~n |   1.089379   .1070174     0.87   0.384     .8985854    1.320683
1.cancer_e~r |   1.269213   .1379712     2.19   0.028      1.02566    1.570599
1.neuro_co~s |   1.756774   .1947589     5.08   0.000     1.413677    2.183139
1.flu_vacc~e |   .8310487   .0890289    -1.73   0.084     .6736566    1.025214
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_int_nsai
> ds.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.19
(Assumption: A nested in B)                           Prob > chi2 =    0.6643

. 
. 
. 
. 
. 
. 
. /* Print interaction table===================================================
> =*/ 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table3.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 3: Interactions with HCQ use on risk of $tabl
> eoutcome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab _tab ("Age/
> Sex Adjusted") _tab _tab _tab  ///
>                                                 ("DAG Adjusted") _tab _tab _t
> ab ("Fully Adjusted") _tab _tab _tab _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("p (interactio
> n)") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("p (interact
> ion)") _tab ("HR") _tab ("95% CI") _tab ("p (interaction)") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab (
> "p (interaction)") _tab _n

. 
.                                                 
. * Generic program to print model for a level of another variable 
. cap prog drop printinteraction

. prog define printinteraction 
  1. syntax, variable(varname) min(real) max(real) 
  2. 
. * Overall p-values 
. 
. file write tablecontent ("`variable'") _tab _tab _tab _tab ("${univar_p_`vari
> able'}") ///
>                                                 _tab _tab _tab ("${multivar1_
> p_`variable'}") /// 
>                                                 _tab _tab _tab ("${multivar2_
> p_`variable'}") ///
>                                                 _tab _tab _tab ("${multivar3_
> p_`variable'}") _n
  3.         forvalues varlevel = `min'/`max'{ 
  4. 
.                 * Row headings 
.                                                         
.                 file write tablecontent ("`varlevel'") _n       
  5. 
.                 local lab0: label exposure 0
  6.                 local lab1: label exposure 1
  7.                  
.                 /* Counts */
.                         
.                 * First row, exposure = 0 (reference)
.                 
.         file write tablecontent ("`lab0'") _tab
  8. 
.                         cou if exposure == 0 & `variable' == `varlevel'
  9.                         local rowdenom = r(N)
 10.                         cou if exposure == 0  & `variable' == `varlevel' &
>  $outcome == 1
 11.                         local pct = 100*(r(N)/`rowdenom')
 12.                         
.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 13.                 file write tablecontent ("1.00 (ref)") _tab _tab _tab ("1.
> 00 (ref)") _tab _tab _tab ("1.00 (ref)") _tab _tab _tab ("1.00 (ref)") _n
 14.                         
.                 * Second row, exposure = 1 (comparator)
. 
.                 file write tablecontent ("`lab1'") _tab  
 15. 
.                         cou if exposure == 1 & `variable' == `varlevel'
 16.                         local rowdenom = r(N)
 17.                         cou if exposure == 1 & `variable' == `varlevel' & 
> $outcome == 1
 18.                         local pct = 100*(r(N)/`rowdenom')
 19.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 20. 
.                 * Print models 
.                 estimates use $Tempdir/univar_int_`variable' 
 21.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 22.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 23. 
.                 estimates use $Tempdir/multivar1_int_`variable'
 24.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 25.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 26. 
.                 estimates use $Tempdir/multivar2_int_`variable'
 27.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 28.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab 
 29.         
.                 estimates use $Tempdir/multivar3_int_`variable'
 30.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 31.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _n
 32.         } 
 33.                 
. end

. 
. printinteraction, variable(agegroup2) min(3) max(6) 
  57,621
  18
  12,492
  6
  37,655
  40
  7,962
  9
  41,976
  146
  7,125
  24
  26,483
  266
  2,922
  29

. file write tablecontent _n _n

. 
. printinteraction, variable(dmard_pc) min(0) max(1) 
  108,097
  307
  14,797
  40
  55,638
  163
  15,704
  28

. file write tablecontent _n _n

.   
. printinteraction, variable(oral_prednisolone) min(0) max(1) 
  137,008
  290
  23,635
  37
  26,727
  180
  6,866
  31

. file write tablecontent _n _n

. 
. printinteraction, variable(nsaids) min(0) max(1) 
  137,121
  436
  23,859
  60
  26,614
  34
  6,642
  8

. 
. 
. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\07_an_models_in
> teract.log
  log type:  text
 closed on:  19 Jul 2020, 18:10:21
-------------------------------------------------------------------------------
