-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\10_an_models_et
> hnicity.log
  log type:  text
 opened on:  21 Jul 2020, 13:22:08

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. drop if ethnicity == .u
(45,264 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   125,212        352 |   125,564 
           |     99.72       0.28 |    100.00 
-----------+----------------------+----------
       HCQ |    23,411         47 |    23,458 
           |     99.80       0.20 |    100.00 
-----------+----------------------+----------
     Total |   148,623        399 |   149,022 
           |     99.73       0.27 |    100.00 

. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4746.6209
Iteration 1:   log likelihood = -4743.8887
Iteration 2:   log likelihood = -4743.8552
Iteration 3:   log likelihood = -4743.8552
Refining estimates:
Iteration 0:   log likelihood = -4743.8552

Cox regression -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =          399
Time at risk    =     17599758
                                                LR chi2(1)       =        5.53
Log likelihood  =   -4743.8552                  Prob > chi2      =      0.0187

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7051049   .1095015    -2.25   0.024     .5200723     .955969
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar.ster saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4746.6209
Iteration 1:   log likelihood = -4531.6359
Iteration 2:   log likelihood = -4481.2059
Iteration 3:   log likelihood = -4476.4566
Iteration 4:   log likelihood = -4475.6582
Iteration 5:   log likelihood = -4475.5794
Iteration 6:   log likelihood = -4475.5783
Iteration 7:   log likelihood = -4475.5783
Refining estimates:
Iteration 0:   log likelihood = -4475.5783

Cox regression -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =          399
Time at risk    =     17599758
                                                LR chi2(5)       =      542.09
Log likelihood  =   -4475.5783                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9791686   .1530242    -0.13   0.893     .7208284    1.330096
      1.male |   1.460758   .1511934     3.66   0.000     1.192548    1.789289
        age1 |   1.078489   .0529931     1.54   0.124     .9794693     1.18752
        age2 |   1.057439   .0726588     0.81   0.416     .9242037    1.209883
        age3 |   .7704048   .1962722    -1.02   0.306     .4675871    1.269332
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1.ster sav
> ed

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3375.6578
Iteration 1:   log likelihood = -3339.7719
Iteration 2:   log likelihood = -3087.9887
Iteration 3:   log likelihood = -3075.0574
Iteration 4:   log likelihood = -3074.6402
Iteration 5:   log likelihood = -3074.6388
Iteration 6:   log likelihood = -3074.6388
Refining estimates:
Iteration 0:   log likelihood = -3074.6388

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =          399
Time at risk    =     17599758
                                                LR chi2(7)       =      602.04
Log likelihood  =   -3074.6388                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .934148    .147334    -0.43   0.666     .6857471    1.272528
      1.male |   1.466453   .1523468     3.69   0.000     1.196296    1.797619
        age1 |   1.081403   .0536163     1.58   0.114     .9812618    1.191765
        age2 |   1.045194   .0723518     0.64   0.523     .9125861    1.197071
        age3 |   .8121092   .2083726    -0.81   0.417      .491147    1.342819
  1.dmard_pc |    .888992   .0970111    -1.08   0.281     .7178119    1.100994
1.oral_pr~ne |   2.471067   .2561375     8.73   0.000     2.016757    3.027718
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2.ster sav
> ed

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine, strata(stp population) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3375.6578
Iteration 1:   log likelihood = -3097.3761
Iteration 2:   log likelihood = -3039.9204
Iteration 3:   log likelihood = -3035.7222
Iteration 4:   log likelihood = -3035.0842
Iteration 5:   log likelihood = -3035.0308
Iteration 6:   log likelihood = -3035.0303
Iteration 7:   log likelihood = -3035.0303
Refining estimates:
Iteration 0:   log likelihood = -3035.0303

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =          399
Time at risk    =     17599758
                                                LR chi2(20)      =      681.26
Log likelihood  =   -3035.0303                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9264965   .1463341    -0.48   0.629     .6798327    1.262657
      1.male |   1.360589   .1439635     2.91   0.004     1.105762    1.674142
        age1 |   1.082586   .0545983     1.57   0.116     .9806941    1.195064
        age2 |   1.024029   .0720314     0.34   0.736     .8921494    1.175403
        age3 |   .8798683   .2292261    -0.49   0.623     .5280316     1.46614
  1.dmard_pc |   .9747399    .107434    -0.23   0.816     .7853639     1.20978
1.oral_pr~ne |   2.145458   .2309001     7.09   0.000     1.737447    2.649285
    1.nsaids |   .8281642   .1611615    -0.97   0.333     .5655512    1.212721
1.~c_disease |   1.440362   .1569182     3.35   0.001     1.163426    1.783218
1.resp_exc~a |   1.527852   .1717352     3.77   0.000     1.225755    1.904403
             |
egfr_cat_n~s |
      30-59  |   1.280288   .1498853     2.11   0.035     1.017785    1.610494
        <30  |   2.318848   .5354623     3.64   0.000     1.474739    3.646108
             |
1.~r_disease |   1.200559   .4595779     0.48   0.633     .5669449    2.542297
             |
   obese4cat |
Obese I ..)  |    1.05002   .1430917     0.36   0.720     .8038964    1.371499
Obese II..)  |   1.347952   .2640238     1.52   0.127     .9182255    1.978789
Obese II..)  |   1.672654    .467655     1.84   0.066     .9669855    2.893293
             |
1.hyperten~n |   1.098341   .1263856     0.82   0.415     .8765767     1.37621
1.cancer_e~r |   1.235488   .1567043     1.67   0.095     .9635528    1.584169
1.neuro_co~s |   1.691267   .2173722     4.09   0.000     1.314651    2.175775
1.flu_vacc~e |   .8367443   .1048952    -1.42   0.155     .6544632    1.069794
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3.ster sav
> ed

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4746.6209
Iteration 1:   log likelihood = -4743.8887
Iteration 2:   log likelihood = -4743.8552
Iteration 3:   log likelihood = -4743.8552
Refining estimates:
Iteration 0:   log likelihood = -4743.8552

Cox regression -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =          399
Time at risk    =     17599758
                                                LR chi2(1)       =        5.53
Log likelihood  =   -4743.8552                  Prob > chi2      =      0.0187

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7051049   .1095015    -2.25   0.024     .5200723     .955969
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_eth.ster sa
> ved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4746.6209
Iteration 1:   log likelihood = -4531.6359
Iteration 2:   log likelihood = -4481.2059
Iteration 3:   log likelihood = -4476.4566
Iteration 4:   log likelihood = -4475.6582
Iteration 5:   log likelihood = -4475.5794
Iteration 6:   log likelihood = -4475.5783
Iteration 7:   log likelihood = -4475.5783
Refining estimates:
Iteration 0:   log likelihood = -4475.5783

Cox regression -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =          399
Time at risk    =     17599758
                                                LR chi2(5)       =      542.09
Log likelihood  =   -4475.5783                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9791686   .1530242    -0.13   0.893     .7208284    1.330096
      1.male |   1.460758   .1511934     3.66   0.000     1.192548    1.789289
        age1 |   1.078489   .0529931     1.54   0.124     .9794693     1.18752
        age2 |   1.057439   .0726588     0.81   0.416     .9242037    1.209883
        age3 |   .7704048   .1962722    -1.02   0.306     .4675871    1.269332
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_eth.ster
>  saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp population)                               

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3375.6578
Iteration 1:   log likelihood = -3338.5334
Iteration 2:   log likelihood = -3087.0347
Iteration 3:   log likelihood =  -3074.135
Iteration 4:   log likelihood = -3073.7267
Iteration 5:   log likelihood = -3073.7254
Iteration 6:   log likelihood = -3073.7254
Refining estimates:
Iteration 0:   log likelihood = -3073.7254

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =          399
Time at risk    =     17599758
                                                LR chi2(11)      =      603.86
Log likelihood  =   -3073.7254                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9303986   .1467832    -0.46   0.647     .6829364    1.267529
      1.male |   1.469448   .1526844     3.70   0.000     1.198697    1.801355
        age1 |   1.081943   .0537183     1.59   0.113     .9816181    1.192522
        age2 |   1.045002   .0724009     0.64   0.525     .9123122    1.196992
        age3 |   .8117141   .2084068    -0.81   0.417     .4907473    1.342605
             |
   ethnicity |
South Asian  |   .9852895    .251065    -0.06   0.954     .5979519    1.623534
      Black  |   1.419724   .5233492     0.95   0.342     .6893307    2.924018
      Mixed  |   1.738353   1.016427     0.95   0.344     .5526303    5.468162
      Other  |   .7229164   .5163808    -0.45   0.650     .1782678     2.93159
             |
  1.dmard_pc |   .8908495   .0972673    -1.06   0.290      .719227    1.103425
1.oral_pr~ne |   2.471753   .2562312     8.73   0.000     2.017281    3.028613
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_eth.ster
>  saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine, strata(stp population)     

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3375.6578
Iteration 1:   log likelihood = -3096.9837
Iteration 2:   log likelihood = -3039.2822
Iteration 3:   log likelihood = -3035.0683
Iteration 4:   log likelihood =  -3034.426
Iteration 5:   log likelihood = -3034.3719
Iteration 6:   log likelihood = -3034.3713
Iteration 7:   log likelihood = -3034.3713
Refining estimates:
Iteration 0:   log likelihood = -3034.3713

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =          399
Time at risk    =     17599758
                                                LR chi2(24)      =      682.57
Log likelihood  =   -3034.3713                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .923157   .1458647    -0.51   0.613     .6772987    1.258261
      1.male |   1.362629   .1442179     2.92   0.003     1.107358    1.676745
        age1 |   1.083087   .0546985     1.58   0.114     .9810152     1.19578
        age2 |   1.023699   .0720679     0.33   0.739     .8917599    1.175158
        age3 |   .8801935   .2294416    -0.49   0.624      .528073    1.467109
             |
   ethnicity |
South Asian  |   .9921222   .2537088    -0.03   0.975     .6010257    1.637711
      Black  |   1.319277   .4875501     0.75   0.453     .6393915    2.722104
      Mixed  |   1.634005   .9585571     0.84   0.403      .517503    5.159339
      Other  |   .7462378   .5333701    -0.41   0.682      .183859    3.028794
             |
  1.dmard_pc |   .9753979   .1075359    -0.23   0.821     .7858476    1.210669
1.oral_pr~ne |    2.14326    .230709     7.08   0.000     1.735594    2.646681
    1.nsaids |    .828823   .1612955    -0.96   0.335     .5659933    1.213703
1.~c_disease |   1.441046   .1571065     3.35   0.001     1.163798    1.784341
1.resp_exc~a |   1.530368   .1722429     3.78   0.000      1.22742    1.908089
             |
egfr_cat_n~s |
      30-59  |   1.277734   .1495921     2.09   0.036     1.015746    1.607296
        <30  |   2.304121   .5325536     3.61   0.000     1.464759    3.624468
             |
1.~r_disease |   1.209261   .4630009     0.50   0.620      .570969    2.561105
             |
   obese4cat |
Obese I ..)  |   1.046933   .1427136     0.34   0.737     .8014691    1.367575
Obese II..)  |   1.341371   .2629043     1.50   0.134     .9135158    1.969616
Obese II..)  |   1.659027   .4641915     1.81   0.070      .958715    2.870896
             |
1.hyperten~n |   1.096866   .1263672     0.80   0.422     .8751622    1.374733
1.cancer_e~r |   1.237498   .1571453     1.68   0.093     .9648361    1.587214
1.neuro_co~s |   1.688399   .2170652     4.07   0.000     1.312328     2.17224
1.flu_vacc~e |   .8400987   .1054229    -1.39   0.165     .6569224    1.074352
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_eth.ster
>  saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table6.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 6: Ethnicity adjustments") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. file write tablecontent ("Main Analysis, dropping individuals with missing et
> hnicity") _n                                       

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,564

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  352

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,458

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  47

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7051049   .1095015    -2.25   0.024     .5200723     .955969
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9791686   .1530242    -0.13   0.893     .7208284    1.330096
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .934148    .147334    -0.43   0.666     .6857471    1.272528
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9264965   .1463341    -0.48   0.629     .6798327    1.262657
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. file write tablecontent ("Main Analysis, adjusting for ethnicity") _n        
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,564

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  352

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,458

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  47

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7051049   .1095015    -2.25   0.024     .5200723     .955969
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9791686   .1530242    -0.13   0.893     .7208284    1.330096
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9303986   .1467832    -0.46   0.647     .6829364    1.267529
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .923157   .1458647    -0.51   0.613     .6772987    1.258261
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\10_an_models_et
> hnicity.log
  log type:  text
 closed on:  21 Jul 2020, 13:22:54
-------------------------------------------------------------------------------
