-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\10_an_models_et
> hnicity.log
  log type:  text
 opened on:  19 Jul 2020, 18:13:15

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. drop if ethnicity == .u
(45,240 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   125,195        352 |   125,547 
           |     99.72       0.28 |    100.00 
-----------+----------------------+----------
       HCQ |    23,402         47 |    23,449 
           |     99.80       0.20 |    100.00 
-----------+----------------------+----------
     Total |   148,597        399 |   148,996 
           |     99.73       0.27 |    100.00 

. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4746.5475
Iteration 1:   log likelihood = -4743.8192
Iteration 2:   log likelihood = -4743.7858
Iteration 3:   log likelihood = -4743.7858
Refining estimates:
Iteration 0:   log likelihood = -4743.7858

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =          399
Time at risk    =     17596539
                                                LR chi2(1)       =        5.52
Log likelihood  =   -4743.7858                  Prob > chi2      =      0.0188

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7052739   .1095278    -2.25   0.025     .5201969    .9561981
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar.ster saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4746.5475
Iteration 1:   log likelihood = -4531.5319
Iteration 2:   log likelihood =  -4481.086
Iteration 3:   log likelihood = -4476.3377
Iteration 4:   log likelihood =   -4475.54
Iteration 5:   log likelihood = -4475.4613
Iteration 6:   log likelihood = -4475.4602
Iteration 7:   log likelihood = -4475.4602
Refining estimates:
Iteration 0:   log likelihood = -4475.4602

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =          399
Time at risk    =     17596539
                                                LR chi2(5)       =      542.17
Log likelihood  =   -4475.4602                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9795199   .1530804    -0.13   0.895     .7210853    1.330577
      1.male |   1.460601   .1511761     3.66   0.000     1.192422    1.789094
        age1 |   1.078409   .0529872     1.54   0.124     .9793997    1.187427
        age2 |   1.057613   .0726692     0.82   0.415     .9243583    1.210078
        age3 |   .7698476   .1961286    -1.03   0.305      .467251    1.268409
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1.ster sav
> ed

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3375.6447
Iteration 1:   log likelihood = -3339.8464
Iteration 2:   log likelihood =  -3087.996
Iteration 3:   log likelihood = -3075.0301
Iteration 4:   log likelihood = -3074.6109
Iteration 5:   log likelihood = -3074.6096
Iteration 6:   log likelihood = -3074.6096
Refining estimates:
Iteration 0:   log likelihood = -3074.6096

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =          399
Time at risk    =     17596539
                                                LR chi2(7)       =      602.07
Log likelihood  =   -3074.6096                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9349174   .1474708    -0.43   0.670     .6862898    1.273617
      1.male |   1.466189   .1523183     3.68   0.000     1.196082    1.797293
        age1 |   1.081396   .0536216     1.58   0.115     .9812452    1.191769
        age2 |   1.045191   .0723582     0.64   0.523     .9125719    1.197082
        age3 |   .8121931   .2084105    -0.81   0.418     .4911783    1.343011
  1.dmard_pc |    .889339   .0970521    -1.07   0.283     .7180871    1.101432
1.oral_pr~ne |   2.470938   .2561152     8.73   0.000     2.016666    3.027539
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2.ster sav
> ed

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine, strata(stp population) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3375.6447
Iteration 1:   log likelihood = -3097.3646
Iteration 2:   log likelihood = -3039.9286
Iteration 3:   log likelihood = -3035.7301
Iteration 4:   log likelihood = -3035.0919
Iteration 5:   log likelihood = -3035.0385
Iteration 6:   log likelihood =  -3035.038
Iteration 7:   log likelihood =  -3035.038
Refining estimates:
Iteration 0:   log likelihood =  -3035.038

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =          399
Time at risk    =     17596539
                                                LR chi2(20)      =      681.21
Log likelihood  =    -3035.038                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9272451   .1464658    -0.48   0.632     .6803626    1.263713
      1.male |   1.359899   .1438844     2.91   0.004     1.105211    1.673278
        age1 |   1.082645   .0546183     1.57   0.115     .9807179    1.195167
        age2 |   1.023932   .0720422     0.34   0.737     .8920348    1.175331
        age3 |   .8802719   .2293766    -0.49   0.625     .5282205     1.46696
  1.dmard_pc |   .9752109   .1074891    -0.23   0.820     .7857382    1.210373
1.oral_pr~ne |   2.144531   .2307838     7.09   0.000     1.736722      2.6481
    1.nsaids |   .8283905     .16121    -0.97   0.333     .5656997    1.213065
1.~c_disease |   1.440343   .1569379     3.35   0.001     1.163376    1.783248
1.resp_exc~a |   1.528631   .1717983     3.78   0.000     1.226419    1.905315
             |
egfr_cat_n~s |
      30-59  |   1.280398   .1499096     2.11   0.035     1.017855    1.610661
        <30  |   2.311136   .5337618     3.63   0.000     1.469734    3.634229
             |
1.~r_disease |   1.201077   .4597758     0.48   0.632     .5671902    2.543392
             |
   obese4cat |
Obese I ..)  |   1.050861   .1432113     0.36   0.716     .8045323    1.372609
Obese II..)  |   1.344892   .2634299     1.51   0.130     .9161335    1.974313
Obese II..)  |   1.675625   .4684747     1.85   0.065     .9687154    2.898395
             |
1.hyperten~n |   1.098155   .1263702     0.81   0.416     .8764191    1.375992
1.cancer_e~r |   1.236029   .1567707     1.67   0.095     .9639777    1.584857
1.neuro_co~s |   1.690248   .2172585     4.08   0.000     1.313832    2.174507
1.flu_vacc~e |   .8364366   .1048611    -1.42   0.154     .6542156    1.069412
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3.ster sav
> ed

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4746.5475
Iteration 1:   log likelihood = -4743.8192
Iteration 2:   log likelihood = -4743.7858
Iteration 3:   log likelihood = -4743.7858
Refining estimates:
Iteration 0:   log likelihood = -4743.7858

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =          399
Time at risk    =     17596539
                                                LR chi2(1)       =        5.52
Log likelihood  =   -4743.7858                  Prob > chi2      =      0.0188

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7052739   .1095278    -2.25   0.025     .5201969    .9561981
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_eth.ster sa
> ved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4746.5475
Iteration 1:   log likelihood = -4531.5319
Iteration 2:   log likelihood =  -4481.086
Iteration 3:   log likelihood = -4476.3377
Iteration 4:   log likelihood =   -4475.54
Iteration 5:   log likelihood = -4475.4613
Iteration 6:   log likelihood = -4475.4602
Iteration 7:   log likelihood = -4475.4602
Refining estimates:
Iteration 0:   log likelihood = -4475.4602

Cox regression -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =          399
Time at risk    =     17596539
                                                LR chi2(5)       =      542.17
Log likelihood  =   -4475.4602                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9795199   .1530804    -0.13   0.895     .7210853    1.330577
      1.male |   1.460601   .1511761     3.66   0.000     1.192422    1.789094
        age1 |   1.078409   .0529872     1.54   0.124     .9793997    1.187427
        age2 |   1.057613   .0726692     0.82   0.415     .9243583    1.210078
        age3 |   .7698476   .1961286    -1.03   0.305      .467251    1.268409
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_eth.ster
>  saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp population)                               

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3375.6447
Iteration 1:   log likelihood = -3338.6136
Iteration 2:   log likelihood = -3087.0558
Iteration 3:   log likelihood = -3074.1183
Iteration 4:   log likelihood = -3073.7081
Iteration 5:   log likelihood = -3073.7068
Iteration 6:   log likelihood = -3073.7068
Refining estimates:
Iteration 0:   log likelihood = -3073.7068

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =          399
Time at risk    =     17596539
                                                LR chi2(11)      =      603.88
Log likelihood  =   -3073.7068                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9309702   .1468942    -0.45   0.650     .6833261    1.268363
      1.male |    1.46925   .1526643     3.70   0.000     1.198535    1.801113
        age1 |   1.081928   .0537211     1.59   0.113     .9815975    1.192513
        age2 |   1.044991    .072404     0.64   0.525     .9122954    1.196987
        age3 |   .8118427   .2084491    -0.81   0.417     .4908141    1.342848
             |
   ethnicity |
South Asian  |   .9848144     .25094    -0.06   0.952     .5976684    1.622739
      Black  |    1.41119   .5199924     0.93   0.350     .6853883    2.905591
      Mixed  |   1.740344   1.017644     0.95   0.343     .5532296    5.474754
      Other  |   .7221348   .5158314    -0.46   0.649     .1780708    2.928491
             |
  1.dmard_pc |   .8912414   .0973146    -1.05   0.292     .7195363    1.103921
1.oral_pr~ne |   2.471384   .2561834     8.73   0.000     2.016995    3.028139
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_eth.ster
>  saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine, strata(stp population)     

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3375.6447
Iteration 1:   log likelihood = -3096.9784
Iteration 2:   log likelihood = -3039.3035
Iteration 3:   log likelihood = -3035.0897
Iteration 4:   log likelihood = -3034.4472
Iteration 5:   log likelihood =  -3034.393
Iteration 6:   log likelihood = -3034.3924
Iteration 7:   log likelihood = -3034.3924
Refining estimates:
Iteration 0:   log likelihood = -3034.3924

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,996                  Number of obs    =     148,996
No. of failures =          399
Time at risk    =     17596539
                                                LR chi2(24)      =      682.50
Log likelihood  =   -3034.3924                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9237503   .1459823    -0.50   0.616     .6776998    1.259134
      1.male |   1.362045   .1441497     2.92   0.004     1.106894    1.676011
        age1 |   1.083138   .0547164     1.58   0.114     .9810334    1.195868
        age2 |     1.0236   .0720768     0.33   0.740     .8916472    1.175081
        age3 |   .8806184   .2295931    -0.49   0.626     .5282799     1.46795
             |
   ethnicity |
South Asian  |   .9914627   .2535416    -0.03   0.973     .6006244    1.636627
      Black  |   1.308671   .4833393     0.73   0.466     .6345281    2.699043
      Mixed  |   1.635208   .9592849     0.84   0.402     .5178697    5.163275
      Other  |   .7466412   .5336533    -0.41   0.683     .1839608     3.03039
             |
  1.dmard_pc |   .9759357   .1075994    -0.22   0.825     .7862743    1.211346
1.oral_pr~ne |   2.142246   .2305859     7.08   0.000     1.734795    2.645395
    1.nsaids |   .8290916   .1613524    -0.96   0.336     .5661706    1.214109
1.~c_disease |   1.440932   .1571171     3.35   0.001      1.16367    1.784257
1.resp_exc~a |   1.530859    .172268     3.78   0.000     1.227861    1.908627
             |
egfr_cat_n~s |
      30-59  |   1.277771   .1496122     2.09   0.036     1.015751    1.607381
        <30  |   2.296662   .5309082     3.60   0.000      1.45992    3.612977
             |
1.~r_disease |   1.209714   .4631739     0.50   0.619     .5711837    2.562063
             |
   obese4cat |
Obese I ..)  |   1.047785   .1428349     0.34   0.732     .8021128    1.368701
Obese II..)  |   1.338512   .2623457     1.49   0.137     .9115671    1.965424
Obese II..)  |   1.662274   .4650868     1.82   0.069     .9606063     2.87647
             |
1.hyperten~n |   1.096754   .1263607     0.80   0.423     .8750629    1.374608
1.cancer_e~r |    1.23808   .1572169     1.68   0.093     .9652937    1.587955
1.neuro_co~s |    1.68759   .2169741     4.07   0.000     1.311679    2.171232
1.flu_vacc~e |   .8396712   .1053711    -1.39   0.164     .6565854     1.07381
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_eth.ster
>  saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table6.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 6: Ethnicity adjustments") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. file write tablecontent ("Main Analysis, dropping individuals with missing et
> hnicity") _n                                       

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,547

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  352

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,449

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  47

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7052739   .1095278    -2.25   0.025     .5201969    .9561981
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9795199   .1530804    -0.13   0.895     .7210853    1.330577
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9349174   .1474708    -0.43   0.670     .6862898    1.273617
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9272451   .1464658    -0.48   0.632     .6803626    1.263713
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. file write tablecontent ("Main Analysis, adjusting for ethnicity") _n        
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,547

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  352

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,449

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  47

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7052739   .1095278    -2.25   0.025     .5201969    .9561981
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9795199   .1530804    -0.13   0.895     .7210853    1.330577
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9309702   .1468942    -0.45   0.650     .6833261    1.268363
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9237503   .1459823    -0.50   0.616     .6776998    1.259134
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\10_an_models_et
> hnicity.log
  log type:  text
 closed on:  19 Jul 2020, 18:13:58
-------------------------------------------------------------------------------
