-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\10_an_models_et
> hnicity.log
  log type:  text
 opened on:  19 Aug 2020, 17:14:08

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. 
. 
. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Main Model (without adjusting for ethnicity) ======*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6651.1941
Iteration 2:   log likelihood = -6651.1805
Iteration 3:   log likelihood = -6651.1805
Refining estimates:
Iteration 0:   log likelihood = -6651.1805

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(1)       =        4.13
Log likelihood  =   -6651.1805                  Prob > chi2      =      0.0421

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7771215    .099466    -1.97   0.049     .6047017    .9987036
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth1, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_eth1.ster s
> aved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6363.7842
Iteration 2:   log likelihood = -6299.4394
Iteration 3:   log likelihood = -6293.4165
Iteration 4:   log likelihood = -6292.6884
Iteration 5:   log likelihood = -6292.6429
Iteration 6:   log likelihood = -6292.6426
Refining estimates:
Iteration 0:   log likelihood = -6292.6426

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(5)       =      721.21
Log likelihood  =   -6292.6426                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.084274   .1398098     0.63   0.530     .8421363    1.396033
      1.male |   1.462889   .1293406     4.30   0.000     1.230135    1.739682
        age1 |   1.050966   .0377137     1.39   0.166     .9795883    1.127545
        age2 |   1.088567   .0570047     1.62   0.105     .9823821    1.206229
        age3 |   .7057895   .1409865    -1.74   0.081     .4771353     1.04402
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth1, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_eth1.ste
> r saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4661.9405
Iteration 2:   log likelihood = -4356.5691
Iteration 3:   log likelihood = -4348.3044
Iteration 4:   log likelihood = -4348.1268
Iteration 5:   log likelihood = -4348.1261
Iteration 6:   log likelihood = -4348.1261
Refining estimates:
Iteration 0:   log likelihood = -4348.1261

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(7)       =      805.29
Log likelihood  =   -4348.1261                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.030762   .1342742     0.23   0.816     .7984998    1.330582
      1.male |   1.463663   .1298619     4.29   0.000      1.23004    1.741658
        age1 |   1.054341   .0381702     1.46   0.144      .982121    1.131871
        age2 |   1.075026   .0566817     1.37   0.170     .9694799    1.192064
        age3 |   .7481172   .1504449    -1.44   0.149     .5044227    1.109544
  1.dmard_pc |   .9328877   .0860025    -0.75   0.451     .7786772    1.117638
1.oral_pr~ne |    2.46496   .2180972    10.20   0.000     2.072509    2.931726
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth1, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_eth1.ste
> r saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)  

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4750.7712
Iteration 1:   log likelihood = -4360.8939
Iteration 2:   log likelihood = -4285.2087
Iteration 3:   log likelihood = -4280.1234
Iteration 4:   log likelihood = -4279.5622
Iteration 5:   log likelihood = -4279.5335
Iteration 6:   log likelihood = -4279.5334
Refining estimates:
Iteration 0:   log likelihood = -4279.5334

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(29)      =      942.48
Log likelihood  =   -4279.5334                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.034054   .1349618     0.26   0.798     .8006575    1.335487
      1.male |   1.258393   .1156261     2.50   0.012     1.051004    1.506704
        age1 |   1.052019   .0385628     1.38   0.167     .9790888    1.130382
        age2 |   1.059931   .0566608     1.09   0.276     .9544976     1.17701
        age3 |   .7963206   .1623783    -1.12   0.264     .5339725    1.187564
  1.dmard_pc |   1.036379    .096697     0.38   0.702     .8631757    1.244337
1.oral_pr~ne |   2.152156   .1975333     8.35   0.000     1.797824    2.576323
    1.nsaids |   .8537185   .1406669    -0.96   0.337     .6181054    1.179144
1.~c_disease |   1.435714   .1337287     3.88   0.000     1.196144    1.723267
1.resp_exc~a |   1.341157   .1332016     2.96   0.003     1.103925     1.62937
             |
egfr_cat_n~s |
      30-59  |   1.158961   .1163171     1.47   0.142      .952005    1.410906
        <30  |   2.069124   .4114608     3.66   0.000      1.40126    3.055303
             |
1.~r_disease |   1.244417   .3992341     0.68   0.495      .663565    2.333719
             |
   obese4cat |
Obese I ..)  |   1.025825   .1199407     0.22   0.827     .8157362    1.290021
Obese II..)  |   1.186663   .2069047     0.98   0.326      .843166    1.670096
Obese II..)  |   1.330839   .3378622     1.13   0.260     .8091513    2.188877
             |
1.hyperten~n |   1.016488   .0993226     0.17   0.867     .8393244    1.231046
1.cancer_e~r |   1.269812   .1367922     2.22   0.027     1.028117    1.568326
1.neuro_co~s |   1.704294   .1868795     4.86   0.000     1.374701    2.112908
1.flu_vacc~e |   .8066862   .0854829    -2.03   0.043     .6553972    .9928982
             |
         imd |
          2  |   1.318217   .1911347     1.91   0.057     .9921263    1.751486
          3  |   1.521664   .2184706     2.92   0.003     1.148442    2.016178
          4  |   1.428828   .2109287     2.42   0.016     1.069849    1.908259
5 most de..  |   1.598354   .2397846     3.13   0.002     1.191176    2.144717
             |
     diabcat |
Controlle..  |   1.096914   .1261896     0.80   0.421     .8754878    1.374344
Uncontrol..  |   1.520751   .2379442     2.68   0.007     1.119115    2.066528
Diabetes,..  |   1.757608   .4165984     2.38   0.017     1.104499    2.796911
             |
smoke_nomiss |
     Former  |   1.419287   .1462231     3.40   0.001     1.159777    1.736864
    Current  |   1.131051   .2067267     0.67   0.500     .7905054    1.618303
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth1, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_eth1.ste
> r saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. /* Restrict population=======================================================
> =*/ 
. drop if ethnicity == .u
(45,328 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   125,449        358 |   125,807 
           |     99.72       0.28 |    100.00 
-----------+----------------------+----------
       HCQ |    23,454         48 |    23,502 
           |     99.80       0.20 |    100.00 
-----------+----------------------+----------
     Total |   148,903        406 |   149,309 
           |     99.73       0.27 |    100.00 

. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4830.5848
Iteration 1:   log likelihood = -4827.8625
Iteration 2:   log likelihood = -4827.8299
Iteration 3:   log likelihood = -4827.8299
Refining estimates:
Iteration 0:   log likelihood = -4827.8299

Cox regression -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =          406
Time at risk    =     19665328
                                                LR chi2(1)       =        5.51
Log likelihood  =   -4827.8299                  Prob > chi2      =      0.0189

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7079686   .1088216    -2.25   0.025     .5238128    .9568678
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth2, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_eth2.ster s
> aved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4830.5848
Iteration 1:   log likelihood = -4610.0825
Iteration 2:   log likelihood = -4557.9769
Iteration 3:   log likelihood = -4553.1025
Iteration 4:   log likelihood = -4552.3024
Iteration 5:   log likelihood = -4552.2237
Iteration 6:   log likelihood = -4552.2227
Iteration 7:   log likelihood = -4552.2227
Refining estimates:
Iteration 0:   log likelihood = -4552.2227

Cox regression -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =          406
Time at risk    =     19665328
                                                LR chi2(5)       =      556.72
Log likelihood  =   -4552.2227                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9843899    .152268    -0.10   0.919     .7269442    1.333009
      1.male |   1.465752   .1503342     3.73   0.000     1.198829    1.792106
        age1 |   1.075382   .0523218     1.49   0.135     .9775705    1.182979
        age2 |   1.064223    .072515     0.91   0.361      .931178    1.216277
        age3 |   .7502176   .1897168    -1.14   0.256     .4570181    1.231519
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth2, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_eth2.ste
> r saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3433.8909
Iteration 1:   log likelihood =  -3399.704
Iteration 2:   log likelihood = -3140.1204
Iteration 3:   log likelihood =  -3126.767
Iteration 4:   log likelihood = -3126.3205
Iteration 5:   log likelihood = -3126.3189
Iteration 6:   log likelihood = -3126.3189
Refining estimates:
Iteration 0:   log likelihood = -3126.3189

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =          406
Time at risk    =     19665328
                                                LR chi2(7)       =      615.14
Log likelihood  =   -3126.3189                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9405135   .1468347    -0.39   0.694     .6925863    1.277192
      1.male |   1.469733   .1513204     3.74   0.000     1.201159    1.798358
        age1 |   1.078721   .0529674     1.54   0.123     .9797455    1.187694
        age2 |   1.051764   .0722092     0.74   0.462     .9193456    1.203256
        age3 |   .7905485   .2013635    -0.92   0.356     .4798614     1.30239
  1.dmard_pc |   .8869524   .0960461    -1.11   0.268      .717341    1.096668
1.oral_pr~ne |    2.42394   .2495729     8.60   0.000     1.980983    2.965944
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth2, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_eth2.ste
> r saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)  

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3433.8909
Iteration 1:   log likelihood = -3137.3607
Iteration 2:   log likelihood = -3078.2928
Iteration 3:   log likelihood = -3074.0255
Iteration 4:   log likelihood = -3073.3708
Iteration 5:   log likelihood = -3073.3155
Iteration 6:   log likelihood = -3073.3149
Iteration 7:   log likelihood = -3073.3149
Refining estimates:
Iteration 0:   log likelihood = -3073.3149

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =          406
Time at risk    =     19665328
                                                LR chi2(29)      =      721.15
Log likelihood  =   -3073.3149                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9353944   .1463322    -0.43   0.669     .6883885     1.27103
      1.male |   1.283746   .1368735     2.34   0.019     1.041654    1.582102
        age1 |   1.078574   .0538647     1.51   0.130     .9780037    1.189487
        age2 |   1.030116   .0719152     0.43   0.671     .8983829    1.181166
        age3 |   .8614186   .2229595    -0.58   0.564     .5186797    1.430636
  1.dmard_pc |   .9845795   .1079844    -0.14   0.887     .7941356    1.220694
1.oral_pr~ne |   2.097013   .2244113     6.92   0.000     1.700239     2.58638
    1.nsaids |   .8313657   .1617023    -0.95   0.342     .5678475    1.217174
1.~c_disease |   1.415041   .1530883     3.21   0.001     1.144671    1.749273
1.resp_exc~a |   1.414402   .1607833     3.05   0.002      1.13191    1.767397
             |
egfr_cat_n~s |
      30-59  |   1.255664    .145453     1.97   0.049     1.000628    1.575704
        <30  |   2.107741   .4884731     3.22   0.001     1.338288    3.319593
             |
1.~r_disease |   1.122971   .4303284     0.30   0.762     .5298874    2.379871
             |
   obese4cat |
Obese I ..)  |   .9814949   .1334975    -0.14   0.891     .7518173    1.281338
Obese II..)  |    1.19297    .238345     0.88   0.377     .8064304    1.764787
Obese II..)  |   1.454973   .4091594     1.33   0.182     .8384644    2.524789
             |
1.hyperten~n |   1.059536    .121884     0.50   0.615     .8456636    1.327498
1.cancer_e~r |   1.247834   .1564708     1.77   0.077     .9759357    1.595483
1.neuro_co~s |   1.696665   .2146989     4.18   0.000     1.323986    2.174245
1.flu_vacc~e |   .8282251   .1032079    -1.51   0.130       .64875    1.057352
             |
         imd |
          2  |   1.263378   .2157624     1.37   0.171      .903989    1.765645
          3  |   1.421799   .2416484     2.07   0.038     1.018986    1.983846
          4  |   1.340551   .2317912     1.70   0.090     .9552221    1.881319
5 most de..  |    1.61098   .2770454     2.77   0.006     1.150022    2.256701
             |
     diabcat |
Controlle..  |    1.10376   .1445816     0.75   0.451     .8538382    1.426834
Uncontrol..  |   1.438909   .2615741     2.00   0.045     1.007619    2.054803
Diabetes,..  |    1.83671   .4913973     2.27   0.023     1.087197    3.102936
             |
smoke_nomiss |
     Former  |   1.368194   .1638445     2.62   0.009     1.081968     1.73014
    Current  |   1.027376   .2210509     0.13   0.900     .6738824    1.566298
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth2, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_eth2.ste
> r saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4830.5848
Iteration 1:   log likelihood = -4827.8625
Iteration 2:   log likelihood = -4827.8299
Iteration 3:   log likelihood = -4827.8299
Refining estimates:
Iteration 0:   log likelihood = -4827.8299

Cox regression -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =          406
Time at risk    =     19665328
                                                LR chi2(1)       =        5.51
Log likelihood  =   -4827.8299                  Prob > chi2      =      0.0189

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7079686   .1088216    -2.25   0.025     .5238128    .9568678
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth3, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_eth3.ster s
> aved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4830.5848
Iteration 1:   log likelihood = -4610.0825
Iteration 2:   log likelihood = -4557.9769
Iteration 3:   log likelihood = -4553.1025
Iteration 4:   log likelihood = -4552.3024
Iteration 5:   log likelihood = -4552.2237
Iteration 6:   log likelihood = -4552.2227
Iteration 7:   log likelihood = -4552.2227
Refining estimates:
Iteration 0:   log likelihood = -4552.2227

Cox regression -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =          406
Time at risk    =     19665328
                                                LR chi2(5)       =      556.72
Log likelihood  =   -4552.2227                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9843899    .152268    -0.10   0.919     .7269442    1.333009
      1.male |   1.465752   .1503342     3.73   0.000     1.198829    1.792106
        age1 |   1.075382   .0523218     1.49   0.135     .9775705    1.182979
        age2 |   1.064223    .072515     0.91   0.361      .931178    1.216277
        age3 |   .7502176   .1897168    -1.14   0.256     .4570181    1.231519
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth3, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_eth3.ste
> r saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp population)                               

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3433.8909
Iteration 1:   log likelihood = -3398.6199
Iteration 2:   log likelihood = -3139.2733
Iteration 3:   log likelihood = -3125.9282
Iteration 4:   log likelihood = -3125.4889
Iteration 5:   log likelihood = -3125.4874
Iteration 6:   log likelihood = -3125.4874
Refining estimates:
Iteration 0:   log likelihood = -3125.4874

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =          406
Time at risk    =     19665328
                                                LR chi2(11)      =      616.81
Log likelihood  =   -3125.4874                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9371252   .1463478    -0.42   0.678     .6900303    1.272703
      1.male |   1.472423   .1516236     3.76   0.000     1.203316    1.801713
        age1 |   1.079092   .0530508     1.55   0.122     .9799668    1.188244
        age2 |   1.051602   .0722493     0.73   0.464     .9191164    1.203185
        age3 |   .7902768   .2013966    -0.92   0.356     .4795749    1.302273
             |
   ethnicity |
South Asian  |    .960495   .2446704    -0.16   0.874     .5829958    1.582431
      Black  |   1.365415   .5035867     0.84   0.398     .6627169    2.813205
      Mixed  |   1.676592   .9806213     0.88   0.377     .5328052    5.275776
      Other  |   .7011512   .5008705    -0.50   0.619     .1728829    2.843618
             |
  1.dmard_pc |   .8884096   .0962565    -1.09   0.275      .718436    1.098597
1.oral_pr~ne |   2.423938   .2495939     8.60   0.000     1.980947    2.965992
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth3, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_eth3.ste
> r saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)  
>     

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3433.8909
Iteration 1:   log likelihood = -3137.0864
Iteration 2:   log likelihood =  -3077.802
Iteration 3:   log likelihood = -3073.5194
Iteration 4:   log likelihood = -3072.8618
Iteration 5:   log likelihood = -3072.8059
Iteration 6:   log likelihood = -3072.8054
Iteration 7:   log likelihood = -3072.8054
Refining estimates:
Iteration 0:   log likelihood = -3072.8054

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =          406
Time at risk    =     19665328
                                                LR chi2(33)      =      722.17
Log likelihood  =   -3072.8054                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9330787   .1460366    -0.44   0.658     .6865882    1.268061
      1.male |   1.285873   .1371984     2.36   0.018     1.043224     1.58496
        age1 |   1.078719   .0539218     1.52   0.130     .9780461    1.189754
        age2 |   1.029949   .0719367     0.42   0.673      .898181    1.181049
        age3 |   .8614415   .2230215    -0.58   0.565     .5186274    1.430857
             |
   ethnicity |
South Asian  |   .9426326   .2466579    -0.23   0.821     .5644289    1.574257
      Black  |   1.221879   .4543058     0.54   0.590     .5895811    2.532286
      Mixed  |   1.468547    .863165     0.65   0.513     .4640648     4.64726
      Other  |   .7050937    .504419    -0.49   0.625     .1735016    2.865433
             |
  1.dmard_pc |   .9845893   .1079973    -0.14   0.887     .7941249    1.220735
1.oral_pr~ne |   2.095102   .2242683     6.91   0.000     1.698593    2.584172
    1.nsaids |   .8318677   .1618045    -0.95   0.344     .5681843    1.217922
1.~c_disease |   1.416905   .1533589     3.22   0.001     1.146069    1.751744
1.resp_exc~a |   1.415469   .1610321     3.05   0.002     1.132564    1.769042
             |
egfr_cat_n~s |
      30-59  |   1.253834   .1452435     1.95   0.051     .9991656    1.573414
        <30  |   2.097463   .4865589     3.19   0.001     1.331181     3.30485
             |
1.~r_disease |   1.130777   .4334108     0.32   0.748     .5334866    2.396793
             |
   obese4cat |
Obese I ..)  |   .9785235   .1331869    -0.16   0.873     .7494008    1.277698
Obese II..)  |   1.187425   .2374927     0.86   0.390     .8023439    1.757325
Obese II..)  |   1.443965   .4065036     1.31   0.192     .8316243    2.507183
             |
1.hyperten~n |   1.059149   .1219225     0.50   0.618     .8452244    1.327217
1.cancer_e~r |   1.248061   .1566485     1.77   0.077     .9758845    1.596148
1.neuro_co~s |   1.694676   .2144988     4.17   0.000     1.322355    2.171826
1.flu_vacc~e |   .8301129   .1035393    -1.49   0.135     .6500811    1.060002
             |
         imd |
          2  |   1.262968   .2156864     1.37   0.172     .9037044    1.765055
          3  |   1.423068   .2419221     2.08   0.038     1.019815    1.985776
          4  |    1.34009   .2320084     1.69   0.091     .9544793    1.881489
5 most de..  |   1.607008   .2774855     2.75   0.006     1.145617    2.254223
             |
     diabcat |
Controlle..  |   1.104522   .1454763     0.75   0.450     .8532232    1.429834
Uncontrol..  |   1.439476   .2632623     1.99   0.046     1.005843    2.060054
Diabetes,..  |   1.839205   .4925202     2.28   0.023     1.088146     3.10866
             |
smoke_nomiss |
     Former  |   1.365078   .1658836     2.56   0.010     1.075771    1.732188
    Current  |   1.025416    .222458     0.12   0.908     .6702499    1.568784
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth3, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_eth3.ste
> r saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table6.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 6: Ethnicity adjustments") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.         
. /* Main Model (without adjusting for ethnicity) ======*/
. file write tablecontent ("Main Analysis, without adjusting for ethnicity") _n
>                                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
. * Refresh Stata dataset (bring back those with missing ethnicity for row tota
> ls)
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  164,068

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  477

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  30,569

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  70

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7771215    .099466    -1.97   0.049     .6047017    .9987036
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.084274   .1398098     0.63   0.530     .8421363    1.396033
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.030762   .1342742     0.23   0.816     .7984998    1.330582
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.034054   .1349618     0.26   0.798     .8006575    1.335487
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. 
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. file write tablecontent ("Main Analysis, dropping individuals with missing et
> hnicity") _n                                       

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
. /* Restrict population=======================================================
> =*/ 
. drop if ethnicity == .u
(45,328 observations deleted)

.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,807

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  358

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,502

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  48

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7079686   .1088216    -2.25   0.025     .5238128    .9568678
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9843899    .152268    -0.10   0.919     .7269442    1.333009
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9405135   .1468347    -0.39   0.694     .6925863    1.277192
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9353944   .1463322    -0.43   0.669     .6883885     1.27103
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. file write tablecontent ("Main Analysis, adjusting for ethnicity") _n        
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,807

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  358

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,502

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  48

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7079686   .1088216    -2.25   0.025     .5238128    .9568678
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9843899    .152268    -0.10   0.919     .7269442    1.333009
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9371252   .1463478    -0.42   0.678     .6900303    1.272703
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9330787   .1460366    -0.44   0.658     .6865882    1.268061
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\10_an_models_et
> hnicity.log
  log type:  text
 closed on:  19 Aug 2020, 17:15:55
-------------------------------------------------------------------------------
