-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\11_an_models_se
> p_pops.log
  log type:  text
 opened on:  21 Jul 2020, 22:04:10

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 0
(26,732 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   143,437        442 |   143,879 
           |     99.69       0.31 |    100.00 
-----------+----------------------+----------
       HCQ |    23,616         59 |    23,675 
           |     99.75       0.25 |    100.00 
-----------+----------------------+----------
     Total |   167,053        501 |   167,554 
           |     99.70       0.30 |    100.00 

. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6019.8107
Iteration 1:   log likelihood = -6018.4929
Iteration 2:   log likelihood = -6018.4856
Iteration 3:   log likelihood = -6018.4856
Refining estimates:
Iteration 0:   log likelihood = -6018.4856

Cox regression -- Breslow method for ties

No. of subjects =      167,554                  Number of obs    =     167,554
No. of failures =          501
Time at risk    =     19825331
                                                LR chi2(1)       =        2.65
Log likelihood  =   -6018.4856                  Prob > chi2      =      0.1035

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .802969   .1112963    -1.58   0.113     .6119518    1.053611
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_ra.ster sav
> ed

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6019.8107
Iteration 1:   log likelihood = -5987.2138
Iteration 2:   log likelihood = -5717.4444
Iteration 3:   log likelihood = -5707.8125
Iteration 4:   log likelihood = -5707.6411
Iteration 5:   log likelihood = -5707.6401
Iteration 6:   log likelihood = -5707.6401
Refining estimates:
Iteration 0:   log likelihood = -5707.6401

Cox regression -- Breslow method for ties

No. of subjects =      167,554                  Number of obs    =     167,554
No. of failures =          501
Time at risk    =     19825331
                                                LR chi2(5)       =      624.34
Log likelihood  =   -5707.6401                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.035854   .1444772     0.25   0.801     .7880904    1.361511
      1.male |   1.404376   .1297256     3.68   0.000     1.171806    1.683104
        age1 |   1.049287   .0415823     1.21   0.225     .9708723    1.134036
        age2 |   1.089684   .0621925     1.50   0.132     .9743595    1.218658
        age3 |   .7037738   .1518718    -1.63   0.104     .4610488    1.074284
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_ra.ster 
> saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp)                              

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4418.1354
Iteration 1:   log likelihood = -4330.9232
Iteration 2:   log likelihood = -4061.4917
Iteration 3:   log likelihood = -4054.7719
Iteration 4:   log likelihood = -4054.6303
Iteration 5:   log likelihood = -4054.6296
Iteration 6:   log likelihood = -4054.6296
Refining estimates:
Iteration 0:   log likelihood = -4054.6296

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      167,554                  Number of obs    =     167,554
No. of failures =          501
Time at risk    =     19825331
                                                LR chi2(7)       =      727.01
Log likelihood  =   -4054.6296                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9779519   .1375018    -0.16   0.874     .7423983    1.288244
      1.male |   1.415917   .1309375     3.76   0.000     1.181198    1.697278
        age1 |   1.052783   .0421793     1.28   0.199     .9732751    1.138785
        age2 |   1.076237   .0619546     1.28   0.202     .9614076    1.204781
        age3 |   .7453022   .1621075    -1.35   0.177     .4866213    1.141494
  1.dmard_pc |   .9308891   .0876347    -0.76   0.447     .7740429    1.119517
1.oral_pr~ne |   2.511656   .2312673    10.00   0.000     2.096929    3.008409
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_ra.ster 
> saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine, strata(stp)    

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4418.1354
Iteration 1:   log likelihood = -4078.1357
Iteration 2:   log likelihood = -4013.3534
Iteration 3:   log likelihood =  -4008.668
Iteration 4:   log likelihood = -4008.1424
Iteration 5:   log likelihood = -4008.1119
Iteration 6:   log likelihood = -4008.1118
Refining estimates:
Iteration 0:   log likelihood = -4008.1118

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      167,554                  Number of obs    =     167,554
No. of failures =          501
Time at risk    =     19825331
                                                LR chi2(20)      =      820.05
Log likelihood  =   -4008.1118                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9782894   .1377289    -0.16   0.876     .7423874    1.289152
      1.male |   1.302889   .1227613     2.81   0.005     1.083192    1.567147
        age1 |   1.052372   .0426678     1.26   0.208     .9719806    1.139411
        age2 |   1.060156   .0617832     1.00   0.316     .9457231    1.188436
        age3 |   .7931764   .1746821    -1.05   0.293     .5151204    1.221324
  1.dmard_pc |    1.02503   .0975833     0.26   0.795     .8505541    1.235297
1.oral_pr~ne |   2.217786   .2115521     8.35   0.000     1.839605    2.673713
    1.nsaids |   .9010023    .149204    -0.63   0.529     .6512816    1.246473
1.~c_disease |   1.483651   .1437303     4.07   0.000     1.227074    1.793878
1.resp_exc~a |   1.434781   .1461886     3.54   0.000     1.175053    1.751918
             |
egfr_cat_n~s |
      30-59  |   1.198158   .1251665     1.73   0.084     .9763213      1.4704
        <30  |     2.2261   .4621944     3.85   0.000     1.481882    3.344071
             |
1.~r_disease |   1.567726   .5024148     1.40   0.161     .8365322    2.938041
             |
   obese4cat |
Obese I ..)  |   1.144682   .1372547     1.13   0.260     .9049409    1.447936
Obese II..)  |   1.382986   .2437775     1.84   0.066     .9789879    1.953701
Obese II..)  |   1.566672   .4080398     1.72   0.085     .9403351    2.610199
             |
1.hyperten~n |   1.049383   .1063371     0.48   0.634     .8603584    1.279938
1.cancer_e~r |   1.269642   .1427155     2.12   0.034     1.018593    1.582564
1.neuro_co~s |   1.717473   .1979252     4.69   0.000     1.370237    2.152703
1.flu_vacc~e |   .8084031    .089278    -1.93   0.054     .6510636    1.003766
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_ra.ster 
> saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 1
(167,554 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    19,867         28 |    19,895 
           |     99.86       0.14 |    100.00 
-----------+----------------------+----------
       HCQ |     6,828          9 |     6,837 
           |     99.87       0.13 |    100.00 
-----------+----------------------+----------
     Total |    26,695         37 |    26,732 
           |     99.86       0.14 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -376.08223
Iteration 1:   log likelihood = -376.04606
Iteration 2:   log likelihood = -376.04603
Refining estimates:
Iteration 0:   log likelihood = -376.04603

Cox regression -- Breslow method for ties

No. of subjects =       26,732                  Number of obs    =      26,732
No. of failures =           37
Time at risk    =      3121520
                                                LR chi2(1)       =        0.07
Log likelihood  =   -376.04603                  Prob > chi2      =      0.7879

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9028386   .3459491    -0.27   0.790      .426037    1.913256
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_sle.ster sa
> ved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -376.08223
Iteration 1:   log likelihood =   -353.126
Iteration 2:   log likelihood = -346.13327
Iteration 3:   log likelihood = -345.94438
Iteration 4:   log likelihood = -345.93168
Iteration 5:   log likelihood = -345.93157
Iteration 6:   log likelihood = -345.93157
Refining estimates:
Iteration 0:   log likelihood = -345.93157

Cox regression -- Breslow method for ties

No. of subjects =       26,732                  Number of obs    =      26,732
No. of failures =           37
Time at risk    =      3121520
                                                LR chi2(5)       =       60.30
Log likelihood  =   -345.93157                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.581866   .6202886     1.17   0.242     .7334876    3.411511
      1.male |    2.23347   .7760367     2.31   0.021     1.130377    4.413029
        age1 |   1.054646   .0919746     0.61   0.542     .8889442    1.251236
        age2 |   1.077153   .1519323     0.53   0.598     .8169876    1.420166
        age3 |   .7295242   .4230813    -0.54   0.587     .2340953    2.273457
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_sle.ster
>  saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp)                          

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -184.54826
Iteration 1:   log likelihood = -165.76753
Iteration 2:   log likelihood = -158.23564
Iteration 3:   log likelihood = -157.64029
Iteration 4:   log likelihood = -157.47003
Iteration 5:   log likelihood = -157.42368
Iteration 6:   log likelihood = -157.40777
Iteration 7:   log likelihood = -157.40194
Iteration 8:   log likelihood = -157.39979
Iteration 9:   log likelihood = -157.39901
Iteration 10:  log likelihood = -157.39872
Iteration 11:  log likelihood = -157.39861
Iteration 12:  log likelihood = -157.39857
Iteration 13:  log likelihood = -157.39856
Iteration 14:  log likelihood = -157.39855
Iteration 15:  log likelihood = -157.39855
Iteration 16:  log likelihood = -157.39855
Iteration 17:  log likelihood = -157.39855
Iteration 18:  log likelihood = -157.39855
Iteration 19:  log likelihood = -157.39855
Iteration 20:  log likelihood = -157.39855
Iteration 21:  log likelihood = -157.39855
Iteration 22:  log likelihood = -157.39855
Iteration 23:  log likelihood = -157.39855
Iteration 24:  log likelihood = -157.39855
Iteration 25:  log likelihood = -157.39855
Iteration 26:  log likelihood = -157.39855
Iteration 27:  log likelihood = -157.39855
Iteration 28:  log likelihood = -157.39855
Iteration 29:  log likelihood = -157.39855
Iteration 30:  log likelihood = -157.39855
Iteration 31:  log likelihood = -157.39855
Iteration 32:  log likelihood = -157.39855
Iteration 33:  log likelihood = -157.39855
Refining estimates:
Iteration 0:   log likelihood = -157.39855
Iteration 1:   log likelihood = -157.39855
Iteration 2:   log likelihood = -157.39855

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,688                  Number of obs    =      20,688
No. of failures =           28
Time at risk    =      2414411
                                                LR chi2(11)      =       54.30
Log likelihood  =   -157.39855                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.393849   .6665945     0.69   0.487     .5459302    3.558725
      1.male |   2.444727   .9805546     2.23   0.026     1.113839    5.365849
        age1 |   1.131227   .1702133     0.82   0.413     .8423087    1.519246
        age2 |   .9561448   .2066785    -0.21   0.836     .6259354    1.460555
        age3 |   1.192307    .979398     0.21   0.830     .2383331    5.964741
             |
   ethnicity |
South Asian  |   1.05e-15   2.58e-08    -0.00   1.000            0           .
      Black  |   1.401925   1.506125     0.31   0.753      .170709    11.51312
      Mixed  |   1.47e-15   8.39e-08    -0.00   1.000            0           .
      Other  |   1.23e-15   6.30e-08    -0.00   1.000            0           .
             |
  1.dmard_pc |   .3690155   .3842465    -0.96   0.338     .0479413    2.840398
1.oral_pr~ne |   1.834193    .826033     1.35   0.178     .7587601    4.433897
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_sle.ster
>  saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine, strata(stp)        

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -184.54826
Iteration 1:   log likelihood = -169.88937
Iteration 2:   log likelihood = -150.59128
Iteration 3:   log likelihood = -149.29414
Iteration 4:   log likelihood = -149.06794
Iteration 5:   log likelihood = -148.99185
Iteration 6:   log likelihood = -148.96408
Iteration 7:   log likelihood = -148.95387
Iteration 8:   log likelihood = -148.95012
Iteration 9:   log likelihood = -148.94874
Iteration 10:  log likelihood = -148.94824
Iteration 11:  log likelihood = -148.94805
Iteration 12:  log likelihood = -148.94798
Iteration 13:  log likelihood = -148.94796
Iteration 14:  log likelihood = -148.94795
Iteration 15:  log likelihood = -148.94794
Iteration 16:  log likelihood = -148.94794
Iteration 17:  log likelihood = -148.94794
Iteration 18:  log likelihood = -148.94794
Iteration 19:  log likelihood = -148.94794
Iteration 20:  log likelihood = -148.94794
Iteration 21:  log likelihood = -148.94794
Iteration 22:  log likelihood = -148.94794
Iteration 23:  log likelihood = -148.94794
Iteration 24:  log likelihood = -148.94794
Iteration 25:  log likelihood = -148.94794
Iteration 26:  log likelihood = -148.94794
Iteration 27:  log likelihood = -148.94794
Iteration 28:  log likelihood = -148.94794
Iteration 29:  log likelihood = -148.94794
Iteration 30:  log likelihood = -148.94794
Iteration 31:  log likelihood = -148.94794
Iteration 32:  log likelihood = -148.94794
Iteration 33:  log likelihood = -148.94794
Iteration 34:  log likelihood = -148.94794
Iteration 35:  log likelihood = -148.94794
Iteration 36:  log likelihood = -148.94794
Refining estimates:
Iteration 0:   log likelihood = -148.94794
Iteration 1:   log likelihood = -148.94794
Iteration 2:   log likelihood = -148.94794

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,688                  Number of obs    =      20,688
No. of failures =           28
Time at risk    =      2414411
                                                LR chi2(24)      =       71.20
Log likelihood  =   -148.94794                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    1.43521   .6870652     0.75   0.450        .5616    3.667782
      1.male |   2.142853    .880863     1.85   0.064     .9573898    4.796185
        age1 |   1.139487    .177752     0.84   0.403     .8393204    1.547002
        age2 |   .9121066   .2035867    -0.41   0.680     .5889157    1.412661
        age3 |   1.429206   1.209608     0.42   0.673       .27207    7.507738
             |
   ethnicity |
South Asian  |   6.19e-17   6.34e-09    -0.00   1.000            0           .
      Black  |   1.390651   1.528325     0.30   0.764     .1613423    11.98638
      Mixed  |   1.27e-16   2.34e-08    -0.00   1.000            0           .
      Other  |   2.80e-17   9.75e-09    -0.00   1.000            0           .
             |
  1.dmard_pc |   .3982099   .4152795    -0.88   0.377     .0515731    3.074687
1.oral_pr~ne |   1.405236   .6591014     0.73   0.468     .5604125    3.523631
    1.nsaids |   3.09e-17   4.41e-09    -0.00   1.000            0           .
1.~c_disease |   1.650119   .6975084     1.18   0.236     .7206273    3.778503
1.resp_exc~a |   1.849857   .7817193     1.46   0.146     .8080424    4.234889
             |
egfr_cat_n~s |
      30-59  |   1.139312   .5589665     0.27   0.790       .43554     2.98028
        <30  |    4.45806   3.029389     2.20   0.028     1.176869    16.88743
             |
1.~r_disease |   2.63e-17   5.63e-09    -0.00   1.000            0           .
             |
   obese4cat |
Obese I ..)  |   .8052495   .4455962    -0.39   0.695     .2722113    2.382072
Obese II..)  |   .5825578   .6051655    -0.52   0.603     .0760509    4.462454
Obese II..)  |    1.45252   1.516922     0.36   0.721      .187577    11.24772
             |
1.hyperten~n |   1.469394   .6762456     0.84   0.403     .5962081     3.62142
1.cancer_e~r |   1.240199   .6246154     0.43   0.669     .4621586    3.328064
1.neuro_co~s |   1.596676   .7635075     0.98   0.328     .6254382     4.07614
1.flu_vacc~e |   .8498185    .401497    -0.34   0.731     .3366477    2.145244
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_sle.ster
>  saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7a_sep.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7a: RA and SLE populations separately") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Rheumatoid arthritis (RA)") _n                     
>                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 0
  143,879

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 0
  442

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 0
  23,675

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 0
  59

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .802969   .1112963    -1.58   0.113     .6119518    1.053611
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.035854   .1444772     0.25   0.801     .7880904    1.361511
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9779519   .1375018    -0.16   0.874     .7423983    1.288244
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9782894   .1377289    -0.16   0.876     .7423874    1.289152
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model  ==========================*/
. file write tablecontent ("Systemic lupus erythematosus (SLE)") _n            
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 1
  19,895

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 1
  28

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 1
  6,837

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 1
  9

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_sle 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9028386   .3459491    -0.27   0.790      .426037    1.913256
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.581866   .6202886     1.17   0.242     .7334876    3.411511
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.393849   .6665945     0.69   0.487     .5459302    3.558725
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.43521   .6870652     0.75   0.450        .5616    3.667782
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* INDICATOR VARIABLE========================================================
> */ 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   163,304        470 |   163,774 
           |     99.71       0.29 |    100.00 
-----------+----------------------+----------
       HCQ |    30,444         68 |    30,512 
           |     99.78       0.22 |    100.00 
-----------+----------------------+----------
     Total |   193,748        538 |   194,286 
           |     99.72       0.28 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood = -6540.7035
Iteration 2:   log likelihood =  -6540.687
Iteration 3:   log likelihood =  -6540.687
Refining estimates:
Iteration 0:   log likelihood =  -6540.687

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(1)       =        4.50
Log likelihood  =    -6540.687                  Prob > chi2      =      0.0340

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7663221   .0994258    -2.05   0.040      .594255    .9882113
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_ind.ster sa
> ved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6542.9345
Iteration 1:   log likelihood = -6260.1603
Iteration 2:   log likelihood =  -6197.414
Iteration 3:   log likelihood = -6191.5415
Iteration 4:   log likelihood = -6190.8368
Iteration 5:   log likelihood = -6190.7939
Iteration 6:   log likelihood = -6190.7936
Refining estimates:
Iteration 0:   log likelihood = -6190.7936

Cox regression -- Breslow method for ties

No. of subjects =      194,286                  Number of obs    =     194,286
No. of failures =          538
Time at risk    =     22946851
                                                LR chi2(5)       =      704.28
Log likelihood  =   -6190.7936                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.067968   .1395795     0.50   0.615     .8266269    1.379772
      1.male |   1.455328    .129815     4.21   0.000     1.221895    1.733357
        age1 |     1.0508   .0377027     1.38   0.167     .9794424    1.127356
        age2 |   1.087722   .0570467     1.60   0.109     .9814672     1.20548
        age3 |   .7082564   .1418679    -1.72   0.085     .4782883    1.048796
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_ind.ster
>  saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone, strata(stp)                             

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3488.6232
Iteration 1:   log likelihood = -3481.6905
Iteration 2:   log likelihood = -3210.1701
Iteration 3:   log likelihood = -3177.5174
Iteration 4:   log likelihood = -3175.6786
Iteration 5:   log likelihood = -3175.6599
Iteration 6:   log likelihood = -3175.6599
Refining estimates:
Iteration 0:   log likelihood = -3175.6599

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =          399
Time at risk    =     17599758
                                                LR chi2(12)      =      625.93
Log likelihood  =   -3175.6599                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9289847   .1465355    -0.47   0.641     .6819341    1.265537
             |
  population |
        SLE  |   .7884566   .1579406    -1.19   0.235     .5324372    1.167582
      1.male |   1.466133   .1522788     3.68   0.000      1.19609    1.797144
        age1 |   1.083104   .0538464     1.61   0.108     .9825455    1.193954
        age2 |   1.044442   .0724291     0.63   0.531     .9117084      1.1965
        age3 |   .8118814   .2086128    -0.81   0.417     .4906553    1.343411
             |
   ethnicity |
South Asian  |   .9728901   .2479476    -0.11   0.914     .5903769    1.603239
      Black  |   1.376482   .5082723     0.87   0.387     .6675138    2.838446
      Mixed  |   1.694479   .9909024     0.90   0.367     .5386024    5.330946
      Other  |   .7252567    .518053    -0.45   0.653     .1788447    2.941084
             |
  1.dmard_pc |   .8870541   .0967973    -1.10   0.272     .7162508    1.098589
1.oral_pr~ne |   2.469044   .2558899     8.72   0.000     2.015167    3.025149
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_ind.ster
>  saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egf
> r_cat_nomiss i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever
>  i.neuro_conditions i.flu_vaccine, strata(stp)   

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3488.6232
Iteration 1:   log likelihood = -3200.3327
Iteration 2:   log likelihood = -3141.2861
Iteration 3:   log likelihood =  -3137.039
Iteration 4:   log likelihood = -3136.3498
Iteration 5:   log likelihood = -3136.2879
Iteration 6:   log likelihood = -3136.2872
Iteration 7:   log likelihood = -3136.2872
Refining estimates:
Iteration 0:   log likelihood = -3136.2872

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,022                  Number of obs    =     149,022
No. of failures =          399
Time at risk    =     17599758
                                                LR chi2(25)      =      704.67
Log likelihood  =   -3136.2872                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9238776    .145918    -0.50   0.616     .6779145    1.259082
             |
  population |
        SLE  |   .7687526   .1542196    -1.31   0.190     .5188322    1.139059
      1.male |   1.357484   .1436067     2.89   0.004     1.103284    1.670254
        age1 |   1.084037   .0548075     1.60   0.110     .9817666     1.19696
        age2 |   1.023567   .0721149     0.33   0.741      .891549    1.175133
        age3 |   .8786148   .2291894    -0.50   0.620     .5269385    1.464998
             |
   ethnicity |
South Asian  |   .9795911   .2505062    -0.08   0.936     .5934321    1.617032
      Black  |   1.279037   .4732678     0.67   0.506     .6193305    2.641458
      Mixed  |    1.59964   .9379062     0.80   0.423     .5069239    5.047793
      Other  |   .7492182    .535417    -0.40   0.686     .1846335    3.040228
             |
  1.dmard_pc |   .9705778   .1069227    -0.27   0.786     .7820934    1.204487
1.oral_pr~ne |   2.135754   .2299311     7.05   0.000     1.729468    2.637485
    1.nsaids |   .8266128   .1608422    -0.98   0.328     .5645149      1.2104
1.~c_disease |   1.444664   .1575025     3.37   0.001     1.166717    1.788825
1.resp_exc~a |   1.536695   .1729962     3.82   0.000      1.23243    1.916079
             |
egfr_cat_n~s |
      30-59  |   1.273454   .1490636     2.07   0.039     1.012386    1.601844
        <30  |   2.276722   .5255872     3.56   0.000     1.448131    3.579415
             |
1.~r_disease |   1.204599   .4609202     0.49   0.627     .5690419    2.550005
             |
   obese4cat |
Obese I ..)  |   1.045172   .1424378     0.32   0.746     .8001744    1.365183
Obese II..)  |   1.336551   .2617844     1.48   0.139     .9104676    1.962035
Obese II..)  |    1.65351   .4624502     1.80   0.072     .9557503    2.860678
             |
1.hyperten~n |   1.100849   .1267548     0.83   0.404     .8784517     1.37955
1.cancer_e~r |   1.237461   .1571036     1.68   0.093     .9648634    1.587073
1.neuro_co~s |   1.686525   .2166121     4.07   0.000     1.311195    2.169294
1.flu_vacc~e |   .8401046   .1054087    -1.39   0.165     .6569499    1.074322
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_ind.ster
>  saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7b_ind.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7b: RA and SLE populations as indicator varia
> ble") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Indicator in DAG and Fully Adjusted only") _n      
>                                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  163,774

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 
  470

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  30,512

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 
  68

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7663221   .0994258    -2.05   0.040      .594255    .9882113
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.067968   .1395795     0.50   0.615     .8266269    1.379772
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9289847   .1465355    -0.47   0.641     .6819341    1.265537
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9238776    .145918    -0.50   0.616     .6779145    1.259082
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n 

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\11_an_models_se
> p_pops.log
  log type:  text
 closed on:  21 Jul 2020, 22:05:10
-------------------------------------------------------------------------------
