-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\11_an_models_se
> p_pops.log
  log type:  text
 opened on:  28 Aug 2020, 12:06:26

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 0
(26,763 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   143,702        449 |   144,151 
           |     99.69       0.31 |    100.00 
-----------+----------------------+----------
       HCQ |    23,663         60 |    23,723 
           |     99.75       0.25 |    100.00 
-----------+----------------------+----------
     Total |   167,365        509 |   167,874 
           |     99.70       0.30 |    100.00 

. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6116.7967
Iteration 1:   log likelihood = -6115.4676
Iteration 2:   log likelihood = -6115.4603
Iteration 3:   log likelihood = -6115.4603
Refining estimates:
Iteration 0:   log likelihood = -6115.4603

Cox regression -- Breslow method for ties

No. of subjects =      167,874                  Number of obs    =     167,874
No. of failures =          509
Time at risk    =   22153032.5
                                                LR chi2(1)       =        2.67
Log likelihood  =   -6115.4603                  Prob > chi2      =      0.1021

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8036722   .1104687    -1.59   0.112      .613871    1.052157
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_ra.ster sav
> ed

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6116.7967
Iteration 1:   log likelihood = -6087.5201
Iteration 2:   log likelihood = -5807.8412
Iteration 3:   log likelihood = -5797.3589
Iteration 4:   log likelihood = -5797.1537
Iteration 5:   log likelihood = -5797.1524
Iteration 6:   log likelihood = -5797.1524
Refining estimates:
Iteration 0:   log likelihood = -5797.1524

Cox regression -- Breslow method for ties

No. of subjects =      167,874                  Number of obs    =     167,874
No. of failures =          509
Time at risk    =   22153032.5
                                                LR chi2(5)       =      639.29
Log likelihood  =   -5797.1524                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.038007   .1435795     0.27   0.787     .7915166    1.361258
      1.male |    1.41657   .1297002     3.80   0.000     1.183866    1.695015
        age1 |   1.050179   .0417226     1.23   0.218     .9715066    1.135221
        age2 |   1.088886   .0621592     1.49   0.136     .9736243    1.217793
        age3 |   .7060653   .1521319    -1.62   0.106      .462851    1.077081
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_ra.ster 
> saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp)                              

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4489.2513
Iteration 1:   log likelihood = -4403.8016
Iteration 2:   log likelihood = -4126.4669
Iteration 3:   log likelihood = -4119.2994
Iteration 4:   log likelihood = -4119.1415
Iteration 5:   log likelihood = -4119.1407
Iteration 6:   log likelihood = -4119.1407
Refining estimates:
Iteration 0:   log likelihood = -4119.1407

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      167,874                  Number of obs    =     167,874
No. of failures =          509
Time at risk    =   22153032.5
                                                LR chi2(7)       =      740.22
Log likelihood  =   -4119.1407                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9800082   .1366516    -0.14   0.885     .7456565    1.288014
      1.male |   1.426308   .1307403     3.87   0.000     1.191761    1.707015
        age1 |   1.053697   .0423337     1.30   0.193     .9739069    1.140023
        age2 |   1.075363   .0619306     1.26   0.207     .9605807     1.20386
        age3 |   .7481021   .1624944    -1.34   0.182     .4887338    1.145116
  1.dmard_pc |     .93969   .0876844    -0.67   0.505     .7826313    1.128267
1.oral_pr~ne |   2.484943   .2272168     9.95   0.000     2.077231     2.97268
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_ra.ster 
> saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp)     

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4489.2513
Iteration 1:   log likelihood = -4126.0834
Iteration 2:   log likelihood = -4058.3151
Iteration 3:   log likelihood = -4053.5233
Iteration 4:   log likelihood = -4052.9707
Iteration 5:   log likelihood = -4052.9376
Iteration 6:   log likelihood = -4052.9375
Refining estimates:
Iteration 0:   log likelihood = -4052.9375

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      167,874                  Number of obs    =     167,874
No. of failures =          509
Time at risk    =   22153032.5
                                                LR chi2(29)      =      872.63
Log likelihood  =   -4052.9375                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9811088   .1370803    -0.14   0.891     .7460836     1.29017
      1.male |   1.226379   .1164353     2.15   0.032     1.018145    1.477202
        age1 |   1.050818   .0427004     1.22   0.223     .9703728    1.137933
        age2 |   1.061759     .06193     1.03   0.304     .9470599     1.19035
        age3 |   .7931016   .1744907    -1.05   0.292     .5152946    1.220681
  1.dmard_pc |   1.048958   .0992386     0.51   0.613     .8714221    1.262663
1.oral_pr~ne |   2.179664   .2066048     8.22   0.000     1.810115    2.624658
    1.nsaids |   .9020944   .1493672    -0.62   0.534     .6520959    1.247936
1.~c_disease |   1.442872   .1390572     3.80   0.000     1.194519     1.74286
1.resp_exc~a |   1.325534   .1363373     2.74   0.006      1.08353     1.62159
             |
egfr_cat_n~s |
      30-59  |    1.17145   .1211598     1.53   0.126     .9565026      1.4347
        <30  |    1.99609   .4173992     3.31   0.001     1.324911    3.007277
             |
1.~r_disease |   1.469974   .4715697     1.20   0.230     .7838685    2.756616
             |
   obese4cat |
Obese I ..)  |   1.063626   .1275744     0.51   0.607     .8408012    1.345502
Obese II..)  |   1.221206    .219113     1.11   0.265     .8591392    1.735859
Obese II..)  |   1.352618   .3542797     1.15   0.249     .8095196    2.260077
             |
1.hyperten~n |   1.011672   .1023735     0.11   0.909     .8296688    1.233602
1.cancer_e~r |   1.276477    .142188     2.19   0.028     1.026117    1.587922
1.neuro_co~s |   1.714378   .1950466     4.74   0.000     1.371717    2.142638
1.flu_vacc~e |   .7964628   .0873237    -2.08   0.038     .6424514    .9873945
             |
         imd |
          2  |   1.250697   .1901429     1.47   0.141       .92842    1.684845
          3  |   1.533461   .2277282     2.88   0.004      1.14621    2.051546
          4  |   1.453243   .2211958     2.46   0.014     1.078396    1.958386
5 most de..  |   1.620993   .2514979     3.11   0.002      1.19596    2.197078
             |
     diabcat |
Controlle..  |    1.08375   .1294778     0.67   0.501     .8575006    1.369695
Uncontrol..  |   1.532104   .2473533     2.64   0.008     1.116515    2.102384
Diabetes,..  |   1.860654   .4420333     2.61   0.009     1.168011    2.964043
             |
smoke_nomiss |
     Former  |   1.430291   .1529695     3.35   0.001     1.159814    1.763844
    Current  |   1.133257   .2171277     0.65   0.514     .7784695     1.64974
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_ra.ster 
> saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 1
(167,874 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    19,889         28 |    19,917 
           |     99.86       0.14 |    100.00 
-----------+----------------------+----------
       HCQ |     6,836         10 |     6,846 
           |     99.85       0.15 |    100.00 
-----------+----------------------+----------
     Total |    26,725         38 |    26,763 
           |     99.86       0.14 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -386.27154
Iteration 1:   log likelihood = -386.27152
Iteration 2:   log likelihood = -386.27152
Refining estimates:
Iteration 0:   log likelihood = -386.27152

Cox regression -- Breslow method for ties

No. of subjects =       26,763                  Number of obs    =      26,763
No. of failures =           38
Time at risk    =      3483589
                                                LR chi2(1)       =        0.00
Log likelihood  =   -386.27152                  Prob > chi2      =      0.9950

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    1.00233   .3692541     0.01   0.995     .4868908     2.06343
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_sle.ster sa
> ved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -386.27154
Iteration 1:   log likelihood = -362.36185
Iteration 2:   log likelihood = -355.13299
Iteration 3:   log likelihood = -354.93365
Iteration 4:   log likelihood =  -354.9196
Iteration 5:   log likelihood = -354.91947
Iteration 6:   log likelihood = -354.91947
Refining estimates:
Iteration 0:   log likelihood = -354.91947

Cox regression -- Breslow method for ties

No. of subjects =       26,763                  Number of obs    =      26,763
No. of failures =           38
Time at risk    =      3483589
                                                LR chi2(5)       =       62.70
Log likelihood  =   -354.91947                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.753131   .6614216     1.49   0.137     .8368987     3.67245
      1.male |   2.169306    .748662     2.24   0.025     1.102955     4.26662
        age1 |   1.049592   .0900271     0.56   0.573     .8871761     1.24174
        age2 |   1.092851   .1523384     0.64   0.524      .831586    1.436198
        age3 |   .6803389   .3909902    -0.67   0.503      .220567    2.098505
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_sle.ster
>  saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp)                          

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -191.89171
Iteration 1:   log likelihood = -172.02643
Iteration 2:   log likelihood = -163.98749
Iteration 3:   log likelihood = -163.33318
Iteration 4:   log likelihood =   -163.144
Iteration 5:   log likelihood = -163.09156
Iteration 6:   log likelihood = -163.07353
Iteration 7:   log likelihood = -163.06693
Iteration 8:   log likelihood =  -163.0645
Iteration 9:   log likelihood = -163.06361
Iteration 10:  log likelihood = -163.06328
Iteration 11:  log likelihood = -163.06316
Iteration 12:  log likelihood = -163.06311
Iteration 13:  log likelihood =  -163.0631
Iteration 14:  log likelihood = -163.06309
Iteration 15:  log likelihood = -163.06309
Iteration 16:  log likelihood = -163.06309
Iteration 17:  log likelihood = -163.06309
Iteration 18:  log likelihood = -163.06309
Iteration 19:  log likelihood = -163.06309
Iteration 20:  log likelihood = -163.06309
Iteration 21:  log likelihood = -163.06309
Iteration 22:  log likelihood = -163.06309
Iteration 23:  log likelihood = -163.06309
Iteration 24:  log likelihood = -163.06309
Iteration 25:  log likelihood = -163.06309
Iteration 26:  log likelihood = -163.06309
Iteration 27:  log likelihood = -163.06309
Iteration 28:  log likelihood = -163.06309
Iteration 29:  log likelihood = -163.06309
Iteration 30:  log likelihood = -163.06309
Iteration 31:  log likelihood = -163.06309
Iteration 32:  log likelihood = -163.06309
Iteration 33:  log likelihood = -163.06309
Iteration 34:  log likelihood = -163.06309
Refining estimates:
Iteration 0:   log likelihood = -163.06309
Iteration 1:   log likelihood = -163.06309

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,713                  Number of obs    =      20,713
No. of failures =           29
Time at risk    =      2694614
                                                LR chi2(11)      =       57.66
Log likelihood  =   -163.06309                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.637961    .739437     1.09   0.274      .676144    3.967965
      1.male |   2.356179   .9356979     2.16   0.031     1.081869     5.13147
        age1 |   1.119525   .1632329     0.77   0.439     .8412481    1.489854
        age2 |   .9816587   .2069052    -0.09   0.930     .6494592    1.483779
        age3 |   1.053768   .8480864     0.07   0.948     .2176139    5.102738
             |
   ethnicity |
South Asian  |   9.23e-16   2.13e-08    -0.00   1.000            0           .
      Black  |   1.029561    1.11195     0.03   0.978     .1239752    8.550065
      Mixed  |   1.23e-15   6.57e-08    -0.00   1.000            0           .
      Other  |   1.13e-15   5.42e-08    -0.00   1.000            0           .
             |
  1.dmard_pc |   .3564269   .3703061    -0.99   0.321     .0465183    2.730974
1.oral_pr~ne |   1.704559   .7629265     1.19   0.233     .7089756    4.098197
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_sle.ster
>  saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -191.89171
Iteration 1:   log likelihood = -169.31468
Iteration 2:   log likelihood = -152.21692
Iteration 3:   log likelihood = -150.77161
Iteration 4:   log likelihood = -150.51129
Iteration 5:   log likelihood = -150.42406
Iteration 6:   log likelihood = -150.39229
Iteration 7:   log likelihood = -150.38062
Iteration 8:   log likelihood = -150.37633
Iteration 9:   log likelihood = -150.37476
Iteration 10:  log likelihood = -150.37418
Iteration 11:  log likelihood = -150.37396
Iteration 12:  log likelihood = -150.37388
Iteration 13:  log likelihood = -150.37386
Iteration 14:  log likelihood = -150.37385
Iteration 15:  log likelihood = -150.37384
Iteration 16:  log likelihood = -150.37384
Iteration 17:  log likelihood = -150.37384
Iteration 18:  log likelihood = -150.37384
Iteration 19:  log likelihood = -150.37384
Iteration 20:  log likelihood = -150.37384
Iteration 21:  log likelihood = -150.37384
Iteration 22:  log likelihood = -150.37384
Iteration 23:  log likelihood = -150.37384
Iteration 24:  log likelihood = -150.37384
Iteration 25:  log likelihood = -150.37384
Iteration 26:  log likelihood = -150.37384
Iteration 27:  log likelihood = -150.37384
Iteration 28:  log likelihood = -150.37384
Iteration 29:  log likelihood = -150.37384
Iteration 30:  log likelihood = -150.37384
Iteration 31:  log likelihood = -150.37384
Iteration 32:  log likelihood = -150.37384
Iteration 33:  log likelihood = -150.37384
Refining estimates:
Iteration 0:   log likelihood = -150.37384
Iteration 1:   log likelihood = -150.37384
Iteration 2:   log likelihood = -150.37384
Iteration 3:   log likelihood = -150.37384

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,713                  Number of obs    =      20,713
No. of failures =           29
Time at risk    =      2694614
                                                LR chi2(33)      =       83.04
Log likelihood  =   -150.37384                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.738334   .7962599     1.21   0.227     .7083249    4.266128
      1.male |   1.735217   .7188915     1.33   0.183      .770381    3.908429
        age1 |   1.135606   .1768851     0.82   0.414     .8368392    1.541037
        age2 |   .9151039   .2049422    -0.40   0.692     .5899829    1.419389
        age3 |   1.383917   1.178701     0.38   0.703     .2606934    7.346664
             |
   ethnicity |
South Asian  |   4.54e-16   1.62e-08    -0.00   1.000            0           .
      Black  |   1.206967    1.35895     0.17   0.867     .1328339    10.96684
      Mixed  |   8.04e-16   5.59e-08    -0.00   1.000            0           .
      Other  |   2.43e-16   2.61e-08    -0.00   1.000            0           .
             |
  1.dmard_pc |    .408373   .4256106    -0.86   0.390     .0529573    3.149113
1.oral_pr~ne |   1.161969   .5501582     0.32   0.751     .4593836    2.939094
    1.nsaids |   2.49e-16   1.22e-08    -0.00   1.000            0           .
1.~c_disease |    1.68838    .707909     1.25   0.212     .7422942    3.840295
1.resp_exc~a |   1.877916   .7982086     1.48   0.138     .8163429    4.319958
             |
egfr_cat_n~s |
      30-59  |   1.486272   .6908562     0.85   0.394     .5976386    3.696221
        <30  |   3.668328    2.54474     1.87   0.061     .9418567    14.28735
             |
1.~r_disease |   2.02e-16   1.58e-08    -0.00   1.000            0           .
             |
   obese4cat |
Obese I ..)  |   .6934654   .3878882    -0.65   0.513     .2316899    2.075594
Obese II..)  |    .501588   .5260506    -0.66   0.511     .0642144    3.917979
Obese II..)  |   1.380669   1.462288     0.30   0.761     .1732084    11.00551
             |
1.hyperten~n |   1.503436   .6888883     0.89   0.374     .6124304     3.69074
1.cancer_e~r |   1.182285   .5957859     0.33   0.740     .4403299    3.174432
1.neuro_co~s |   1.507462   .7198571     0.86   0.390     .5912526    3.843439
1.flu_vacc~e |   .8079293   .3846965    -0.45   0.654     .3177406    2.054348
             |
         imd |
          2  |   1.435415   .7588679     0.68   0.494     .5092943    4.045632
          3  |   .6849394   .4531539    -0.57   0.567     .1872835    2.504982
          4  |   .5047254   .3752507    -0.92   0.358     .1175461    2.167216
5 most de..  |   .8883573   .5486459    -0.19   0.848     .2647823    2.980481
             |
     diabcat |
Controlle..  |   1.185927   .5890177     0.34   0.731     .4480113    3.139255
Uncontrol..  |   1.898877   1.285309     0.95   0.343     .5038911     7.15578
Diabetes,..  |   1.66e-16   2.12e-08    -0.00   1.000            0           .
             |
smoke_nomiss |
     Former  |    1.75052   .8653844     1.13   0.257     .6643063    4.612812
    Current  |   1.403811   1.053764     0.45   0.651     .3223727    6.113065
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_sle.ster
>  saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7a_sep.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7a: RA and SLE populations separately") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Rheumatoid arthritis (RA)") _n                     
>                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 0
  144,151

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 0
  449

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 0
  23,723

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 0
  60

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8036722   .1104687    -1.59   0.112      .613871    1.052157
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.038007   .1435795     0.27   0.787     .7915166    1.361258
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9800082   .1366516    -0.14   0.885     .7456565    1.288014
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9811088   .1370803    -0.14   0.891     .7460836     1.29017
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model  ==========================*/
. file write tablecontent ("Systemic lupus erythematosus (SLE)") _n            
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 1
  19,917

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 1
  28

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 1
  6,846

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 1
  10

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_sle 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.00233   .3692541     0.01   0.995     .4868908     2.06343
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.753131   .6614216     1.49   0.137     .8368987     3.67245
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.637961    .739437     1.09   0.274      .676144    3.967965
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.738334   .7962599     1.21   0.227     .7083249    4.266128
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* INDICATOR VARIABLE========================================================
> */ 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
       HCQ |         death
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   163,591        477 |   164,068 
           |     99.71       0.29 |    100.00 
-----------+----------------------+----------
       HCQ |    30,499         70 |    30,569 
           |     99.77       0.23 |    100.00 
-----------+----------------------+----------
     Total |   194,090        547 |   194,637 
           |     99.72       0.28 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6651.1941
Iteration 2:   log likelihood = -6651.1805
Iteration 3:   log likelihood = -6651.1805
Refining estimates:
Iteration 0:   log likelihood = -6651.1805

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(1)       =        4.13
Log likelihood  =   -6651.1805                  Prob > chi2      =      0.0421

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7771215    .099466    -1.97   0.049     .6047017    .9987036
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/univar_ind.ster sa
> ved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -6653.2457
Iteration 1:   log likelihood = -6363.7842
Iteration 2:   log likelihood = -6299.4394
Iteration 3:   log likelihood = -6293.4165
Iteration 4:   log likelihood = -6292.6884
Iteration 5:   log likelihood = -6292.6429
Iteration 6:   log likelihood = -6292.6426
Refining estimates:
Iteration 0:   log likelihood = -6292.6426

Cox regression -- Breslow method for ties

No. of subjects =      194,637                  Number of obs    =     194,637
No. of failures =          547
Time at risk    =   25636621.5
                                                LR chi2(5)       =      721.21
Log likelihood  =   -6292.6426                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.084274   .1398098     0.63   0.530     .8421363    1.396033
      1.male |   1.462889   .1293406     4.30   0.000     1.230135    1.739682
        age1 |   1.050966   .0377137     1.39   0.166     .9795883    1.127545
        age2 |   1.088567   .0570047     1.62   0.105     .9823821    1.206229
        age3 |   .7057895   .1409865    -1.74   0.081     .4771353     1.04402
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar1_ind.ster
>  saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone, strata(stp)                             

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3549.3679
Iteration 1:   log likelihood =  -3545.248
Iteration 2:   log likelihood = -3265.9473
Iteration 3:   log likelihood = -3232.0949
Iteration 4:   log likelihood = -3230.1323
Iteration 5:   log likelihood =  -3230.111
Iteration 6:   log likelihood =  -3230.111
Refining estimates:
Iteration 0:   log likelihood =  -3230.111

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =          406
Time at risk    =     19665328
                                                LR chi2(12)      =      638.51
Log likelihood  =    -3230.111                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9355039   .1460702    -0.43   0.669     .6888718    1.270436
             |
  population |
        SLE  |   .8051148   .1586226    -1.10   0.271     .5472116    1.184569
      1.male |   1.470719   .1513953     3.75   0.000     1.202008    1.799501
        age1 |   1.079984   .0531603     1.56   0.118     .9806604    1.189368
        age2 |   1.051301   .0722904     0.73   0.467     .9187479    1.202979
        age3 |   .7898859   .2014389    -0.92   0.355     .4791688    1.302087
             |
   ethnicity |
South Asian  |   .9494535   .2418134    -0.20   0.839     .5763467    1.564097
      Black  |    1.33468   .4925173     0.78   0.434     .6475463    2.750955
      Mixed  |    1.64918   .9642601     0.86   0.392     .5242985    5.187494
      Other  |   .7014936   .5010957    -0.50   0.620     .1729767    2.844853
             |
  1.dmard_pc |   .8854762   .0958816    -1.12   0.261     .7161544    1.094831
1.oral_pr~ne |   2.422094   .2493469     8.59   0.000     1.979531    2.963599
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar2_ind.ster
>  saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egf
> r_cat_nomiss i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever
>  i.neuro_conditions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp)
>     

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3549.3679
Iteration 1:   log likelihood = -3242.8991
Iteration 2:   log likelihood = -3182.2981
Iteration 3:   log likelihood = -3178.0129
Iteration 4:   log likelihood = -3177.3144
Iteration 5:   log likelihood = -3177.2515
Iteration 6:   log likelihood = -3177.2508
Iteration 7:   log likelihood = -3177.2508
Refining estimates:
Iteration 0:   log likelihood = -3177.2508

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,309                  Number of obs    =     149,309
No. of failures =          406
Time at risk    =     19665328
                                                LR chi2(34)      =      744.23
Log likelihood  =   -3177.2508                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9337551   .1460972    -0.44   0.661     .6871511     1.26886
             |
  population |
        SLE  |    .799024   .1576955    -1.14   0.256     .5427084    1.176395
      1.male |   1.282047   .1367503     2.33   0.020     1.040183    1.580148
        age1 |   1.079394   .0540182     1.53   0.127      .978547    1.190634
        age2 |   1.030034   .0719983     0.42   0.672     .8981599    1.181272
        age3 |   .8594579   .2226523    -0.58   0.559     .5172628    1.428032
             |
   ethnicity |
South Asian  |    .929311   .2430876    -0.28   0.779     .5565513    1.551733
      Black  |   1.193616   .4438087     0.48   0.634     .5759331    2.473758
      Mixed  |   1.440794   .8461747     0.62   0.534     .4557152    4.555231
      Other  |   .7071542   .5058115    -0.48   0.628     .1740479    2.873158
             |
  1.dmard_pc |   .9801436   .1074059    -0.18   0.855     .7907033    1.214971
1.oral_pr~ne |   2.087237   .2234564     6.87   0.000     1.692168    2.574543
    1.nsaids |    .830799   .1615976    -0.95   0.341      .567453     1.21636
1.~c_disease |   1.418616   .1535417     3.23   0.001     1.147456    1.753853
1.resp_exc~a |   1.423521   .1619277     3.10   0.002     1.139039    1.779055
             |
egfr_cat_n~s |
      30-59  |   1.249291    .144699     1.92   0.055     .9955739    1.567668
        <30  |   2.077779   .4814902     3.16   0.002     1.319312    3.272283
             |
1.~r_disease |   1.125222   .4309793     0.31   0.758     .5311455    2.383762
             |
   obese4cat |
Obese I ..)  |   .9761792   .1328353    -0.18   0.859     .7476542    1.274554
Obese II..)  |    1.18249   .2363688     0.84   0.402     .7991899    1.749624
Obese II..)  |    1.43039   .4025585     1.27   0.203     .8239459    2.483193
             |
1.hyperten~n |   1.062425   .1222423     0.53   0.599     .8479288    1.331181
1.cancer_e~r |   1.249249   .1567539     1.77   0.076     .9768803    1.597557
1.neuro_co~s |   1.690318   .2137372     4.15   0.000     1.319276    2.165713
1.flu_vacc~e |   .8306115   .1035434    -1.49   0.137     .6505607    1.060494
             |
         imd |
          2  |    1.26683   .2162926     1.39   0.166     .9065425    1.770307
          3  |   1.421779   .2416236     2.07   0.038     1.019002     1.98376
          4  |   1.344611   .2325742     1.71   0.087      .958002     1.88724
5 most de..  |   1.609409   .2777924     2.76   0.006     1.147479    2.257295
             |
     diabcat |
Controlle..  |   1.109337   .1460044     0.79   0.430     .8571034    1.435799
Uncontrol..  |   1.441304   .2634971     2.00   0.046     1.007257    2.062391
Diabetes,..  |   1.858789   .4975686     2.32   0.021     1.099959    3.141111
             |
smoke_nomiss |
     Former  |   1.367564   .1660831     2.58   0.010     1.077889    1.735087
    Current  |   1.023208   .2219003     0.11   0.916     .6689076     1.56517
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/tempdata/multivar3_ind.ster
>  saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7b_ind.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7b: RA and SLE populations as indicator varia
> ble") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Indicator in DAG and Fully Adjusted only") _n      
>                                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  164,068

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 
  477

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  30,569

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 
  70

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7771215    .099466    -1.97   0.049     .6047017    .9987036
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.084274   .1398098     0.63   0.530     .8421363    1.396033
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9355039   .1460702    -0.43   0.669     .6888718    1.270436
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9337551   .1460972    -0.44   0.661     .6871511     1.26886
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n 

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/log\11_an_models_se
> p_pops.log
  log type:  text
 closed on:  28 Aug 2020, 12:07:39
-------------------------------------------------------------------------------
