-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\05_an_des
> criptive_plots.log
  log type:  text
 opened on:  17 Aug 2020, 10:31:56

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ | positive test or code
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   163,195      1,210 |   164,405 
       HCQ |    30,405        204 |    30,609 
-----------+----------------------+----------
     Total |   193,600      1,414 |   195,014 

. 
. /* Generate KM PLOT==========================================================
> =*/ 
. 
. count if exposure != .u
  195,014

. noi display "RUNNING THE KM PLOT FOR `r(N)' PEOPLE WITH NON-MISSING EXPOSURE"
RUNNING THE KM PLOT FOR 195014 PEOPLE WITH NON-MISSING EXPOSURE

. 
. sts graph, by(exposure) failure ci                                           
>                                    ///     
>                    title("Time to $tableoutcome", justification(left) size(me
> dsmall) )             ///
>                    xtitle("Days since 1 Mar 2020", size(small))              
>                            ///
>                    yscale(range(0, $ymax))                                   
>                                                    ///
>                    ylabel(0 (0.001) $ymax, angle(0) format(%4.3f) labsize(sma
> ll))       ///
>                    xscale(range(30, 84))                                     
>                                                    ///
>                    xlabel(0 (20) 160, labsize(small))                        
>                                    ///                             
>                    legend(size(vsmall) label (1 "No HCQ") label (2 "HCQ") reg
> ion(lwidth(none)) position(12))    ///
>                    graphregion(fcolor(white)) ///       
>                    risktable(,size(vsmall) order (1 "No HCQ" 2 "HCQ") title(,
> size(vsmall))) ///
>                    saving(kmplot1, replace)

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
(note: file kmplot1.gph not found)
(file kmplot1.gph saved)
(file kmplot1.gph saved)

. 
. graph export "$Tabfigdir/kmplot1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/sens3/tabfig/kmplot1.svg w
> ritten in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase kmplot1.gph

. 
. 
. 
. 
. 
. 
. 
. /* DAG Adjusted curves ======================================================
> =*/ 
. //stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone, df(4) scale(
> hazard) eform /*strata(stp population) ******************** TO DO: HOW TO HAN
> DLE STRATA ***/       
. 
. *NOTE: this model will not run with stp and population as stratification vari
> ables
. *Moved population to an indicator variable, and will compare model estimates 
> from stcox
. stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone population, df(
> 4) scale(hazard) eform stratify(stp)

initial values not feasible
r(1400);

end of do-file
r(1400);

end of do-file

r(1400);

. do "E:\STATATMP\STD4ba8_000000.tmp"

. cap noi stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone populat
> ion, df(4) scale(hazard) eform stratify(stp)

initial values not feasible

. 
end of do-file

. do "E:\STATATMP\STD4ba8_000000.tmp"

. 
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    195,014    154.4361     19.9374         .5        158

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range days 0 `tmax' `tmaxplus1'
(194,855 missing values generated)

. stpm2_standsurv if exposure == 1, at1(exposure 0) at2(exposure 1) timevar(day
> s) ci contrast(difference) fail
You need to fit an stpm2 model to use stpm2_standsurv
r(198);

end of do-file

r(198);

. do "E:\STATATMP\STD4ba8_000000.tmp"

. cap noi stpm2_standsurv if exposure == 1, at1(exposure 0) at2(exposure 1) tim
> evar(days) ci contrast(difference) fail
You need to fit an stpm2 model to use stpm2_standsurv

. 
. gen date = d(1/3/2020)+ days
(194,855 missing values generated)

. format date %tddd_Month

. 
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci: replace X=100*X
variable _at1 not found
r(111);

end of do-file

r(111);

. do "E:\STATATMP\STD4ba8_000000.tmp"

. do "06_an_models.do"

. /*===========================================================================
> ===
> DO FILE NAME:                   06_an_models
> PROJECT:                                HCQ in COVID-19 
> DATE:                                   6 July 2020 
> AUTHOR:                                 C Rentsch
>                                                 adapted from A Schultze      
>                                                    
> DESCRIPTION OF FILE:    program 06 
>                                                 univariable regression
>                                                 multivariable regression 
>                                                 interaction models are in: 
>                                                         07_an_models_interact
>                                                  model checks are in: 
>                                                         08_an_model_checks
> DATASETS USED:                  data in memory ($Tempdir/analysis_dataset_STS
> ET_$outcome)
> 
> DATASETS CREATED:               none
> OTHER OUTPUT:                   logfiles, printed to folder $Logdir
>                                                 table2, printed to $Tabfigdir
> USER-INSTALLED ADO:     parmest 
>   (place .ado file(s) in analysis folder)                                    
>                            
> =============================================================================
> =*/
. 
. 
. * Open a log file
. 
. cap log close
