-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\05_an_des
> criptive_plots.log
  log type:  text
 opened on:  19 Jul 2020, 18:40:52

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   162,580      1,147 |   163,727 
       HCQ |    30,314        185 |    30,499 
-----------+----------------------+----------
     Total |   192,894      1,332 |   194,226 

. 
. /* Generate KM PLOT==========================================================
> =*/ 
. 
. count if exposure != .u
  194,226

. noi display "RUNNING THE KM PLOT FOR `r(N)' PEOPLE WITH NON-MISSING EXPOSURE"
RUNNING THE KM PLOT FOR 194226 PEOPLE WITH NON-MISSING EXPOSURE

. 
. sts graph, by(exposure) failure ci                                           
>                                    ///     
>                    title("Time to $tableoutcome", justification(left) size(me
> dsmall) )             ///
>                    xtitle("Days since 1 Mar 2020", size(small))              
>                            ///
>                    yscale(range(0, $ymax))                                   
>                                                    ///
>                    ylabel(0 (0.001) $ymax, angle(0) format(%4.3f) labsize(sma
> ll))       ///
>                    xscale(range(30, 84))                                     
>                                                    ///
>                    xlabel(0 (20) 160, labsize(small))                        
>                                    ///                             
>                    legend(size(vsmall) label (1 "No HCQ") label (2 "HCQ") reg
> ion(lwidth(none)) position(12))    ///
>                    graphregion(fcolor(white)) ///       
>                    risktable(,size(vsmall) order (1 "No HCQ" 2 "HCQ") title(,
> size(vsmall))) ///
>                    saving(kmplot1, replace)

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id
(note: file kmplot1.gph not found)
(file kmplot1.gph saved)
(file kmplot1.gph saved)

. 
. graph export "$Tabfigdir/kmplot1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/sens3/tabfig/kmplot1.svg w
> ritten in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase kmplot1.gph

. 
. 
. 
. 
. 
. 
. 
. /* DAG Adjusted curves ======================================================
> =*/ 
. stpm2 exposure male age1 age2 age3 dmard_pc oral_prednisolone, df(4) scale(ha
> zard) eform /*strata(stp population) ******************** TO DO: HOW TO HANDL
> E STRATA ***/ 

Iteration 0:   log likelihood = -8680.7474  
Iteration 1:   log likelihood = -8591.5229  
Iteration 2:   log likelihood = -8562.5781  
Iteration 3:   log likelihood = -8561.3839  
Iteration 4:   log likelihood = -8561.3797  
Iteration 5:   log likelihood = -8561.3797  

Log likelihood = -8561.3797                     Number of obs     =    194,226

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
    exposure |   .8970635     .07217    -1.35   0.177     .7662013    1.050276
        male |   1.143396   .0674588     2.27   0.023     1.018538    1.283561
        age1 |   1.007161   .0074964     0.96   0.338     .9925746    1.021961
        age2 |   .9959713   .0147597    -0.27   0.785     .9674588    1.025324
        age3 |   1.173298   .0825303     2.27   0.023     1.022197    1.346735
    dmard_pc |   1.129791   .0642756     2.15   0.032     1.010583    1.263061
oral_pred~ne |   1.805655   .1104316     9.66   0.000     1.601682    2.035603
       _rcs1 |   1.962255   .1044397    12.67   0.000     1.767872    2.178011
       _rcs2 |   1.283445   .0613057     5.22   0.000     1.168741    1.409407
       _rcs3 |   1.040647   .0088595     4.68   0.000     1.023427    1.058157
       _rcs4 |   .9984056    .001334    -1.19   0.232     .9957944    1.001024
       _cons |   .0027306   .0009455   -17.05   0.000     .0013852    .0053827
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    194,226     126.471    15.00373          1        129

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range days 0 `tmax' `tmaxplus1'
(194,096 missing values generated)

. stpm2_standsurv if exposure == 1, at1(exposure 0) at2(exposure 1) timevar(day
> s) ci contrast(difference) fail

. 
. gen date = d(1/3/2020)+ days
(194,096 missing values generated)

. format date %tddd_Month

. 
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci: replace X=100*X

->  replace _at1=100*_at1
(129 real changes made)

->  replace _at2=100*_at2
(129 real changes made)

->  replace _at1_lci=100*_at1_lci
(129 real changes made)

->  replace _at1_uci=100*_at1_uci
(129 real changes made)

->  replace _at2_lci=100*_at2_lci
(129 real changes made)

->  replace _at2_uci=100*_at2_uci
(129 real changes made)

. 
. *l date days _at1 _at1_lci _at1_uci _at2 _at2_lci _at2_uci if days<.
. 
. twoway  (rarea _at1_lci _at1_uci days, color(red%25)) ///
>                  (rarea _at2_lci _at2_uci days if _at2_uci<1, color(blue%25))
>  ///
>                  (line _at1 days, sort lcolor(red)) ///
>                  (line _at2  days, sort lcolor(blue)) ///
>                  , legend(order(1 "No HCQ" 2 "HCQ") ring(0) cols(1) pos(11) r
> egion(lwidth(none))) ///
>                                  title("Time to $tableoutcome", justification
> (left) size(medsmall) )       ///
>                                  yscale(range(0, 1))                         
>                                                            ///
>                                  ylabel(0 (0.1) 1, angle(0) format(%4.1f) lab
> size(small))       ///
>                                  xlabel(0 (20) 160, labsize(small))          
>                                                    ///                     
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days since 1 Mar 2020", size(small))                
>    ///
>                                  graphregion(fcolor(white)) saving(adjcurv1, 
> replace)
(note: file adjcurv1.gph not found)
(file adjcurv1.gph saved)

. 
. graph export "$Tabfigdir/adjcurv1.svg", as(svg) replace
(file E:\analyses\hydroxychloroquine-research/output/sens3/tabfig/adjcurv1.svg 
> written in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adjcurv1.gph

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\05_an_des
> criptive_plots.log
  log type:  text
 closed on:  19 Jul 2020, 18:41:43
-------------------------------------------------------------------------------
