-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\06_an_mod
> els.log
  log type:  text
 opened on:  15 Jul 2020, 10:08:26

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   162,580      1,147 |   163,727 
           |     99.30       0.70 |    100.00 
-----------+----------------------+----------
       HCQ |    30,314        185 |    30,499 
           |     99.39       0.61 |    100.00 
-----------+----------------------+----------
     Total |   192,894      1,332 |   194,226 
           |     99.31       0.69 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16194.173
Iteration 1:   log likelihood = -16192.112
Iteration 2:   log likelihood = -16192.106
Iteration 3:   log likelihood = -16192.106
Refining estimates:
Iteration 0:   log likelihood = -16192.106

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24565206
                                                LR chi2(1)       =        4.13
Log likelihood  =   -16192.106                  Prob > chi2      =      0.0420

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8537962   .0676455    -2.00   0.046     .7309948    .9972274
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univa
> r.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar.ster 
> saved

. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. * Age fit as spline 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16194.173
Iteration 1:   log likelihood = -16101.116
Iteration 2:   log likelihood = -16067.483
Iteration 3:   log likelihood =  -16066.79
Iteration 4:   log likelihood =  -16066.79
Refining estimates:
Iteration 0:   log likelihood =  -16066.79

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24565206
                                                LR chi2(5)       =      254.77
Log likelihood  =    -16066.79                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9593563   .0765111    -0.52   0.603     .8205299    1.121671
      1.male |   1.143496   .0674103     2.27   0.023     1.018721    1.283553
        age1 |     1.0076    .007484     1.02   0.308     .9930381    1.022376
        age2 |   1.001322   .0148066     0.09   0.929     .9727178    1.030767
        age3 |   1.136168   .0795965     1.82   0.068     .9903986    1.303392
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multi
> var1.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1.st
> er saved

. 
. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
.         *Note: ethnicity missing for ~20-25%. will model ethnicity in several
>  ways in separate do file
. 
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp)                              

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11932.449
Iteration 1:   log likelihood = -11791.178
Iteration 2:   log likelihood = -11753.642
Iteration 3:   log likelihood = -11752.966
Iteration 4:   log likelihood = -11752.966
Refining estimates:
Iteration 0:   log likelihood = -11752.966

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24565206
                                                LR chi2(7)       =      358.97
Log likelihood  =   -11752.966                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9067939   .0731843    -1.21   0.225     .7741247      1.0622
      1.male |   1.154672   .0681573     2.44   0.015     1.028524    1.296292
        age1 |   1.008697   .0075276     1.16   0.246     .9940501    1.023559
        age2 |    .995704    .014796    -0.29   0.772     .9671226     1.02513
        age3 |   1.171791   .0826906     2.25   0.025     1.020429    1.345605
  1.dmard_pc |   1.130862   .0646463     2.15   0.031     1.010998    1.264937
1.oral_pr~ne |   1.811588    .111111     9.69   0.000     1.606394    2.042991
------------------------------------------------------------------------------
                                                             Stratified by stp

.                                                                              
>    
. estimates save $Tempdir/multivar2, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multi
> var2.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2.st
> er saved

. 
. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. 
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions, stra
> ta(stp)  

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11932.449
Iteration 1:   log likelihood = -11795.485
Iteration 2:   log likelihood = -11695.869
Iteration 3:   log likelihood =  -11687.31
Iteration 4:   log likelihood = -11686.983
Iteration 5:   log likelihood = -11686.983
Refining estimates:
Iteration 0:   log likelihood = -11686.983

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24565206
                                                LR chi2(19)      =      490.93
Log likelihood  =   -11686.983                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8946609     .07225    -1.38   0.168     .7636917    1.048091
      1.male |   1.101715   .0660052     1.62   0.106     .9796535    1.238984
        age1 |   1.004231   .0075385     0.56   0.574     .9895645    1.019116
        age2 |   .9879638   .0148714    -0.80   0.421     .9592421    1.017545
        age3 |   1.215906   .0868532     2.74   0.006     1.057056    1.398628
  1.dmard_pc |   1.181818   .0679746     2.90   0.004     1.055825    1.322845
1.oral_pr~ne |   1.626722   .1034246     7.65   0.000     1.436135    1.842602
    1.nsaids |   1.020923   .0825994     0.26   0.798     .8712147    1.196357
1.~c_disease |   1.341821   .0908174     4.34   0.000     1.175123    1.532166
1.resp_exc~a |    1.29788   .0918233     3.69   0.000     1.129831    1.490926
             |
egfr_cat_n~s |
      30-59  |   1.107055   .0856398     1.31   0.189     .9513095    1.288299
        <30  |   2.161065   .3448961     4.83   0.000     1.580593    2.954716
             |
1.~r_disease |   1.180879   .2490475     0.79   0.431     .7810647    1.785353
             |
   obese4cat |
Obese I ..)  |   1.203983   .0857467     2.61   0.009     1.047125    1.384338
Obese II..)  |   1.264034   .1291501     2.29   0.022     1.034639    1.544289
Obese II..)  |   1.623696     .20788     3.79   0.000     1.263358    2.086811
             |
1.hyperten~n |   1.106939   .0690581     1.63   0.103     .9795354    1.250913
1.cancer_e~r |    1.27202   .0993118     3.08   0.002     1.091534     1.48235
1.neuro_co~s |   1.533799   .1298068     5.05   0.000     1.299363    1.810533
------------------------------------------------------------------------------
                                                             Stratified by stp

.                                                                              
>    
. estimates save $Tempdir/multivar3, replace 
(note: file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multi
> var3.ster not found)
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3.st
> er saved

. 
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table2.txt, write text replace
(note: file E:\analyses\hydroxychloroquine-research/output/sens3/tabfig/table2.
> txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between HCQ use and $tableoutc
> ome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  163,727

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  1,147

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  30,499

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  185

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8537962   .0676455    -2.00   0.046     .7309948    .9972274
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9593563   .0765111    -0.52   0.603     .8205299    1.121671
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9067939   .0731843    -1.21   0.225     .7741247      1.0622
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8946609     .07225    -1.38   0.168     .7636917    1.048091
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\06_an_mod
> els.log
  log type:  text
 closed on:  15 Jul 2020, 10:08:48
-------------------------------------------------------------------------------
