-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\07_an_mod
> els_interact.log
  log type:  text
 opened on:  19 Jul 2020, 18:42:06

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* So few deaths occuring below 60 years this cannot be used as a category, s
> o combining 18-59 */ 
. gen agegroup2 = agegroup

. recode agegroup2(1 = 2)
(agegroup2: 13683 changes made)

. recode agegroup2(2 = 3)
(agegroup2: 33089 changes made)

. tab agegroup2, nolabel 

  agegroup2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     70,112       36.10       36.10
          4 |     45,613       23.48       59.58
          5 |     49,099       25.28       84.86
          6 |     29,402       15.14      100.00
------------+-----------------------------------
      Total |    194,226      100.00

. 
. label define agegroup2  3 "18-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup2 agegroup2

. tab agegroup agegroup2 , m

   Grouped |                  agegroup2
       age |    18-<60     60-<70     70-<80        80+ |     Total
-----------+--------------------------------------------+----------
    18-<40 |    13,683          0          0          0 |    13,683 
    40-<50 |    19,406          0          0          0 |    19,406 
    50-<60 |    37,023          0          0          0 |    37,023 
    60-<70 |         0     45,613          0          0 |    45,613 
    70-<80 |         0          0     49,099          0 |    49,099 
       80+ |         0          0          0     29,402 |    29,402 
-----------+--------------------------------------------+----------
     Total |    70,112     45,613     49,099     29,402 |   194,226 

. 
. 
. foreach intvar of varlist agegroup2 dmard_pc oral_prednisolone nsaids {
  2. /* Check Counts */ 
. 
. bysort `intvar': tab exposure $outcome, row
  3. 
. /* Univariable model */ 
. stcox i.exposure
  4. estimates store A
  5. 
. stcox i.exposure##i.`intvar'
  6. estimates store B
  7. estimates save $Tempdir/univar_int_`intvar', replace 
  8. 
. lrtest A B
  9. global univar_p_`intvar' = round(r(p),0.001)
 10. 
. /* Multivariable models */ 
. 
. * Age and Sex 
. stcox i.exposure i.agegroup2 i.male
 11. estimates store A
 12. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male
 13. estimates store B
 14. estimates save $Tempdir/multivar1_int_`intvar', replace 
 15. 
. lrtest A B
 16. global multivar1_p_`intvar' = round(r(p),0.001)
 17. 
. * DAG Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone, strata(st
> p population)                                      
 18.                                                                           
>       
. estimates store A
 19. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e, strata(stp population)                  
 20. estimates store B
 21. estimates save $Tempdir/multivar2_int_`intvar', replace 
 22. 
. lrtest A B
 23. global multivar2_p_`intvar' = round(r(p),0.001)
 24. 
. * Fully Adjusted 
. stcox i.exposure i.agegroup2 i.male i.dmard_pc i.oral_prednisolone i.nsaids i
> .chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_liver
> _disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu_va
> ccine, strata(stp population)
 25. estimates store A
 26. 
. stcox i.exposure##i.`intvar' i.agegroup2 i.male i.dmard_pc i.oral_prednisolon
> e i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.c
> hronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditi
> ons i.flu_vaccine, strata(stp population)
 27. estimates store B
 28. estimates save $Tempdir/multivar3_int_`intvar', replace 
 29. 
. lrtest A B
 30. global multivar3_p_`intvar' = round(r(p),0.001)
 31. 
. }

-------------------------------------------------------------------------------
-> agegroup2 = 18-<60

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    57,345        275 |    57,620 
           |     99.52       0.48 |    100.00 
-----------+----------------------+----------
       HCQ |    12,424         68 |    12,492 
           |     99.46       0.54 |    100.00 
-----------+----------------------+----------
     Total |    69,769        343 |    70,112 
           |     99.51       0.49 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 60-<70

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    37,461        191 |    37,652 
           |     99.49       0.51 |    100.00 
-----------+----------------------+----------
       HCQ |     7,920         41 |     7,961 
           |     99.48       0.52 |    100.00 
-----------+----------------------+----------
     Total |    45,381        232 |    45,613 
           |     99.49       0.51 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 70-<80

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    41,663        312 |    41,975 
           |     99.26       0.74 |    100.00 
-----------+----------------------+----------
       HCQ |     7,075         49 |     7,124 
           |     99.31       0.69 |    100.00 
-----------+----------------------+----------
     Total |    48,738        361 |    49,099 
           |     99.26       0.74 |    100.00 

-------------------------------------------------------------------------------
-> agegroup2 = 80+

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,111        369 |    26,480 
           |     98.61       1.39 |    100.00 
-----------+----------------------+----------
       HCQ |     2,895         27 |     2,922 
           |     99.08       0.92 |    100.00 
-----------+----------------------+----------
     Total |    29,006        396 |    29,402 
           |     98.65       1.35 |    100.00 


         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16192.088
Iteration 2:   log likelihood = -16192.082
Iteration 3:   log likelihood = -16192.082
Refining estimates:
Iteration 0:   log likelihood = -16192.082

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(1)       =        4.13
Log likelihood  =   -16192.082                  Prob > chi2      =      0.0420

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8537861   .0676447    -2.00   0.046     .7309861    .9972155
------------------------------------------------------------------------------

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16094.553
Iteration 2:   log likelihood = -16081.396
Iteration 3:   log likelihood =  -16081.36
Iteration 4:   log likelihood =  -16081.36
Refining estimates:
Iteration 0:   log likelihood =  -16081.36

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(7)       =      225.58
Log likelihood  =    -16081.36                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.118689   .1515081     0.83   0.408     .8578832    1.458783
             |
   agegroup2 |
     60-<70  |   1.055652    .099433     0.57   0.565     .8776979    1.269686
     70-<80  |   1.548903   .1281149     5.29   0.000     1.317099    1.821503
        80+  |   2.945322   .2346377    13.56   0.000     2.519546     3.44305
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .8972908   .1965212    -0.49   0.621     .5841257    1.378352
 HCQ#70-<80  |   .8210235   .1681707    -0.96   0.336     .5495453    1.226613
    HCQ#80+  |   .5882123   .1417693    -2.20   0.028     .3667582    .9433837
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_int_a
> gegroup2.ster saved

Likelihood-ratio test                                 LR chi2(6)  =    221.45
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16092.557
Iteration 2:   log likelihood = -16081.838
Iteration 3:   log likelihood = -16081.818
Iteration 4:   log likelihood = -16081.818
Refining estimates:
Iteration 0:   log likelihood = -16081.818

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(5)       =      224.66
Log likelihood  =   -16081.818                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9441386   .0751643    -0.72   0.470     .8077376    1.103573
             |
   agegroup2 |
     60-<70  |   1.028904   .0874947     0.34   0.738     .8709465    1.215509
     70-<80  |   1.484609   .1121195     5.23   0.000     1.280349    1.721456
        80+  |   2.761371   .2044077    13.72   0.000     2.388446    3.192523
             |
      1.male |   1.132448   .0666913     2.11   0.035     1.008997    1.271003
------------------------------------------------------------------------------

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16092.208
Iteration 2:   log likelihood = -16079.047
Iteration 3:   log likelihood = -16079.011
Iteration 4:   log likelihood = -16079.011
Refining estimates:
Iteration 0:   log likelihood = -16079.011

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(8)       =      230.28
Log likelihood  =   -16079.011                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.135801   .1540419     0.94   0.348     .8706805     1.48165
             |
   agegroup2 |
     60-<70  |   1.052183   .0991196     0.54   0.589     .8747924    1.265545
     70-<80  |   1.540777   .1274993     5.22   0.000     1.310095    1.812077
        80+  |   2.941348   .2343285    13.54   0.000     2.516133    3.438421
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .8886496   .1946716    -0.54   0.590     .5784456    1.365207
 HCQ#70-<80  |   .8110918   .1662024    -1.02   0.307      .542811    1.211969
    HCQ#80+  |   .5791117   .1396413    -2.27   0.023      .361004    .9289935
             |
      1.male |   1.137422   .0670483     2.18   0.029     1.013317    1.276727
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      5.61
(Assumption: A nested in B)                           Prob > chi2 =    0.1320

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11323.222
Iteration 2:   log likelihood = -11309.525
Iteration 3:   log likelihood = -11309.503
Iteration 4:   log likelihood = -11309.503
Refining estimates:
Iteration 0:   log likelihood = -11309.503

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(7)       =      316.47
Log likelihood  =   -11309.503                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9004949   .0730923    -1.29   0.197      .768051    1.055778
             |
   agegroup2 |
     60-<70  |   1.007047   .0861723     0.08   0.935     .8515555    1.190931
     70-<80  |   1.431541   .1098217     4.68   0.000     1.231695    1.663812
        80+  |    2.63086   .1986981    12.81   0.000     2.268872    3.050602
             |
      1.male |   1.141247   .0675184     2.23   0.026     1.016297    1.281558
  1.dmard_pc |   1.102219   .0640209     1.68   0.094     .9836195    1.235119
1.oral_pr~ne |   1.810176    .111061     9.67   0.000      1.60508    2.041481
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11322.696
Iteration 2:   log likelihood = -11306.947
Iteration 3:   log likelihood =  -11306.91
Iteration 4:   log likelihood =  -11306.91
Refining estimates:
Iteration 0:   log likelihood =  -11306.91

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(10)      =      321.65
Log likelihood  =    -11306.91                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.054513   .1453979     0.38   0.700     .8047978     1.38171
             |
   agegroup2 |
     60-<70  |    1.02093   .0966221     0.22   0.827     .8480803    1.229008
     70-<80  |   1.473701   .1234366     4.63   0.000     1.250585    1.736624
        80+  |   2.785863   .2252886    12.67   0.000     2.377521    3.264339
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .9327796   .2047396    -0.32   0.751       .60666     1.43421
 HCQ#70-<80  |   .8503588   .1747934    -0.79   0.430     .5683759    1.272239
    HCQ#80+  |   .5952513   .1439249    -2.15   0.032     .3705866    .9561169
             |
      1.male |   1.145283    .067809     2.29   0.022     1.019801    1.286204
  1.dmard_pc |   1.098102   .0638354     1.61   0.107     .9798516    1.230623
1.oral_pr~ne |   1.809045    .110972     9.66   0.000     1.604111    2.040162
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      5.18
(Assumption: A nested in B)                           Prob > chi2 =    0.1588

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11322.099
Iteration 2:   log likelihood = -11245.279
Iteration 3:   log likelihood =  -11238.31
Iteration 4:   log likelihood = -11238.051
Iteration 5:   log likelihood = -11238.051
Refining estimates:
Iteration 0:   log likelihood = -11238.051

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(20)      =      459.37
Log likelihood  =   -11238.051                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8872289   .0721513    -1.47   0.141     .7565092    1.040536
             |
   agegroup2 |
     60-<70  |   .8636813    .076833    -1.65   0.099     .7254888    1.028197
     70-<80  |   1.098979   .0960782     1.08   0.280     .9259191    1.304384
        80+  |   1.829361   .1727872     6.39   0.000     1.520202    2.201391
             |
      1.male |   1.084727     .06515     1.35   0.176     .9642647    1.220238
  1.dmard_pc |   1.142635   .0672548     2.27   0.023     1.018138    1.282357
1.oral_pr~ne |   1.617516   .1029917     7.55   0.000     1.427744    1.832513
    1.nsaids |   1.010012   .0817859     0.12   0.902     .8617875     1.18373
1.~c_disease |   1.356594   .0918374     4.51   0.000     1.188027     1.54908
1.resp_exc~a |   1.276198   .0903129     3.45   0.001     1.110915    1.466071
             |
egfr_cat_n~s |
      30-59  |   1.141789   .0877808     1.72   0.085     .9820766    1.327475
        <30  |   2.312937   .3675995     5.28   0.000     1.693873    3.158253
             |
1.~r_disease |   1.180223   .2491514     0.78   0.432     .7803164    1.785078
             |
   obese4cat |
Obese I ..)  |   1.172747   .0832671     2.24   0.025     1.020393    1.347849
Obese II..)  |   1.225976   .1249957     2.00   0.046     1.003914    1.497156
Obese II..)  |   1.566766   .2002956     3.51   0.000     1.219513    2.012899
             |
1.hyperten~n |   1.124126   .0698291     1.88   0.060     .9952669    1.269669
1.cancer_e~r |   1.274679   .0995198     3.11   0.002     1.093814    1.485449
1.neuro_co~s |   1.560772   .1320104     5.26   0.000     1.322344    1.842189
1.flu_vacc~e |   1.080531   .0722895     1.16   0.247     .9477423    1.231925
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11322.424
Iteration 2:   log likelihood =  -11243.21
Iteration 3:   log likelihood = -11236.142
Iteration 4:   log likelihood = -11235.878
Iteration 5:   log likelihood = -11235.877
Refining estimates:
Iteration 0:   log likelihood = -11235.877

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(23)      =      463.72
Log likelihood  =   -11235.877                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.016017   .1403321     0.12   0.908     .7750562    1.331891
             |
   agegroup2 |
     60-<70  |   .8734079   .0854791    -1.38   0.167     .7209603    1.058091
     70-<80  |   1.126998    .105895     1.27   0.203     .9374385     1.35489
        80+  |   1.927974   .1908942     6.63   0.000     1.587893     2.34089
             |
    exposure#|
   agegroup2 |
 HCQ#60-<70  |   .9515032   .2088923    -0.23   0.821     .6187826    1.463128
 HCQ#70-<80  |   .8775324   .1805081    -0.64   0.525     .5863695    1.313273
    HCQ#80+  |   .6232567   .1508029    -1.95   0.051     .3878919    1.001436
             |
      1.male |    1.08799    .065388     1.40   0.161     .9670924    1.224002
  1.dmard_pc |   1.139588   .0671152     2.22   0.027     1.015353    1.279025
1.oral_pr~ne |   1.617411   .1029689     7.55   0.000     1.427679    1.832358
    1.nsaids |    1.00718   .0815964     0.09   0.930      .859305    1.180503
1.~c_disease |   1.355885   .0917773     4.50   0.000     1.187426    1.548243
1.resp_exc~a |   1.278469   .0904693     3.47   0.001       1.1129    1.468671
             |
egfr_cat_n~s |
      30-59  |   1.143109   .0878654     1.74   0.082     .9832406    1.328971
        <30  |   2.309758   .3671296     5.27   0.000     1.691494    3.154007
             |
1.~r_disease |   1.178716   .2488342     0.78   0.436     .7793189    1.782802
             |
   obese4cat |
Obese I ..)  |   1.171933   .0832067     2.23   0.025     1.019689    1.346908
Obese II..)  |   1.225213   .1249285     1.99   0.046     1.003272    1.496249
Obese II..)  |   1.564026   .1999664     3.50   0.000     1.217348    2.009431
             |
1.hyperten~n |    1.12336   .0697824     1.87   0.061     .9945872    1.268806
1.cancer_e~r |   1.274098   .0994757     3.10   0.002     1.093314    1.484776
1.neuro_co~s |   1.556203   .1316459     5.23   0.000     1.318438    1.836848
1.flu_vacc~e |    1.07624   .0719786     1.10   0.272     .9440193    1.226979
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_in
> t_agegroup2.ster saved

Likelihood-ratio test                                 LR chi2(3)  =      4.35
(Assumption: A nested in B)                           Prob > chi2 =    0.2264

-------------------------------------------------------------------------------
-> dmard_pc = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   107,387        706 |   108,093 
           |     99.35       0.65 |    100.00 
-----------+----------------------+----------
       HCQ |    14,700         96 |    14,796 
           |     99.35       0.65 |    100.00 
-----------+----------------------+----------
     Total |   122,087        802 |   122,889 
           |     99.35       0.65 |    100.00 

-------------------------------------------------------------------------------
-> dmard_pc = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    55,193        441 |    55,634 
           |     99.21       0.79 |    100.00 
-----------+----------------------+----------
       HCQ |    15,614         89 |    15,703 
           |     99.43       0.57 |    100.00 
-----------+----------------------+----------
     Total |    70,807        530 |    71,337 
           |     99.26       0.74 |    100.00 


         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16192.088
Iteration 2:   log likelihood = -16192.082
Iteration 3:   log likelihood = -16192.082
Refining estimates:
Iteration 0:   log likelihood = -16192.082

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(1)       =        4.13
Log likelihood  =   -16192.082                  Prob > chi2      =      0.0420

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8537861   .0676447    -2.00   0.046     .7309861    .9972155
------------------------------------------------------------------------------

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16186.915
Iteration 2:   log likelihood = -16186.892
Iteration 3:   log likelihood = -16186.892
Refining estimates:
Iteration 0:   log likelihood = -16186.892

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(3)       =       14.51
Log likelihood  =   -16186.892                  Prob > chi2      =      0.0023

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .979086   .1065051    -0.19   0.846     .7910921    1.211754
  1.dmard_pc |   1.207573   .0732949     3.11   0.002     1.072134    1.360122
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .7216494   .1148684    -2.05   0.040     .5282462     .985862
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_int_d
> mard_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     10.38
(Assumption: A nested in B)                           Prob > chi2 =    0.0056

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16092.557
Iteration 2:   log likelihood = -16081.838
Iteration 3:   log likelihood = -16081.818
Iteration 4:   log likelihood = -16081.818
Refining estimates:
Iteration 0:   log likelihood = -16081.818

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(5)       =      224.66
Log likelihood  =   -16081.818                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9441386   .0751643    -0.72   0.470     .8077376    1.103573
             |
   agegroup2 |
     60-<70  |   1.028904   .0874947     0.34   0.738     .8709465    1.215509
     70-<80  |   1.484609   .1121195     5.23   0.000     1.280349    1.721456
        80+  |   2.761371   .2044077    13.72   0.000     2.388446    3.192523
             |
      1.male |   1.132448   .0666913     2.11   0.035     1.008997    1.271003
------------------------------------------------------------------------------

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood =  -16088.43
Iteration 2:   log likelihood = -16077.679
Iteration 3:   log likelihood = -16077.659
Iteration 4:   log likelihood = -16077.659
Refining estimates:
Iteration 0:   log likelihood = -16077.659

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(7)       =      232.98
Log likelihood  =   -16077.659                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.074177    .117171     0.66   0.512     .8674149    1.330224
  1.dmard_pc |    1.18225    .072098     2.75   0.006     1.049059    1.332352
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .7372652    .117406    -1.91   0.056     .5396025    1.007334
             |
   agegroup2 |
     60-<70  |   1.015362   .0865317     0.18   0.858     .8591707    1.199948
     70-<80  |    1.45973   .1106889     4.99   0.000     1.258136    1.693627
        80+  |   2.738307   .2029216    13.59   0.000     2.368121    3.166359
             |
      1.male |   1.129589   .0665952     2.07   0.039     1.006323    1.267953
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      8.32
(Assumption: A nested in B)                           Prob > chi2 =    0.0156

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11323.222
Iteration 2:   log likelihood = -11309.525
Iteration 3:   log likelihood = -11309.503
Iteration 4:   log likelihood = -11309.503
Refining estimates:
Iteration 0:   log likelihood = -11309.503

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(7)       =      316.47
Log likelihood  =   -11309.503                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9004949   .0730923    -1.29   0.197      .768051    1.055778
             |
   agegroup2 |
     60-<70  |   1.007047   .0861723     0.08   0.935     .8515555    1.190931
     70-<80  |   1.431541   .1098217     4.68   0.000     1.231695    1.663812
        80+  |    2.63086   .1986981    12.81   0.000     2.268872    3.050602
             |
      1.male |   1.141247   .0675184     2.23   0.026     1.016297    1.281558
  1.dmard_pc |   1.102219   .0640209     1.68   0.094     .9836195    1.235119
1.oral_pr~ne |   1.810176    .111061     9.67   0.000      1.60508    2.041481
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11321.625
Iteration 2:   log likelihood = -11307.936
Iteration 3:   log likelihood = -11307.913
Iteration 4:   log likelihood = -11307.913
Refining estimates:
Iteration 0:   log likelihood = -11307.913

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(8)       =      319.64
Log likelihood  =   -11307.913                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.036864   .1144344     0.33   0.743     .8351768    1.287258
  1.dmard_pc |   1.148277   .0713997     2.22   0.026     1.016528    1.297103
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .7522951   .1200997    -1.78   0.075     .5501723    1.028674
             |
   agegroup2 |
     60-<70  |   1.005153   .0860191     0.06   0.952     .8499391    1.188711
     70-<80  |   1.426777   .1094967     4.63   0.000     1.227528    1.658368
        80+  |   2.624077   .1982276    12.77   0.000     2.262952    3.042832
             |
      1.male |   1.142631   .0676157     2.25   0.024     1.017503    1.283146
1.oral_pr~ne |   1.804256   .1107591     9.61   0.000     1.599723    2.034939
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      3.18
(Assumption: A nested in B)                           Prob > chi2 =    0.0746

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11322.099
Iteration 2:   log likelihood = -11245.279
Iteration 3:   log likelihood =  -11238.31
Iteration 4:   log likelihood = -11238.051
Iteration 5:   log likelihood = -11238.051
Refining estimates:
Iteration 0:   log likelihood = -11238.051

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(20)      =      459.37
Log likelihood  =   -11238.051                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8872289   .0721513    -1.47   0.141     .7565092    1.040536
             |
   agegroup2 |
     60-<70  |   .8636813    .076833    -1.65   0.099     .7254888    1.028197
     70-<80  |   1.098979   .0960782     1.08   0.280     .9259191    1.304384
        80+  |   1.829361   .1727872     6.39   0.000     1.520202    2.201391
             |
      1.male |   1.084727     .06515     1.35   0.176     .9642647    1.220238
  1.dmard_pc |   1.142635   .0672548     2.27   0.023     1.018138    1.282357
1.oral_pr~ne |   1.617516   .1029917     7.55   0.000     1.427744    1.832513
    1.nsaids |   1.010012   .0817859     0.12   0.902     .8617875     1.18373
1.~c_disease |   1.356594   .0918374     4.51   0.000     1.188027     1.54908
1.resp_exc~a |   1.276198   .0903129     3.45   0.001     1.110915    1.466071
             |
egfr_cat_n~s |
      30-59  |   1.141789   .0877808     1.72   0.085     .9820766    1.327475
        <30  |   2.312937   .3675995     5.28   0.000     1.693873    3.158253
             |
1.~r_disease |   1.180223   .2491514     0.78   0.432     .7803164    1.785078
             |
   obese4cat |
Obese I ..)  |   1.172747   .0832671     2.24   0.025     1.020393    1.347849
Obese II..)  |   1.225976   .1249957     2.00   0.046     1.003914    1.497156
Obese II..)  |   1.566766   .2002956     3.51   0.000     1.219513    2.012899
             |
1.hyperten~n |   1.124126   .0698291     1.88   0.060     .9952669    1.269669
1.cancer_e~r |   1.274679   .0995198     3.11   0.002     1.093814    1.485449
1.neuro_co~s |   1.560772   .1320104     5.26   0.000     1.322344    1.842189
1.flu_vacc~e |   1.080531   .0722895     1.16   0.247     .9477423    1.231925
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11320.481
Iteration 2:   log likelihood = -11243.711
Iteration 3:   log likelihood = -11236.743
Iteration 4:   log likelihood = -11236.484
Iteration 5:   log likelihood = -11236.483
Refining estimates:
Iteration 0:   log likelihood = -11236.483

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(21)      =      462.50
Log likelihood  =   -11236.483                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.020794   .1128902     0.19   0.852     .8218702    1.267865
  1.dmard_pc |   1.190588   .0750133     2.77   0.006      1.05228    1.347075
             |
    exposure#|
    dmard_pc |
      HCQ#1  |   .7537046   .1203771    -1.77   0.077     .5511279    1.030742
             |
   agegroup2 |
     60-<70  |   .8627339   .0767517    -1.66   0.097     .7246881    1.027076
     70-<80  |   1.096596   .0958772     1.05   0.292     .9238992    1.301573
        80+  |   1.826868   .1725553     6.38   0.000     1.518125      2.1984
             |
      1.male |   1.085764   .0652289     1.37   0.171     .9651573    1.221441
1.oral_pr~ne |   1.612674   .1027115     7.50   0.000     1.423421    1.827089
    1.nsaids |   1.007968   .0816268     0.10   0.922     .8600331    1.181349
1.~c_disease |   1.357352   .0918876     4.51   0.000     1.188692    1.549943
1.resp_exc~a |   1.276263   .0903011     3.45   0.001        1.111     1.46611
             |
egfr_cat_n~s |
      30-59  |   1.141211    .087743     1.72   0.086     .9815686    1.326818
        <30  |   2.316253   .3681344     5.28   0.000     1.696289    3.162802
             |
1.~r_disease |   1.179099   .2489188     0.78   0.435      .779567    1.783392
             |
   obese4cat |
Obese I ..)  |   1.172738   .0832671     2.24   0.025     1.020384     1.34784
Obese II..)  |   1.226548   .1250585     2.00   0.045     1.004376    1.497866
Obese II..)  |   1.567659   .2004123     3.52   0.000     1.220204    2.014052
             |
1.hyperten~n |   1.123271   .0697642     1.87   0.061       .99453    1.268676
1.cancer_e~r |   1.275128   .0995547     3.11   0.002       1.0942    1.485972
1.neuro_co~s |   1.561344   .1320495     5.27   0.000     1.322845    1.842843
1.flu_vacc~e |   1.077288   .0720886     1.11   0.266     .9448703    1.228263
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_in
> t_dmard_pc.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      3.13
(Assumption: A nested in B)                           Prob > chi2 =    0.0767

-------------------------------------------------------------------------------
-> oral_prednisolone = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,171        830 |   137,001 
           |     99.39       0.61 |    100.00 
-----------+----------------------+----------
       HCQ |    23,514        120 |    23,634 
           |     99.49       0.51 |    100.00 
-----------+----------------------+----------
     Total |   159,685        950 |   160,635 
           |     99.41       0.59 |    100.00 

-------------------------------------------------------------------------------
-> oral_prednisolone = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,409        317 |    26,726 
           |     98.81       1.19 |    100.00 
-----------+----------------------+----------
       HCQ |     6,800         65 |     6,865 
           |     99.05       0.95 |    100.00 
-----------+----------------------+----------
     Total |    33,209        382 |    33,591 
           |     98.86       1.14 |    100.00 


         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16192.088
Iteration 2:   log likelihood = -16192.082
Iteration 3:   log likelihood = -16192.082
Refining estimates:
Iteration 0:   log likelihood = -16192.082

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(1)       =        4.13
Log likelihood  =   -16192.082                  Prob > chi2      =      0.0420

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8537861   .0676447    -2.00   0.046     .7309861    .9972155
------------------------------------------------------------------------------

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16140.188
Iteration 2:   log likelihood = -16136.175
Iteration 3:   log likelihood = -16136.169
Iteration 4:   log likelihood = -16136.169
Refining estimates:
Iteration 0:   log likelihood = -16136.169

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(3)       =      115.96
Log likelihood  =   -16136.169                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .826675    .080736    -1.95   0.051     .6826584    1.001074
1.oral_pr~ne |    1.98446   .1310257    10.38   0.000     1.743576    2.258622
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9475667   .1587771    -0.32   0.748     .6823072    1.315951
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_int_o
> ral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =    111.83
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16092.557
Iteration 2:   log likelihood = -16081.838
Iteration 3:   log likelihood = -16081.818
Iteration 4:   log likelihood = -16081.818
Refining estimates:
Iteration 0:   log likelihood = -16081.818

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(5)       =      224.66
Log likelihood  =   -16081.818                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9441386   .0751643    -0.72   0.470     .8077376    1.103573
             |
   agegroup2 |
     60-<70  |   1.028904   .0874947     0.34   0.738     .8709465    1.215509
     70-<80  |   1.484609   .1121195     5.23   0.000     1.280349    1.721456
        80+  |   2.761371   .2044077    13.72   0.000     2.388446    3.192523
             |
      1.male |   1.132448   .0666913     2.11   0.035     1.008997    1.271003
------------------------------------------------------------------------------

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16054.172
Iteration 2:   log likelihood = -16038.748
Iteration 3:   log likelihood = -16038.713
Iteration 4:   log likelihood = -16038.713
Refining estimates:
Iteration 0:   log likelihood = -16038.713

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(7)       =      310.87
Log likelihood  =   -16038.713                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9058052   .0887407    -1.01   0.313     .7475557    1.097554
1.oral_pr~ne |   1.815862   .1207845     8.97   0.000      1.59391    2.068719
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9825984   .1647021    -0.10   0.917     .7074546    1.364751
             |
   agegroup2 |
     60-<70  |   .9974503   .0849257    -0.03   0.976     .8441461    1.178596
     70-<80  |     1.4012   .1063314     4.45   0.000     1.207552    1.625902
        80+  |   2.571824   .1917638    12.67   0.000     2.222147    2.976526
             |
      1.male |     1.1369    .066969     2.18   0.029     1.012937    1.276034
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(2)  =     86.21
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11323.222
Iteration 2:   log likelihood = -11309.525
Iteration 3:   log likelihood = -11309.503
Iteration 4:   log likelihood = -11309.503
Refining estimates:
Iteration 0:   log likelihood = -11309.503

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(7)       =      316.47
Log likelihood  =   -11309.503                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9004949   .0730923    -1.29   0.197      .768051    1.055778
             |
   agegroup2 |
     60-<70  |   1.007047   .0861723     0.08   0.935     .8515555    1.190931
     70-<80  |   1.431541   .1098217     4.68   0.000     1.231695    1.663812
        80+  |    2.63086   .1986981    12.81   0.000     2.268872    3.050602
             |
      1.male |   1.141247   .0675184     2.23   0.026     1.016297    1.281558
  1.dmard_pc |   1.102219   .0640209     1.68   0.094     .9836195    1.235119
1.oral_pr~ne |   1.810176    .111061     9.67   0.000      1.60508    2.041481
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11323.963
Iteration 2:   log likelihood = -11309.516
Iteration 3:   log likelihood = -11309.487
Iteration 4:   log likelihood = -11309.487
Refining estimates:
Iteration 0:   log likelihood = -11309.487

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(8)       =      316.50
Log likelihood  =   -11309.487                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9096344   .0901627    -0.96   0.339     .7490246    1.104683
1.oral_pr~ne |   1.818601   .1213285     8.96   0.000     1.595693    2.072648
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9708412   .1630284    -0.18   0.860     .6985706     1.34923
             |
   agegroup2 |
     60-<70  |   1.006849   .0861624     0.08   0.936     .8513766    1.190713
     70-<80  |   1.431313   .1098126     4.67   0.000     1.231485    1.663566
        80+  |   2.630423   .1986862    12.80   0.000      2.26846    3.050143
             |
      1.male |   1.141387   .0675315     2.24   0.025     1.016414    1.281726
  1.dmard_pc |   1.101954   .0640267     1.67   0.095     .9833458    1.234869
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.03
(Assumption: A nested in B)                           Prob > chi2 =    0.8600

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11322.099
Iteration 2:   log likelihood = -11245.279
Iteration 3:   log likelihood =  -11238.31
Iteration 4:   log likelihood = -11238.051
Iteration 5:   log likelihood = -11238.051
Refining estimates:
Iteration 0:   log likelihood = -11238.051

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(20)      =      459.37
Log likelihood  =   -11238.051                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8872289   .0721513    -1.47   0.141     .7565092    1.040536
             |
   agegroup2 |
     60-<70  |   .8636813    .076833    -1.65   0.099     .7254888    1.028197
     70-<80  |   1.098979   .0960782     1.08   0.280     .9259191    1.304384
        80+  |   1.829361   .1727872     6.39   0.000     1.520202    2.201391
             |
      1.male |   1.084727     .06515     1.35   0.176     .9642647    1.220238
  1.dmard_pc |   1.142635   .0672548     2.27   0.023     1.018138    1.282357
1.oral_pr~ne |   1.617516   .1029917     7.55   0.000     1.427744    1.832513
    1.nsaids |   1.010012   .0817859     0.12   0.902     .8617875     1.18373
1.~c_disease |   1.356594   .0918374     4.51   0.000     1.188027     1.54908
1.resp_exc~a |   1.276198   .0903129     3.45   0.001     1.110915    1.466071
             |
egfr_cat_n~s |
      30-59  |   1.141789   .0877808     1.72   0.085     .9820766    1.327475
        <30  |   2.312937   .3675995     5.28   0.000     1.693873    3.158253
             |
1.~r_disease |   1.180223   .2491514     0.78   0.432     .7803164    1.785078
             |
   obese4cat |
Obese I ..)  |   1.172747   .0832671     2.24   0.025     1.020393    1.347849
Obese II..)  |   1.225976   .1249957     2.00   0.046     1.003914    1.497156
Obese II..)  |   1.566766   .2002956     3.51   0.000     1.219513    2.012899
             |
1.hyperten~n |   1.124126   .0698291     1.88   0.060     .9952669    1.269669
1.cancer_e~r |   1.274679   .0995198     3.11   0.002     1.093814    1.485449
1.neuro_co~s |   1.560772   .1320104     5.26   0.000     1.322344    1.842189
1.flu_vacc~e |   1.080531   .0722895     1.16   0.247     .9477423    1.231925
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11322.813
Iteration 2:   log likelihood = -11245.294
Iteration 3:   log likelihood = -11238.311
Iteration 4:   log likelihood = -11238.051
Iteration 5:   log likelihood =  -11238.05
Refining estimates:
Iteration 0:   log likelihood =  -11238.05

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(21)      =      459.37
Log likelihood  =    -11238.05                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8890864   .0883172    -1.18   0.237     .7317961    1.080184
1.oral_pr~ne |   1.619088   .1116666     6.99   0.000     1.414374    1.853433
             |
    exposure#|
oral_pred~ne |
      HCQ#1  |   .9938712   .1669004    -0.04   0.971     .7151353    1.381249
             |
   agegroup2 |
     60-<70  |    .863659   .0768333    -1.65   0.099     .7254662    1.028176
     70-<80  |   1.098964   .0960777     1.08   0.280      .925905    1.304368
        80+  |   1.829339    .172786     6.39   0.000     1.520183    2.201367
             |
      1.male |   1.084757   .0651568     1.35   0.176     .9642822    1.220283
  1.dmard_pc |   1.142582   .0672681     2.26   0.024     1.018061    1.282333
    1.nsaids |   1.009991   .0817864     0.12   0.902     .8617661     1.18371
1.~c_disease |    1.35659   .0918372     4.50   0.000     1.188022    1.549075
1.resp_exc~a |   1.276149   .0903195     3.45   0.001     1.110855    1.466038
             |
egfr_cat_n~s |
      30-59  |   1.141801   .0877822     1.72   0.085     .9820866     1.32749
        <30  |   2.312922   .3675973     5.28   0.000     1.693862    3.158233
             |
1.~r_disease |   1.180198   .2491472     0.78   0.433     .7802989    1.785044
             |
   obese4cat |
Obese I ..)  |   1.172737   .0832668     2.24   0.025     1.020384    1.347838
Obese II..)  |   1.225952   .1249949     2.00   0.046     1.003892    1.497131
Obese II..)  |   1.566753   .2002941     3.51   0.000     1.219502    2.012882
             |
1.hyperten~n |    1.12412   .0698289     1.88   0.060     .9952614    1.269662
1.cancer_e~r |   1.274679     .09952     3.11   0.002     1.093815     1.48545
1.neuro_co~s |   1.560761   .1320096     5.26   0.000     1.322335    1.842177
1.flu_vacc~e |     1.0805   .0722923     1.16   0.247     .9477062      1.2319
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_in
> t_oral_prednisolone.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.00
(Assumption: A nested in B)                           Prob > chi2 =    0.9708

-------------------------------------------------------------------------------
-> nsaids = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   136,124        990 |   137,114 
           |     99.28       0.72 |    100.00 
-----------+----------------------+----------
       HCQ |    23,705        152 |    23,857 
           |     99.36       0.64 |    100.00 
-----------+----------------------+----------
     Total |   159,829      1,142 |   160,971 
           |     99.29       0.71 |    100.00 

-------------------------------------------------------------------------------
-> nsaids = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    26,456        157 |    26,613 
           |     99.41       0.59 |    100.00 
-----------+----------------------+----------
       HCQ |     6,609         33 |     6,642 
           |     99.50       0.50 |    100.00 
-----------+----------------------+----------
     Total |    33,065        190 |    33,255 
           |     99.43       0.57 |    100.00 


         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16192.088
Iteration 2:   log likelihood = -16192.082
Iteration 3:   log likelihood = -16192.082
Refining estimates:
Iteration 0:   log likelihood = -16192.082

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(1)       =        4.13
Log likelihood  =   -16192.082                  Prob > chi2      =      0.0420

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8537861   .0676447    -2.00   0.046     .7309861    .9972155
------------------------------------------------------------------------------

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16188.271
Iteration 2:   log likelihood = -16188.228
Iteration 3:   log likelihood = -16188.228
Refining estimates:
Iteration 0:   log likelihood = -16188.228

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(3)       =       11.84
Log likelihood  =   -16188.228                  Prob > chi2      =      0.0079

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8706485   .0758467    -1.59   0.112     .7339902    1.032751
    1.nsaids |   .8159698   .0700952    -2.37   0.018     .6895286    .9655968
             |
    exposure#|
      nsaids |
      HCQ#1  |   .9520911   .2003049    -0.23   0.815     .6303753    1.437997
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_int_n
> saids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      7.71
(Assumption: A nested in B)                           Prob > chi2 =    0.0212

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16092.557
Iteration 2:   log likelihood = -16081.838
Iteration 3:   log likelihood = -16081.818
Iteration 4:   log likelihood = -16081.818
Refining estimates:
Iteration 0:   log likelihood = -16081.818

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(5)       =      224.66
Log likelihood  =   -16081.818                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9441386   .0751643    -0.72   0.470     .8077376    1.103573
             |
   agegroup2 |
     60-<70  |   1.028904   .0874947     0.34   0.738     .8709465    1.215509
     70-<80  |   1.484609   .1121195     5.23   0.000     1.280349    1.721456
        80+  |   2.761371   .2044077    13.72   0.000     2.388446    3.192523
             |
      1.male |   1.132448   .0666913     2.11   0.035     1.008997    1.271003
------------------------------------------------------------------------------

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16092.382
Iteration 2:   log likelihood = -16081.656
Iteration 3:   log likelihood = -16081.636
Iteration 4:   log likelihood = -16081.636
Refining estimates:
Iteration 0:   log likelihood = -16081.636

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(7)       =      225.03
Log likelihood  =   -16081.636                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9589423   .0838481    -0.48   0.632     .8079137    1.138204
    1.nsaids |   .9773675   .0851202    -0.26   0.793     .8239971    1.159285
             |
    exposure#|
      nsaids |
      HCQ#1  |   .9223626   .1940977    -0.38   0.701     .6106309    1.393236
             |
   agegroup2 |
     60-<70  |   1.027801   .0874196     0.32   0.747     .8699821     1.21425
     70-<80  |   1.479601   .1121473     5.17   0.000     1.275344    1.716572
        80+  |   2.745932   .2059288    13.47   0.000      2.37058    3.180716
             |
      1.male |   1.132144   .0666747     2.11   0.035     1.008723    1.270664
------------------------------------------------------------------------------
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      0.36
(Assumption: A nested in B)                           Prob > chi2 =    0.8340

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11323.222
Iteration 2:   log likelihood = -11309.525
Iteration 3:   log likelihood = -11309.503
Iteration 4:   log likelihood = -11309.503
Refining estimates:
Iteration 0:   log likelihood = -11309.503

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(7)       =      316.47
Log likelihood  =   -11309.503                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9004949   .0730923    -1.29   0.197      .768051    1.055778
             |
   agegroup2 |
     60-<70  |   1.007047   .0861723     0.08   0.935     .8515555    1.190931
     70-<80  |   1.431541   .1098217     4.68   0.000     1.231695    1.663812
        80+  |    2.63086   .1986981    12.81   0.000     2.268872    3.050602
             |
      1.male |   1.141247   .0675184     2.23   0.026     1.016297    1.281558
  1.dmard_pc |   1.102219   .0640209     1.68   0.094     .9836195    1.235119
1.oral_pr~ne |   1.810176    .111061     9.67   0.000      1.60508    2.041481
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11323.083
Iteration 2:   log likelihood = -11309.369
Iteration 3:   log likelihood = -11309.347
Iteration 4:   log likelihood = -11309.347
Refining estimates:
Iteration 0:   log likelihood = -11309.347

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(9)       =      316.78
Log likelihood  =   -11309.347                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9123536   .0811583    -1.03   0.302     .7663808     1.08613
    1.nsaids |   .9752579   .0855514    -0.29   0.775     .8212031    1.158213
             |
    exposure#|
      nsaids |
      HCQ#1  |   .9348103    .196775    -0.32   0.749     .6187966    1.412209
             |
   agegroup2 |
     60-<70  |   1.005625   .0860917     0.07   0.948      .850285    1.189344
     70-<80  |   1.425963   .1099963     4.60   0.000      1.22588    1.658702
        80+  |   2.614726   .2006981    12.52   0.000     2.249524    3.039217
             |
      1.male |   1.140724   .0674939     2.23   0.026     1.015821    1.280985
  1.dmard_pc |   1.103408   .0641708     1.69   0.091     .9845384    1.236629
1.oral_pr~ne |    1.81033   .1110906     9.67   0.000     1.605181    2.041699
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(2)  =      0.31
(Assumption: A nested in B)                           Prob > chi2 =    0.8555

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11322.099
Iteration 2:   log likelihood = -11245.279
Iteration 3:   log likelihood =  -11238.31
Iteration 4:   log likelihood = -11238.051
Iteration 5:   log likelihood = -11238.051
Refining estimates:
Iteration 0:   log likelihood = -11238.051

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(20)      =      459.37
Log likelihood  =   -11238.051                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8872289   .0721513    -1.47   0.141     .7565092    1.040536
             |
   agegroup2 |
     60-<70  |   .8636813    .076833    -1.65   0.099     .7254888    1.028197
     70-<80  |   1.098979   .0960782     1.08   0.280     .9259191    1.304384
        80+  |   1.829361   .1727872     6.39   0.000     1.520202    2.201391
             |
      1.male |   1.084727     .06515     1.35   0.176     .9642647    1.220238
  1.dmard_pc |   1.142635   .0672548     2.27   0.023     1.018138    1.282357
1.oral_pr~ne |   1.617516   .1029917     7.55   0.000     1.427744    1.832513
    1.nsaids |   1.010012   .0817859     0.12   0.902     .8617875     1.18373
1.~c_disease |   1.356594   .0918374     4.51   0.000     1.188027     1.54908
1.resp_exc~a |   1.276198   .0903129     3.45   0.001     1.110915    1.466071
             |
egfr_cat_n~s |
      30-59  |   1.141789   .0877808     1.72   0.085     .9820766    1.327475
        <30  |   2.312937   .3675995     5.28   0.000     1.693873    3.158253
             |
1.~r_disease |   1.180223   .2491514     0.78   0.432     .7803164    1.785078
             |
   obese4cat |
Obese I ..)  |   1.172747   .0832671     2.24   0.025     1.020393    1.347849
Obese II..)  |   1.225976   .1249957     2.00   0.046     1.003914    1.497156
Obese II..)  |   1.566766   .2002956     3.51   0.000     1.219513    2.012899
             |
1.hyperten~n |   1.124126   .0698291     1.88   0.060     .9952669    1.269669
1.cancer_e~r |   1.274679   .0995198     3.11   0.002     1.093814    1.485449
1.neuro_co~s |   1.560772   .1320104     5.26   0.000     1.322344    1.842189
1.flu_vacc~e |   1.080531   .0722895     1.16   0.247     .9477423    1.231925
------------------------------------------------------------------------------
                                                  Stratified by stp population

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11467.735
Iteration 1:   log likelihood = -11322.018
Iteration 2:   log likelihood = -11245.203
Iteration 3:   log likelihood = -11238.236
Iteration 4:   log likelihood = -11237.977
Iteration 5:   log likelihood = -11237.976
Refining estimates:
Iteration 0:   log likelihood = -11237.976

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(21)      =      459.52
Log likelihood  =   -11237.976                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8999552   .0801413    -1.18   0.237     .7558248     1.07157
    1.nsaids |   1.024083   .0904439     0.27   0.788     .8613105    1.217617
             |
    exposure#|
      nsaids |
      HCQ#1  |   .9225203   .1942076    -0.38   0.702     .6106357    1.393701
             |
   agegroup2 |
     60-<70  |   .8633698   .0768087    -1.65   0.099     .7252216    1.027834
     70-<80  |   1.098761    .096055     1.08   0.281     .9257424    1.304116
        80+  |   1.829871   .1728258     6.40   0.000     1.520642    2.201982
             |
      1.male |   1.084641   .0651447     1.35   0.176     .9641882    1.220141
  1.dmard_pc |   1.142384   .0672399     2.26   0.024     1.017913    1.282074
1.oral_pr~ne |   1.617157   .1029723     7.55   0.000     1.427421    1.832114
1.~c_disease |   1.356686   .0918448     4.51   0.000     1.188105    1.549188
1.resp_exc~a |   1.276278   .0903198     3.45   0.001     1.110983    1.466166
             |
egfr_cat_n~s |
      30-59  |   1.141771   .0877796     1.72   0.085      .982061    1.327454
        <30  |   2.313682   .3677224     5.28   0.000     1.694412    3.159282
             |
1.~r_disease |   1.180254   .2491569     0.79   0.432     .7803389    1.785123
             |
   obese4cat |
Obese I ..)  |   1.172785   .0832707     2.24   0.025     1.020424    1.347894
Obese II..)  |   1.225903   .1249877     2.00   0.046     1.003856    1.497065
Obese II..)  |   1.567251   .2003582     3.51   0.000     1.219889    2.013523
             |
1.hyperten~n |   1.124063   .0698226     1.88   0.060     .9952157    1.269592
1.cancer_e~r |   1.274856   .0995358     3.11   0.002     1.093963     1.48566
1.neuro_co~s |   1.560912   .1320208     5.26   0.000     1.322466    1.842351
1.flu_vacc~e |   1.080321   .0722798     1.15   0.248     .9475511    1.231695
------------------------------------------------------------------------------
                                                  Stratified by stp population
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_in
> t_nsaids.ster saved

Likelihood-ratio test                                 LR chi2(1)  =      0.15
(Assumption: A nested in B)                           Prob > chi2 =    0.7000

. 
. 
. 
. 
. 
. 
. /* Print interaction table===================================================
> =*/ 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table3.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 3: Interactions with HCQ use on risk of $tabl
> eoutcome") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab _tab ("Age/
> Sex Adjusted") _tab _tab _tab  ///
>                                                 ("DAG Adjusted") _tab _tab _t
> ab ("Fully Adjusted") _tab _tab _tab _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("p (interactio
> n)") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("p (interact
> ion)") _tab ("HR") _tab ("95% CI") _tab ("p (interaction)") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab (
> "p (interaction)") _tab _n

. 
.                                                 
. * Generic program to print model for a level of another variable 
. cap prog drop printinteraction

. prog define printinteraction 
  1. syntax, variable(varname) min(real) max(real) 
  2. 
. * Overall p-values 
. 
. file write tablecontent ("`variable'") _tab _tab _tab _tab ("${univar_p_`vari
> able'}") ///
>                                                 _tab _tab _tab ("${multivar1_
> p_`variable'}") /// 
>                                                 _tab _tab _tab ("${multivar2_
> p_`variable'}") ///
>                                                 _tab _tab _tab ("${multivar3_
> p_`variable'}") _n
  3.         forvalues varlevel = `min'/`max'{ 
  4. 
.                 * Row headings 
.                                                         
.                 file write tablecontent ("`varlevel'") _n       
  5. 
.                 local lab0: label exposure 0
  6.                 local lab1: label exposure 1
  7.                  
.                 /* Counts */
.                         
.                 * First row, exposure = 0 (reference)
.                 
.         file write tablecontent ("`lab0'") _tab
  8. 
.                         cou if exposure == 0 & `variable' == `varlevel'
  9.                         local rowdenom = r(N)
 10.                         cou if exposure == 0  & `variable' == `varlevel' &
>  $outcome == 1
 11.                         local pct = 100*(r(N)/`rowdenom')
 12.                         
.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 13.                 file write tablecontent ("1.00 (ref)") _tab _tab _tab ("1.
> 00 (ref)") _tab _tab _tab ("1.00 (ref)") _tab _tab _tab ("1.00 (ref)") _n
 14.                         
.                 * Second row, exposure = 1 (comparator)
. 
.                 file write tablecontent ("`lab1'") _tab  
 15. 
.                         cou if exposure == 1 & `variable' == `varlevel'
 16.                         local rowdenom = r(N)
 17.                         cou if exposure == 1 & `variable' == `varlevel' & 
> $outcome == 1
 18.                         local pct = 100*(r(N)/`rowdenom')
 19.                         
.                 file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _ta
> b
 20. 
.                 * Print models 
.                 estimates use $Tempdir/univar_int_`variable' 
 21.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 22.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 23. 
.                 estimates use $Tempdir/multivar1_int_`variable'
 24.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 25.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab
 26. 
.                 estimates use $Tempdir/multivar2_int_`variable'
 27.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 28.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _tab 
 29.         
.                 estimates use $Tempdir/multivar3_int_`variable'
 30.                 qui lincom 1.exposure + 1.exposure#`varlevel'.`variable', 
> eform
 31.                 file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.
> 2f (r(lb)) ("-") %4.2f (r(ub)) (")") _tab _n
 32.         } 
 33.                 
. end

. 
. printinteraction, variable(agegroup2) min(3) max(6) 
  57,620
  275
  12,492
  68
  37,652
  191
  7,961
  41
  41,975
  312
  7,124
  49
  26,480
  369
  2,922
  27

. file write tablecontent _n _n

. 
. printinteraction, variable(dmard_pc) min(0) max(1) 
  108,093
  706
  14,796
  96
  55,634
  441
  15,703
  89

. file write tablecontent _n _n

.   
. printinteraction, variable(oral_prednisolone) min(0) max(1) 
  137,001
  830
  23,634
  120
  26,726
  317
  6,865
  65

. file write tablecontent _n _n

. 
. printinteraction, variable(nsaids) min(0) max(1) 
  137,114
  990
  23,857
  152
  26,613
  157
  6,642
  33

. 
. 
. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\07_an_mod
> els_interact.log
  log type:  text
 closed on:  19 Jul 2020, 18:46:01
-------------------------------------------------------------------------------
