-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\10_an_mod
> els_ethnicity.log
  log type:  text
 opened on:  19 Jul 2020, 18:48:45

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. drop if ethnicity == .u
(45,237 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   124,689        853 |   125,542 
           |     99.32       0.68 |    100.00 
-----------+----------------------+----------
       HCQ |    23,318        129 |    23,447 
           |     99.45       0.55 |    100.00 
-----------+----------------------+----------
     Total |   148,007        982 |   148,989 
           |     99.34       0.66 |    100.00 

. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11678.589
Iteration 1:   log likelihood = -11675.598
Iteration 2:   log likelihood = -11675.582
Iteration 3:   log likelihood = -11675.582
Refining estimates:
Iteration 0:   log likelihood = -11675.582

Cox regression -- Breslow method for ties

No. of subjects =      148,989                  Number of obs    =     148,989
No. of failures =          982
Time at risk    =     18843796
                                                LR chi2(1)       =        6.01
Log likelihood  =   -11675.582                  Prob > chi2      =      0.0142

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7982308   .0754076    -2.39   0.017     .6633103    .9605946
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar.ster 
> saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11678.589
Iteration 1:   log likelihood = -11613.517
Iteration 2:   log likelihood = -11581.036
Iteration 3:   log likelihood = -11580.154
Iteration 4:   log likelihood = -11580.153
Refining estimates:
Iteration 0:   log likelihood = -11580.153

Cox regression -- Breslow method for ties

No. of subjects =      148,989                  Number of obs    =     148,989
No. of failures =          982
Time at risk    =     18843796
                                                LR chi2(5)       =      196.87
Log likelihood  =   -11580.153                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8962962     .08519    -1.15   0.249     .7439567     1.07983
      1.male |   1.128891   .0778785     1.76   0.079      .986121     1.29233
        age1 |   1.004857   .0086008     0.57   0.571     .9881403    1.021856
        age2 |   1.004335    .017224     0.25   0.801     .9711374    1.038667
        age3 |   1.135856   .0926245     1.56   0.118     .9680796    1.332709
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1.st
> er saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8208.7888
Iteration 1:   log likelihood = -8102.2773
Iteration 2:   log likelihood =  -8067.908
Iteration 3:   log likelihood = -8067.1635
Iteration 4:   log likelihood = -8067.1628
Refining estimates:
Iteration 0:   log likelihood = -8067.1628

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,989                  Number of obs    =     148,989
No. of failures =          982
Time at risk    =     18843796
                                                LR chi2(7)       =      283.25
Log likelihood  =   -8067.1628                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8407698   .0813811    -1.79   0.073     .6954826    1.016408
      1.male |   1.139716   .0789837     1.89   0.059     .9949639    1.305527
        age1 |   1.006022   .0086743     0.70   0.486     .9891635    1.023168
        age2 |   .9985424   .0172258    -0.08   0.933     .9653448    1.032882
        age3 |   1.170892   .0962277     1.92   0.055     .9966956    1.375535
  1.dmard_pc |   1.108589    .075769     1.51   0.131     .9696013    1.267499
1.oral_pr~ne |   1.933241    .137002     9.30   0.000     1.682536    2.221302
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2.st
> er saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine, strata(stp population) 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8208.7888
Iteration 1:   log likelihood = -8115.4726
Iteration 2:   log likelihood = -8028.5116
Iteration 3:   log likelihood = -8020.2547
Iteration 4:   log likelihood =  -8019.876
Iteration 5:   log likelihood = -8019.8744
Refining estimates:
Iteration 0:   log likelihood = -8019.8744

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,989                  Number of obs    =     148,989
No. of failures =          982
Time at risk    =     18843796
                                                LR chi2(20)      =      377.83
Log likelihood  =   -8019.8744                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |    .826674   .0801938    -1.96   0.050     .6835355    .9997869
      1.male |   1.097477   .0772088     1.32   0.186     .9561195    1.259732
        age1 |   1.001143   .0086906     0.13   0.895     .9842534    1.018322
        age2 |   .9907631   .0173567    -0.53   0.596      .957322    1.025372
        age3 |   1.216206   .1016124     2.34   0.019     1.032501    1.432597
  1.dmard_pc |   1.144446   .0791945     1.95   0.051     .9992937    1.310683
1.oral_pr~ne |   1.747861   .1286049     7.59   0.000     1.513132    2.019003
    1.nsaids |   .9480485   .0914149    -0.55   0.580     .7847911    1.145268
1.~c_disease |   1.341943   .1065457     3.70   0.000     1.148554    1.567893
1.resp_exc~a |   1.245134   .1028275     2.65   0.008     1.059061      1.4639
             |
egfr_cat_n~s |
      30-59  |   1.062868   .0974149     0.67   0.506     .8881052    1.272022
        <30  |   2.107955   .3898657     4.03   0.000     1.467006    3.028941
             |
1.~r_disease |   .9577624   .2586038    -0.16   0.873     .5641912    1.625883
             |
   obese4cat |
Obese I ..)  |   1.206867    .099872     2.27   0.023     1.026171    1.419381
Obese II..)  |   1.295798   .1525519     2.20   0.028      1.02879    1.632103
Obese II..)  |   1.826818   .2596515     4.24   0.000     1.382647    2.413678
             |
1.hyperten~n |   1.117862   .0816753     1.52   0.127     .9687154    1.289972
1.cancer_e~r |   1.238012   .1142137     2.31   0.021     1.033229    1.483382
1.neuro_co~s |   1.423037    .143711     3.49   0.000     1.167492    1.734515
1.flu_vacc~e |   1.082356    .084823     1.01   0.313     .9282442    1.262053
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3.st
> er saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11678.589
Iteration 1:   log likelihood = -11675.598
Iteration 2:   log likelihood = -11675.582
Iteration 3:   log likelihood = -11675.582
Refining estimates:
Iteration 0:   log likelihood = -11675.582

Cox regression -- Breslow method for ties

No. of subjects =      148,989                  Number of obs    =     148,989
No. of failures =          982
Time at risk    =     18843796
                                                LR chi2(1)       =        6.01
Log likelihood  =   -11675.582                  Prob > chi2      =      0.0142

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .7982308   .0754076    -2.39   0.017     .6633103    .9605946
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_eth.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11678.589
Iteration 1:   log likelihood = -11613.517
Iteration 2:   log likelihood = -11581.036
Iteration 3:   log likelihood = -11580.154
Iteration 4:   log likelihood = -11580.153
Refining estimates:
Iteration 0:   log likelihood = -11580.153

Cox regression -- Breslow method for ties

No. of subjects =      148,989                  Number of obs    =     148,989
No. of failures =          982
Time at risk    =     18843796
                                                LR chi2(5)       =      196.87
Log likelihood  =   -11580.153                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8962962     .08519    -1.15   0.249     .7439567     1.07983
      1.male |   1.128891   .0778785     1.76   0.079      .986121     1.29233
        age1 |   1.004857   .0086008     0.57   0.571     .9881403    1.021856
        age2 |   1.004335    .017224     0.25   0.801     .9711374    1.038667
        age3 |   1.135856   .0926245     1.56   0.118     .9680796    1.332709
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_et
> h.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp population)                               

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8208.7888
Iteration 1:   log likelihood = -8096.5716
Iteration 2:   log likelihood = -8062.5567
Iteration 3:   log likelihood = -8061.8281
Iteration 4:   log likelihood = -8061.8274
Refining estimates:
Iteration 0:   log likelihood = -8061.8274

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,989                  Number of obs    =     148,989
No. of failures =          982
Time at risk    =     18843796
                                                LR chi2(11)      =      293.92
Log likelihood  =   -8061.8274                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8358157   .0809329    -1.85   0.064     .6913339    1.010493
      1.male |   1.144131   .0793012     1.94   0.052     .9987989    1.310611
        age1 |    1.00701   .0087148     0.81   0.420     .9900731    1.024236
        age2 |   .9991512   .0172746    -0.05   0.961     .9658609    1.033589
        age3 |   1.165278   .0959599     1.86   0.063     .9915931    1.369384
             |
   ethnicity |
South Asian  |    1.40864   .1754001     2.75   0.006     1.103598    1.797999
      Black  |   1.370962   .2894274     1.49   0.135     .9064125    2.073599
      Mixed  |    1.60252   .4916561     1.54   0.124     .8783208     2.92384
      Other  |   .8038263   .2888156    -0.61   0.543     .3974886    1.625548
             |
  1.dmard_pc |   1.111776   .0759844     1.55   0.121     .9723935    1.271139
1.oral_pr~ne |   1.930167   .1367673     9.28   0.000     1.679889    2.217732
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_et
> h.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine, strata(stp population)     

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8208.7888
Iteration 1:   log likelihood = -8109.0867
Iteration 2:   log likelihood = -8023.0752
Iteration 3:   log likelihood = -8014.9519
Iteration 4:   log likelihood = -8014.5837
Iteration 5:   log likelihood = -8014.5822
Refining estimates:
Iteration 0:   log likelihood = -8014.5822

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,989                  Number of obs    =     148,989
No. of failures =          982
Time at risk    =     18843796
                                                LR chi2(24)      =      388.41
Log likelihood  =   -8014.5822                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8211767   .0796936    -2.03   0.042     .6789365    .9932168
      1.male |   1.102334   .0775841     1.38   0.166     .9602941    1.265384
        age1 |   1.002202   .0087354     0.25   0.801     .9852264     1.01947
        age2 |   .9913116   .0174061    -0.50   0.619     .9577766    1.026021
        age3 |   1.211627   .1014158     2.29   0.022     1.028304    1.427632
             |
   ethnicity |
South Asian  |    1.43043   .1789922     2.86   0.004      1.11932    1.828011
      Black  |   1.328764    .281362     1.34   0.179     .8774213    2.012275
      Mixed  |   1.581552   .4856353     1.49   0.135     .8663862    2.887059
      Other  |   .8355798   .3004848    -0.50   0.617     .4129385    1.690793
             |
  1.dmard_pc |   1.146705   .0793247     1.98   0.048      1.00131    1.313211
1.oral_pr~ne |   1.742543   .1281654     7.55   0.000     1.508609    2.012751
    1.nsaids |   .9494935   .0915574    -0.54   0.591     .7859821    1.147021
1.~c_disease |   1.333675   .1059281     3.63   0.000     1.141413    1.558323
1.resp_exc~a |    1.25769   .1039718     2.77   0.006     1.069561    1.478909
             |
egfr_cat_n~s |
      30-59  |   1.060152   .0971484     0.64   0.524     .8858638    1.268729
        <30  |   2.081739    .384901     3.97   0.000      1.44892    2.990944
             |
1.~r_disease |   .9609771   .2595006    -0.15   0.883     .5660516    1.631436
             |
   obese4cat |
Obese I ..)  |   1.207897   .0999546     2.28   0.022     1.027051    1.420586
Obese II..)  |   1.302753   .1534381     2.25   0.025     1.034208     1.64103
Obese II..)  |   1.849791   .2631998     4.32   0.000     1.399614    2.444764
             |
1.hyperten~n |   1.104649   .0808079     1.36   0.174     .9570988    1.274946
1.cancer_e~r |   1.251579   .1155959     2.43   0.015     1.044339    1.499945
1.neuro_co~s |    1.42466   .1438893     3.50   0.000     1.168801    1.736528
1.flu_vacc~e |   1.086997   .0852201     1.06   0.287     .9321689    1.267542
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_et
> h.ster saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table6.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 6: Ethnicity adjustments") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. file write tablecontent ("Main Analysis, dropping individuals with missing et
> hnicity") _n                                       

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,542

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  853

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,447

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  129

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7982308   .0754076    -2.39   0.017     .6633103    .9605946
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8962962     .08519    -1.15   0.249     .7439567     1.07983
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8407698   .0813811    -1.79   0.073     .6954826    1.016408
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .826674   .0801938    -1.96   0.050     .6835355    .9997869
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. file write tablecontent ("Main Analysis, adjusting for ethnicity") _n        
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  125,542

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  853

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,447

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  129

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7982308   .0754076    -2.39   0.017     .6633103    .9605946
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8962962     .08519    -1.15   0.249     .7439567     1.07983
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8358157   .0809329    -1.85   0.064     .6913339    1.010493
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8211767   .0796936    -2.03   0.042     .6789365    .9932168
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\10_an_mod
> els_ethnicity.log
  log type:  text
 closed on:  19 Jul 2020, 18:49:22
-------------------------------------------------------------------------------
