-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\10_an_mod
> els_ethnicity.log
  log type:  text
 opened on:  17 Aug 2020, 11:07:08

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. drop if ethnicity == .u
(45,403 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ | positive test or code
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   125,170        909 |   126,079 
           |     99.28       0.72 |    100.00 
-----------+----------------------+----------
       HCQ |    23,382        150 |    23,532 
           |     99.36       0.64 |    100.00 
-----------+----------------------+----------
     Total |   148,552      1,059 |   149,611 
           |     99.29       0.71 |    100.00 

. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12597.599
Iteration 1:   log likelihood = -12596.335
Iteration 2:   log likelihood = -12596.333
Iteration 3:   log likelihood = -12596.333
Refining estimates:
Iteration 0:   log likelihood = -12596.333

Cox regression -- Breslow method for ties

No. of subjects =      149,611                  Number of obs    =     149,611
No. of failures =        1,059
Time at risk    =     23106210
                                                LR chi2(1)       =        2.53
Log likelihood  =   -12596.333                  Prob > chi2      =      0.1115

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8711274    .076772    -1.57   0.117     .7329355    1.035375
------------------------------------------------------------------------------

. estimates save $Tempdir/univar, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar.ster 
> saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12597.599
Iteration 1:   log likelihood = -12539.816
Iteration 2:   log likelihood = -12514.568
Iteration 3:   log likelihood = -12513.985
Iteration 4:   log likelihood = -12513.985
Refining estimates:
Iteration 0:   log likelihood = -12513.985

Cox regression -- Breslow method for ties

No. of subjects =      149,611                  Number of obs    =     149,611
No. of failures =        1,059
Time at risk    =     23106210
                                                LR chi2(5)       =      167.23
Log likelihood  =   -12513.985                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9647274   .0855644    -0.40   0.686     .8107915    1.147889
      1.male |   1.127048    .075022     1.80   0.072     .9891954    1.284111
        age1 |   1.002202     .00782     0.28   0.778     .9869913    1.017646
        age2 |   .9990996   .0159766    -0.06   0.955     .9682717    1.030909
        age3 |   1.174544   .0906574     2.08   0.037     1.009646    1.366374
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1.st
> er saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp population)                           

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8852.2316
Iteration 1:   log likelihood = -8758.8996
Iteration 2:   log likelihood = -8731.8605
Iteration 3:   log likelihood = -8731.3416
Iteration 4:   log likelihood = -8731.3412
Refining estimates:
Iteration 0:   log likelihood = -8731.3412

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,611                  Number of obs    =     149,611
No. of failures =        1,059
Time at risk    =     23106210
                                                LR chi2(7)       =      241.78
Log likelihood  =   -8731.3412                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9062703   .0819447    -1.09   0.276     .7590884     1.08199
      1.male |   1.136102   .0759624     1.91   0.056     .9965615    1.295181
        age1 |   1.003054   .0078779     0.39   0.698     .9877322    1.018614
        age2 |   .9941018    .015981    -0.37   0.713     .9632679    1.025923
        age3 |   1.206909    .093845     2.42   0.016     1.036306    1.405598
  1.dmard_pc |   1.083521   .0714453     1.22   0.224      .952162    1.233003
1.oral_pr~ne |   1.816364   .1258981     8.61   0.000     1.585635    2.080666
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2.st
> er saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)  

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8852.2316
Iteration 1:   log likelihood = -8723.5156
Iteration 2:   log likelihood = -8656.1012
Iteration 3:   log likelihood =  -8650.676
Iteration 4:   log likelihood = -8650.4972
Iteration 5:   log likelihood = -8650.4969
Refining estimates:
Iteration 0:   log likelihood = -8650.4969

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,611                  Number of obs    =     149,611
No. of failures =        1,059
Time at risk    =     23106210
                                                LR chi2(29)      =      403.47
Log likelihood  =   -8650.4969                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8945518   .0811627    -1.23   0.219     .7488174    1.068649
      1.male |   1.101513   .0757433     1.41   0.160     .9626279    1.260436
        age1 |   .9992716   .0079159    -0.09   0.927     .9838766    1.014908
        age2 |   .9847895   .0161279    -0.94   0.349     .9536813    1.016912
        age3 |   1.263069   .1000771     2.95   0.003     1.081393    1.475267
  1.dmard_pc |   1.132275   .0756997     1.86   0.063     .9932165    1.290804
1.oral_pr~ne |   1.637625   .1178221     6.86   0.000     1.422241    1.885627
    1.nsaids |   .9576873   .0878462    -0.47   0.637     .8001016    1.146311
1.~c_disease |   1.273667   .0994561     3.10   0.002      1.09292    1.484305
1.resp_exc~a |   1.253922    .103079     2.75   0.006     1.067327    1.473139
             |
egfr_cat_n~s |
      30-59  |   .9901528     .08935    -0.11   0.913     .8296425    1.181717
        <30  |   1.898607    .346384     3.51   0.000     1.327825    2.714746
             |
1.~r_disease |   .9213249   .2405081    -0.31   0.754     .5523446    1.536794
             |
   obese4cat |
Obese I ..)  |   1.131426   .0908309     1.54   0.124        .9667    1.324222
Obese II..)  |   1.168795   .1339736     1.36   0.174     .9336171    1.463213
Obese II..)  |   1.637839   .2223818     3.63   0.000     1.255155    2.137201
             |
1.hyperten~n |   1.032065   .0735202     0.44   0.658     .8975748    1.186706
1.cancer_e~r |   1.233461   .1115711     2.32   0.020     1.033073    1.472718
1.neuro_co~s |   1.461946   .1427899     3.89   0.000      1.20724    1.770391
1.flu_vacc~e |   1.048409   .0787351     0.63   0.529      .904911    1.214663
             |
         imd |
          2  |   1.435615   .1539507     3.37   0.001     1.163477    1.771406
          3  |   1.446447    .157469     3.39   0.001     1.168518     1.79048
          4  |   1.467615   .1598112     3.52   0.000      1.18556    1.816775
5 most de..  |   1.759221   .1893094     5.25   0.000     1.424698    2.172291
             |
     diabcat |
Controlle..  |   1.265244   .1093133     2.72   0.006     1.068152    1.498703
Uncontrol..  |   1.491051   .1774771     3.36   0.001     1.180798    1.882823
Diabetes,..  |   1.087608   .2474861     0.37   0.712      .696275    1.698885
             |
smoke_nomiss |
     Former  |   .9841693   .0673797    -0.23   0.816     .8605846    1.125501
    Current  |   .5882116   .0714943    -4.37   0.000      .463526    .7464369
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3.st
> er saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12597.599
Iteration 1:   log likelihood = -12596.335
Iteration 2:   log likelihood = -12596.333
Iteration 3:   log likelihood = -12596.333
Refining estimates:
Iteration 0:   log likelihood = -12596.333

Cox regression -- Breslow method for ties

No. of subjects =      149,611                  Number of obs    =     149,611
No. of failures =        1,059
Time at risk    =     23106210
                                                LR chi2(1)       =        2.53
Log likelihood  =   -12596.333                  Prob > chi2      =      0.1115

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8711274    .076772    -1.57   0.117     .7329355    1.035375
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_eth.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12597.599
Iteration 1:   log likelihood = -12539.816
Iteration 2:   log likelihood = -12514.568
Iteration 3:   log likelihood = -12513.985
Iteration 4:   log likelihood = -12513.985
Refining estimates:
Iteration 0:   log likelihood = -12513.985

Cox regression -- Breslow method for ties

No. of subjects =      149,611                  Number of obs    =     149,611
No. of failures =        1,059
Time at risk    =     23106210
                                                LR chi2(5)       =      167.23
Log likelihood  =   -12513.985                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9647274   .0855644    -0.40   0.686     .8107915    1.147889
      1.male |   1.127048    .075022     1.80   0.072     .9891954    1.284111
        age1 |   1.002202     .00782     0.28   0.778     .9869913    1.017646
        age2 |   .9990996   .0159766    -0.06   0.955     .9682717    1.030909
        age3 |   1.174544   .0906574     2.08   0.037     1.009646    1.366374
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_et
> h.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp population)                               

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8852.2316
Iteration 1:   log likelihood = -8745.2929
Iteration 2:   log likelihood = -8718.9267
Iteration 3:   log likelihood = -8718.4338
Iteration 4:   log likelihood = -8718.4335
Refining estimates:
Iteration 0:   log likelihood = -8718.4335

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,611                  Number of obs    =     149,611
No. of failures =        1,059
Time at risk    =     23106210
                                                LR chi2(11)      =      267.60
Log likelihood  =   -8718.4335                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |     .89743   .0811877    -1.20   0.232     .7516144    1.071534
      1.male |   1.142939   .0764262     2.00   0.046     1.002547    1.302991
        age1 |   1.004695   .0079358     0.59   0.553     .9892608     1.02037
        age2 |   .9950451   .0160566    -0.31   0.758     .9640672    1.027018
        age3 |   1.197938   .0934461     2.32   0.021     1.028101    1.395831
             |
   ethnicity |
South Asian  |   1.700832    .188964     4.78   0.000     1.368019    2.114612
      Black  |   1.441635   .2921723     1.80   0.071     .9690469    2.144698
      Mixed  |   1.917094   .5225143     2.39   0.017     1.123683    3.270717
      Other  |   .9611193   .3094038    -0.12   0.902     .5113971    1.806327
             |
  1.dmard_pc |   1.088094   .0717321     1.28   0.200     .9562054    1.238173
1.oral_pr~ne |   1.813256   .1256637     8.59   0.000     1.582955    2.077064
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar2_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_et
> h.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp population)  
>     

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8852.2316
Iteration 1:   log likelihood =  -8715.042
Iteration 2:   log likelihood = -8648.3703
Iteration 3:   log likelihood = -8643.0133
Iteration 4:   log likelihood = -8642.8384
Iteration 5:   log likelihood =  -8642.838
Refining estimates:
Iteration 0:   log likelihood =  -8642.838

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,611                  Number of obs    =     149,611
No. of failures =        1,059
Time at risk    =     23106210
                                                LR chi2(33)      =      418.79
Log likelihood  =    -8642.838                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8861042   .0804408    -1.33   0.183      .741673    1.058661
      1.male |   1.101097   .0758168     1.40   0.162     .9620898    1.260189
        age1 |   1.000344   .0079686     0.04   0.966     .9848467    1.016084
        age2 |   .9856077    .016197    -0.88   0.378     .9543679     1.01787
        age3 |    1.25724   .0998615     2.88   0.004     1.075989    1.469022
             |
   ethnicity |
South Asian  |   1.519297   .1774732     3.58   0.000     1.208402    1.910178
      Black  |     1.2513   .2563951     1.09   0.274     .8374285    1.869714
      Mixed  |   1.767327   .4828351     2.08   0.037     1.034589    3.019019
      Other  |   .9404641   .3035397    -0.19   0.849     .4995885    1.770402
             |
  1.dmard_pc |   1.131711    .075635     1.85   0.064     .9927673      1.2901
1.oral_pr~ne |   1.632193   .1173806     6.81   0.000     1.417609    1.879258
    1.nsaids |   .9565415   .0877439    -0.48   0.628     .7991399    1.144946
1.~c_disease |   1.266419   .0989057     3.02   0.002     1.086675    1.475894
1.resp_exc~a |   1.260851   .1036224     2.82   0.005     1.073268    1.481219
             |
egfr_cat_n~s |
      30-59  |   .9907848   .0893898    -0.10   0.918     .8302004    1.182431
        <30  |    1.88183   .3432576     3.47   0.001     1.316182    2.690574
             |
1.~r_disease |   .9268749   .2419865    -0.29   0.771     .5556372    1.546148
             |
   obese4cat |
Obese I ..)  |   1.139041   .0914392     1.62   0.105     .9732112    1.333127
Obese II..)  |   1.190601   .1365802     1.52   0.128     .9508687    1.490775
Obese II..)  |   1.688953   .2297967     3.85   0.000     1.293613    2.205113
             |
1.hyperten~n |   1.024293   .0729916     0.34   0.736     .8907733    1.177826
1.cancer_e~r |   1.248555   .1130654     2.45   0.014     1.045503    1.491042
1.neuro_co~s |   1.466002   .1432124     3.92   0.000     1.210546    1.775365
1.flu_vacc~e |   1.056176   .0793902     0.73   0.467     .9114936    1.223824
             |
         imd |
          2  |   1.430765   .1534311     3.34   0.001     1.159546    1.765423
          3  |   1.427149   .1554936     3.26   0.001     1.152729    1.766896
          4  |   1.428089   .1559594     3.26   0.001     1.152914    1.768942
5 most de..  |   1.689224   .1831104     4.84   0.000     1.365896    2.089088
             |
     diabcat |
Controlle..  |   1.220524   .1062875     2.29   0.022     1.029013    1.447678
Uncontrol..  |   1.428116   .1709998     2.98   0.003     1.129386    1.805863
Diabetes,..  |   1.052015   .2396296     0.22   0.824     .6731843    1.644031
             |
smoke_nomiss |
     Former  |   1.034471   .0727792     0.48   0.630     .9012241    1.187418
    Current  |   .6290647   .0775204    -3.76   0.000     .4940839    .8009215
------------------------------------------------------------------------------
                                                  Stratified by stp population

. estimates save $Tempdir/multivar3_eth, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_et
> h.ster saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table6.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 6: Ethnicity adjustments") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. file write tablecontent ("Main Analysis, dropping individuals with missing et
> hnicity") _n                                       

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  126,079

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  909

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,532

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  150

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8711274    .076772    -1.57   0.117     .7329355    1.035375
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9647274   .0855644    -0.40   0.686     .8107915    1.147889
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9062703   .0819447    -1.09   0.276     .7590884     1.08199
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8945518   .0811627    -1.23   0.219     .7488174    1.068649
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. file write tablecontent ("Main Analysis, adjusting for ethnicity") _n        
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  126,079

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1
  909

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  23,532

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1
  150

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8711274    .076772    -1.57   0.117     .7329355    1.035375
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9647274   .0855644    -0.40   0.686     .8107915    1.147889
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .89743   .0811877    -1.20   0.232     .7516144    1.071534
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_eth 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8861042   .0804408    -1.33   0.183      .741673    1.058661
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\10_an_mod
> els_ethnicity.log
  log type:  text
 closed on:  17 Aug 2020, 11:07:51
-------------------------------------------------------------------------------
