-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\11_an_mod
> els_sep_pops.log
  log type:  text
 opened on:  17 Aug 2020, 11:07:51

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 0
(26,803 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ | positive test or code
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   143,351      1,100 |   144,451 
           |     99.24       0.76 |    100.00 
-----------+----------------------+----------
       HCQ |    23,599        161 |    23,760 
           |     99.32       0.68 |    100.00 
-----------+----------------------+----------
     Total |   166,950      1,261 |   168,211 
           |     99.25       0.75 |    100.00 

. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15150.689
Iteration 1:   log likelihood = -15149.501
Iteration 2:   log likelihood = -15149.499
Refining estimates:
Iteration 0:   log likelihood = -15149.499

Cox regression -- Breslow method for ties

No. of subjects =      168,211                  Number of obs    =     168,211
No. of failures =        1,261
Time at risk    =     26026302
                                                LR chi2(1)       =        2.38
Log likelihood  =   -15149.499                  Prob > chi2      =      0.1230

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8797624   .0742359    -1.52   0.129     .7456577    1.037985
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_ra.st
> er saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15150.689
Iteration 1:   log likelihood = -15072.316
Iteration 2:   log likelihood = -15045.205
Iteration 3:   log likelihood = -15044.724
Iteration 4:   log likelihood = -15044.723
Refining estimates:
Iteration 0:   log likelihood = -15044.723

Cox regression -- Breslow method for ties

No. of subjects =      168,211                  Number of obs    =     168,211
No. of failures =        1,261
Time at risk    =     26026302
                                                LR chi2(5)       =      211.93
Log likelihood  =   -15044.723                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9612417   .0815106    -0.47   0.641     .8140538    1.135043
      1.male |   1.110151   .0667911     1.74   0.082     .9866661    1.249089
        age1 |   1.006806   .0078367     0.87   0.384     .9915625    1.022283
        age2 |   .9932866     .01523    -0.44   0.660     .9638803     1.02359
        age3 |   1.193787   .0862615     2.45   0.014     1.036144    1.375415
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_ra
> .ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp)                              

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11105.744
Iteration 1:   log likelihood =  -10997.99
Iteration 2:   log likelihood = -10968.344
Iteration 3:   log likelihood =  -10967.85
Iteration 4:   log likelihood = -10967.849
Refining estimates:
Iteration 0:   log likelihood = -10967.849

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      168,211                  Number of obs    =     168,211
No. of failures =        1,261
Time at risk    =     26026302
                                                LR chi2(7)       =      275.79
Log likelihood  =   -10967.849                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9194947    .078951    -0.98   0.328     .7770736    1.088019
      1.male |   1.120505   .0674669     1.89   0.059     .9957764    1.260856
        age1 |   1.007254   .0078867     0.92   0.356     .9919146    1.022831
        age2 |   .9894408   .0152513    -0.69   0.491     .9599959    1.019789
        age3 |   1.221522   .0888805     2.75   0.006     1.059171    1.408759
  1.dmard_pc |   1.078601   .0629983     1.30   0.195     .9619319    1.209421
1.oral_pr~ne |   1.619104   .1048168     7.44   0.000     1.426165    1.838143
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_ra
> .ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp)     

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11105.744
Iteration 1:   log likelihood = -11020.095
Iteration 2:   log likelihood =  -10891.75
Iteration 3:   log likelihood = -10876.391
Iteration 4:   log likelihood = -10875.482
Iteration 5:   log likelihood = -10875.476
Iteration 6:   log likelihood = -10875.476
Refining estimates:
Iteration 0:   log likelihood = -10875.476

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      168,211                  Number of obs    =     168,211
No. of failures =        1,261
Time at risk    =     26026302
                                                LR chi2(29)      =      460.54
Log likelihood  =   -10875.476                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9103734   .0783577    -1.09   0.275     .7690505    1.077666
      1.male |   1.065322   .0659749     1.02   0.307     .9435536    1.202806
        age1 |   1.003743   .0079227     0.47   0.636     .9883345    1.019392
        age2 |   .9793182   .0153867    -1.33   0.183     .9496204    1.009945
        age3 |   1.280435   .0950083     3.33   0.001     1.107129    1.480869
  1.dmard_pc |   1.141306   .0678582     2.22   0.026     1.015763    1.282365
1.oral_pr~ne |   1.455836   .0976871     5.60   0.000     1.276429     1.66046
    1.nsaids |   .9954513   .0817953    -0.06   0.956     .8473787    1.169398
1.~c_disease |   1.270625   .0893795     3.40   0.001     1.106984    1.458457
1.resp_exc~a |   1.279244     .09539     3.30   0.001     1.105303    1.480558
             |
egfr_cat_n~s |
      30-59  |   1.027805   .0825584     0.34   0.733     .8780881     1.20305
        <30  |   2.266635   .3587563     5.17   0.000     1.662095    3.091058
             |
1.~r_disease |   1.128927   .2618864     0.52   0.601     .7164831    1.778796
             |
   obese4cat |
Obese I ..)  |    1.07568   .0799179     0.98   0.326     .9299145    1.244295
Obese II..)  |   1.072022   .1158962     0.64   0.520     .8673216    1.325034
Obese II..)  |   1.404467   .1847466     2.58   0.010     1.085282    1.817525
             |
1.hyperten~n |   1.024328   .0663415     0.37   0.711     .9022154    1.162968
1.cancer_e~r |   1.228998   .1001823     2.53   0.011     1.047527    1.441907
1.neuro_co~s |   1.538697   .1349262     4.91   0.000     1.295724    1.827232
1.flu_vacc~e |   1.039636   .0718217     0.56   0.574     .9079822    1.190379
             |
         imd |
          2  |   1.438974   .1381033     3.79   0.000      1.19223    1.736783
          3  |    1.45912     .14255     3.87   0.000     1.204847    1.767054
          4  |   1.514033   .1483143     4.23   0.000     1.249545    1.834504
5 most de..  |   1.759409   .1725926     5.76   0.000     1.451666    2.132392
             |
     diabcat |
Controlle..  |   1.179617   .0952783     2.05   0.041     1.006906    1.381952
Uncontrol..  |   1.424678   .1566201     3.22   0.001     1.148526    1.767227
Diabetes,..  |   1.174006   .2303387     0.82   0.414     .7992181    1.724547
             |
smoke_nomiss |
     Former  |   1.038922   .0653612     0.61   0.544     .9183998    1.175261
    Current  |   .6464424   .0720147    -3.92   0.000     .5196425    .8041831
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_ra
> .ster saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 1
(168,211 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ | positive test or code
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    19,844        110 |    19,954 
           |     99.45       0.55 |    100.00 
-----------+----------------------+----------
       HCQ |     6,806         43 |     6,849 
           |     99.37       0.63 |    100.00 
-----------+----------------------+----------
     Total |    26,650        153 |    26,803 
           |     99.43       0.57 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1555.1405
Iteration 1:   log likelihood = -1555.0032
Iteration 2:   log likelihood = -1555.0031
Refining estimates:
Iteration 0:   log likelihood = -1555.0031

Cox regression -- Breslow method for ties

No. of subjects =       26,803                  Number of obs    =      26,803
No. of failures =          153
Time at risk    =      4090894
                                                LR chi2(1)       =        0.27
Log likelihood  =   -1555.0031                  Prob > chi2      =      0.6001

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.099612    .197769     0.53   0.598     .7729437    1.564339
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_sle.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1555.1405
Iteration 1:   log likelihood = -1550.9652
Iteration 2:   log likelihood = -1550.5741
Iteration 3:   log likelihood = -1550.5712
Iteration 4:   log likelihood = -1550.5712
Refining estimates:
Iteration 0:   log likelihood = -1550.5712

Cox regression -- Breslow method for ties

No. of subjects =       26,803                  Number of obs    =      26,803
No. of failures =          153
Time at risk    =      4090894
                                                LR chi2(5)       =        9.14
Log likelihood  =   -1550.5712                  Prob > chi2      =      0.1037

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.204266   .2213436     1.01   0.312     .8399861    1.726525
      1.male |   1.378717   .2684941     1.65   0.099     .9412617    2.019481
        age1 |    .997637   .0146835    -0.16   0.872      .969269    1.026835
        age2 |   1.003536   .0361844     0.10   0.922     .9350637    1.077022
        age3 |    1.10214   .2179688     0.49   0.623     .7479904     1.62397
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_sl
> e.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp)                          

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -825.1211
Iteration 1:   log likelihood = -806.89942
Iteration 2:   log likelihood = -805.38129
Iteration 3:   log likelihood = -805.37262
Iteration 4:   log likelihood = -805.37261
Refining estimates:
Iteration 0:   log likelihood = -805.37261

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,745                  Number of obs    =      20,745
No. of failures =          122
Time at risk    =      3164503
                                                LR chi2(11)      =       39.50
Log likelihood  =   -805.37261                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.038941   .2245195     0.18   0.860     .6802093    1.586862
      1.male |   1.458307   .3194316     1.72   0.085     .9492912    2.240261
        age1 |    .990039   .0162517    -0.61   0.542     .9586932     1.02241
        age2 |   1.039865   .0422908     0.96   0.336     .9601941    1.126147
        age3 |    .935291   .2091165    -0.30   0.765     .6034361    1.449647
             |
   ethnicity |
South Asian  |   1.715031   .5016893     1.84   0.065     .9666617    3.042774
      Black  |   2.314299   .7709988     2.52   0.012     1.204607    4.446247
      Mixed  |   2.077803   1.082249     1.40   0.160      .748593    5.767174
      Other  |   .4017057   .4065544    -0.90   0.368     .0552627    2.920007
             |
  1.dmard_pc |   1.175459   .3174353     0.60   0.549     .6923707    1.995613
1.oral_pr~ne |   2.216755   .4530982     3.89   0.000     1.485028    3.309031
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_sl
> e.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp) 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -825.1211
Iteration 1:   log likelihood =  -786.2616
Iteration 2:   log likelihood = -781.56874
Iteration 3:   log likelihood = -781.52913
Iteration 4:   log likelihood = -781.52912
Refining estimates:
Iteration 0:   log likelihood = -781.52912

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,745                  Number of obs    =      20,745
No. of failures =          122
Time at risk    =      3164503
                                                LR chi2(33)      =       87.18
Log likelihood  =   -781.52912                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9687508   .2124709    -0.14   0.885     .6302642    1.489023
      1.male |   1.490605   .3362034     1.77   0.077     .9580218    2.319261
        age1 |   .9799575   .0163935    -1.21   0.226      .948348    1.012621
        age2 |   1.030405   .0429947     0.72   0.473     .9494908    1.118215
        age3 |   .9988885   .2293866    -0.00   0.996     .6368623     1.56671
             |
   ethnicity |
South Asian  |   1.483207   .4562502     1.28   0.200     .8116391    2.710443
      Black  |    1.99878   .6939037     1.99   0.046     1.012182    3.947037
      Mixed  |   2.009442   1.054715     1.33   0.184     .7182863    5.621518
      Other  |   .4082248    .414094    -0.88   0.377     .0559062    2.980841
             |
  1.dmard_pc |   1.166074   .3172422     0.56   0.572     .6841446    1.987486
1.oral_pr~ne |    1.92879   .4101292     3.09   0.002     1.271421    2.926042
    1.nsaids |    1.75066   .4595156     2.13   0.033     1.046591    2.928372
1.~c_disease |   1.302037   .3228293     1.06   0.287      .800894     2.11676
1.resp_exc~a |   1.541341   .3915014     1.70   0.089     .9368995    2.535738
             |
egfr_cat_n~s |
      30-59  |   1.143743    .324603     0.47   0.636     .6557686     1.99483
        <30  |   .7906224   .5775337    -0.32   0.748     .1888789    3.309441
             |
1.~r_disease |   .5564359   .4004755    -0.81   0.415     .1357664    2.280542
             |
   obese4cat |
Obese I ..)  |   1.817048   .4034214     2.69   0.007     1.175933    2.807698
Obese II..)  |   1.604792   .5193301     1.46   0.144     .8510588    3.026062
Obese II..)  |   2.380469   .8794159     2.35   0.019     1.153994    4.910454
             |
1.hyperten~n |   1.055489   .2281965     0.25   0.803     .6909144    1.612439
1.cancer_e~r |   1.743167   .4624955     2.09   0.036     1.036332    2.932102
1.neuro_co~s |   1.161035   .3652307     0.47   0.635     .6267294    2.150853
1.flu_vacc~e |     1.0418   .2215438     0.19   0.847     .6867079    1.580507
             |
         imd |
          2  |   1.570056    .489537     1.45   0.148     .8521462    2.892786
          3  |    1.48403   .4778768     1.23   0.220     .7894868    2.789591
          4  |   .9270014    .328195    -0.21   0.830     .4631498    1.855407
5 most de..  |   1.883793   .5903657     2.02   0.043     1.019233    3.481713
             |
     diabcat |
Controlle..  |   1.620873   .4116506     1.90   0.057     .9853046    2.666412
Uncontrol..  |   1.468862   .5758289     0.98   0.327     .6812237    3.167177
Diabetes,..  |   1.176975   .8493797     0.23   0.821      .286079    4.842262
             |
smoke_nomiss |
     Former  |   .9975966   .2060384    -0.01   0.991     .6655063    1.495401
    Current  |   .5372476   .1871841    -1.78   0.075     .2713968    1.063517
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_sl
> e.ster saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7a_sep.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7a: RA and SLE populations separately") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Rheumatoid arthritis (RA)") _n                     
>                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 0
  144,451

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 0
  1,100

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 0
  23,760

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 0
  161

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8797624   .0742359    -1.52   0.129     .7456577    1.037985
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9612417   .0815106    -0.47   0.641     .8140538    1.135043
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9194947    .078951    -0.98   0.328     .7770736    1.088019
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9103734   .0783577    -1.09   0.275     .7690505    1.077666
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model  ==========================*/
. file write tablecontent ("Systemic lupus erythematosus (SLE)") _n            
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 1
  19,954

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 1
  110

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 1
  6,849

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 1
  43

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_sle 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.099612    .197769     0.53   0.598     .7729437    1.564339
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.204266   .2213436     1.01   0.312     .8399861    1.726525
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.038941   .2245195     0.18   0.860     .6802093    1.586862
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9687508   .2124709    -0.14   0.885     .6302642    1.489023
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* INDICATOR VARIABLE========================================================
> */ 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ | positive test or code
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   163,195      1,210 |   164,405 
           |     99.26       0.74 |    100.00 
-----------+----------------------+----------
       HCQ |    30,405        204 |    30,609 
           |     99.33       0.67 |    100.00 
-----------+----------------------+----------
     Total |   193,600      1,414 |   195,014 
           |     99.27       0.73 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17195.328
Iteration 1:   log likelihood = -17194.171
Iteration 2:   log likelihood = -17194.169
Refining estimates:
Iteration 0:   log likelihood = -17194.169

Cox regression -- Breslow method for ties

No. of subjects =      195,014                  Number of obs    =     195,014
No. of failures =        1,414
Time at risk    =     30117196
                                                LR chi2(1)       =        2.32
Log likelihood  =   -17194.169                  Prob > chi2      =      0.1278

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8925214   .0675517    -1.50   0.133     .7694747    1.035245
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_ind.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17195.328
Iteration 1:   log likelihood = -17113.293
Iteration 2:   log likelihood = -17084.032
Iteration 3:   log likelihood = -17083.479
Iteration 4:   log likelihood = -17083.479
Refining estimates:
Iteration 0:   log likelihood = -17083.479

Cox regression -- Breslow method for ties

No. of subjects =      195,014                  Number of obs    =     195,014
No. of failures =        1,414
Time at risk    =     30117196
                                                LR chi2(5)       =      223.70
Log likelihood  =   -17083.479                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9915697   .0755564    -0.11   0.912     .8540095    1.151287
      1.male |   1.135261   .0651259     2.21   0.027     1.014531    1.270358
        age1 |   1.004674   .0068458     0.68   0.494     .9913458    1.018182
        age2 |   .9959617    .013825    -0.29   0.771     .9692305     1.02343
        age3 |   1.181068   .0787682     2.50   0.013      1.03635    1.345995
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_in
> d.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone, strata(stp)                             

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -9231.9986
Iteration 1:   log likelihood = -9124.9785
Iteration 2:   log likelihood = -9096.4912
Iteration 3:   log likelihood = -9095.9025
Iteration 4:   log likelihood =  -9095.902
Refining estimates:
Iteration 0:   log likelihood =  -9095.902

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,611                  Number of obs    =     149,611
No. of failures =        1,059
Time at risk    =     23106210
                                                LR chi2(12)      =      272.19
Log likelihood  =    -9095.902                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8979635   .0812368    -1.19   0.234     .7520597    1.072173
             |
  population |
        SLE  |   .9288994   .0936589    -0.73   0.464     .7623314    1.131862
      1.male |   1.143043   .0764202     2.00   0.046     1.002661    1.303081
        age1 |   1.004881   .0079272     0.62   0.537      .989464    1.020539
        age2 |   .9948225   .0160367    -0.32   0.747     .9638825    1.026756
        age3 |   1.198798   .0934387     2.33   0.020     1.028964    1.396663
             |
   ethnicity |
South Asian  |   1.692861   .1881426     4.74   0.000     1.361507    2.104858
      Black  |   1.439743   .2913467     1.80   0.072     .9683573    2.140594
      Mixed  |   1.938396   .5280155     2.43   0.015      1.13652    3.306041
      Other  |   .9679609   .3115511    -0.10   0.919     .5150949    1.818982
             |
  1.dmard_pc |   1.087681   .0716121     1.28   0.202     .9560021    1.237496
1.oral_pr~ne |   1.808612   .1253279     8.55   0.000     1.578925    2.071713
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_in
> d.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egf
> r_cat_nomiss i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever
>  i.neuro_conditions i.flu_vaccine i.imd i.diabcat i.smoke_nomiss, strata(stp)
>     

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -9231.9986
Iteration 1:   log likelihood =  -9094.716
Iteration 2:   log likelihood = -9025.9553
Iteration 3:   log likelihood = -9020.4073
Iteration 4:   log likelihood = -9020.2247
Iteration 5:   log likelihood = -9020.2243
Refining estimates:
Iteration 0:   log likelihood = -9020.2243

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      149,611                  Number of obs    =     149,611
No. of failures =        1,059
Time at risk    =     23106210
                                                LR chi2(34)      =      423.55
Log likelihood  =   -9020.2243                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8872038   .0805405    -1.32   0.187     .7425936    1.059975
             |
  population |
        SLE  |   .9498896   .0962695    -0.51   0.612     .7787634    1.158619
      1.male |   1.100759   .0757865     1.39   0.163      .961806    1.259786
        age1 |    1.00051   .0079592     0.06   0.949     .9850316    1.016232
        age2 |   .9854984   .0161813    -0.89   0.374     .9542885    1.017729
        age3 |   1.257435   .0998136     2.89   0.004     1.076263    1.469105
             |
   ethnicity |
South Asian  |   1.512367   .1768062     3.54   0.000     1.202668    1.901816
      Black  |   1.252791    .256233     1.10   0.270     .8390403    1.870573
      Mixed  |   1.788106   .4880962     2.13   0.033      1.04723    3.053122
      Other  |      .9474   .3057264    -0.17   0.867      .503327    1.783267
             |
  1.dmard_pc |   1.131568   .0755481     1.85   0.064     .9927753    1.289764
1.oral_pr~ne |   1.629081   .1171111     6.79   0.000     1.414984    1.875572
    1.nsaids |   .9576766    .087823    -0.47   0.637     .8001292    1.146245
1.~c_disease |   1.266011   .0988448     3.02   0.003     1.086374    1.475352
1.resp_exc~a |   1.259387   .1034528     2.81   0.005     1.072104    1.479386
             |
egfr_cat_n~s |
      30-59  |   .9911889   .0894408    -0.10   0.922      .830515    1.182947
        <30  |   1.895872   .3455331     3.51   0.000     1.326395    2.709849
             |
1.~r_disease |   .9284804   .2422744    -0.28   0.776     .5567539    1.548397
             |
   obese4cat |
Obese I ..)  |   1.139601   .0914635     1.63   0.103      .973724    1.333735
Obese II..)  |   1.193501   .1368883     1.54   0.123     .9532227    1.494346
Obese II..)  |   1.685664   .2293236     3.84   0.000     1.291132    2.200754
             |
1.hyperten~n |   1.023417   .0729075     0.32   0.745     .8900482     1.17677
1.cancer_e~r |   1.246923   .1129012     2.44   0.015     1.044164    1.489055
1.neuro_co~s |   1.463031   .1428804     3.90   0.000     1.208161    1.771668
1.flu_vacc~e |   1.053661   .0791671     0.70   0.487     .9093803    1.220833
             |
         imd |
          2  |    1.42955   .1532809     3.33   0.001     1.158593    1.763875
          3  |   1.426141   .1553689     3.26   0.001     1.151939    1.765612
          4  |   1.425708   .1556734     3.25   0.001     1.151033     1.76593
5 most de..  |   1.684618   .1825906     4.81   0.000     1.362205    2.083342
             |
     diabcat |
Controlle..  |   1.223253   .1065125     2.31   0.021     1.031334    1.450885
Uncontrol..  |   1.436645   .1719489     3.03   0.002     1.136243    1.816469
Diabetes,..  |   1.050879     .23933     0.22   0.828     .6725085     1.64213
             |
smoke_nomiss |
     Former  |   1.035904   .0728627     0.50   0.616     .9025025    1.189024
    Current  |   .6280488   .0773809    -3.78   0.000      .493308    .7995923
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_in
> d.ster saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7b_ind.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7b: RA and SLE populations as indicator varia
> ble") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Indicator in DAG and Fully Adjusted only") _n      
>                                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  164,405

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 
  1,210

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  30,609

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 
  204

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8925214   .0675517    -1.50   0.133     .7694747    1.035245
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9915697   .0755564    -0.11   0.912     .8540095    1.151287
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8979635   .0812368    -1.19   0.234     .7520597    1.072173
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8872038   .0805405    -1.32   0.187     .7425936    1.059975
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n 

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\11_an_mod
> els_sep_pops.log
  log type:  text
 closed on:  17 Aug 2020, 11:08:44
-------------------------------------------------------------------------------
