-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\11_an_mod
> els_sep_pops.log
  log type:  text
 opened on:  19 Jul 2020, 18:49:22

. 
. * Open Stata dataset
. use $Tempdir\analysis_dataset_STSET_$outcome, clear

. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 0
(26,723 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   142,799      1,041 |   143,840 
           |     99.28       0.72 |    100.00 
-----------+----------------------+----------
       HCQ |    23,519        144 |    23,663 
           |     99.39       0.61 |    100.00 
-----------+----------------------+----------
     Total |   166,318      1,185 |   167,503 
           |     99.29       0.71 |    100.00 

. /* Main Model (same adjustments, removing those with missing ethnicity) =====
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -14233.776
Iteration 1:   log likelihood = -14231.532
Iteration 2:   log likelihood = -14231.523
Iteration 3:   log likelihood = -14231.523
Refining estimates:
Iteration 0:   log likelihood = -14231.523

Cox regression -- Breslow method for ties

No. of subjects =      167,503                  Number of obs    =     167,503
No. of failures =        1,185
Time at risk    =     21222589
                                                LR chi2(1)       =        4.51
Log likelihood  =   -14231.523                  Prob > chi2      =      0.0338

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8315948   .0739375    -2.07   0.038      .698604    .9899026
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_ra.st
> er saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -14233.776
Iteration 1:   log likelihood = -14145.193
Iteration 2:   log likelihood = -14114.466
Iteration 3:   log likelihood = -14113.879
Iteration 4:   log likelihood = -14113.878
Refining estimates:
Iteration 0:   log likelihood = -14113.878

Cox regression -- Breslow method for ties

No. of subjects =      167,503                  Number of obs    =     167,503
No. of failures =        1,185
Time at risk    =     21222589
                                                LR chi2(5)       =      239.80
Log likelihood  =   -14113.878                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9142453   .0816742    -1.00   0.316     .7673978    1.089193
      1.male |   1.109232   .0688025     1.67   0.095     .9822565    1.252622
        age1 |   1.009524   .0086006     1.11   0.266     .9928076    1.026523
        age2 |   .9997606   .0164049    -0.01   0.988     .9681191    1.032436
        age3 |     1.1416   .0870362     1.74   0.082      .983146    1.325593
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_ra
> .ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone, strata
> (stp)                              

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -10438.147
Iteration 1:   log likelihood = -10313.394
Iteration 2:   log likelihood =  -10280.13
Iteration 3:   log likelihood = -10279.569
Iteration 4:   log likelihood = -10279.568
Refining estimates:
Iteration 0:   log likelihood = -10279.568

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      167,503                  Number of obs    =     167,503
No. of failures =        1,185
Time at risk    =     21222589
                                                LR chi2(7)       =      317.16
Log likelihood  =   -10279.568                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8795991   .0795015    -1.42   0.156     .7368006    1.050073
      1.male |   1.119244   .0694814     1.81   0.070     .9910217    1.264056
        age1 |     1.0099    .008654     1.15   0.250     .9930805    1.027005
        age2 |    .995136   .0164151    -0.30   0.768     .9634774    1.027835
        age3 |   1.172364   .0900118     2.07   0.038     1.008576    1.362749
  1.dmard_pc |   1.089248   .0655268     1.42   0.155     .9681002    1.225556
1.oral_pr~ne |   1.742557   .1141152     8.48   0.000     1.532654    1.981207
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_ra
> .ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.dmard_pc i.oral_prednisolone i.nsaid
> s i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss i.chronic_li
> ver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_conditions i.flu
> _vaccine, strata(stp)    

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -10438.147
Iteration 1:   log likelihood = -10349.228
Iteration 2:   log likelihood = -10235.498
Iteration 3:   log likelihood =  -10223.36
Iteration 4:   log likelihood =  -10222.71
Iteration 5:   log likelihood = -10222.706
Iteration 6:   log likelihood = -10222.706
Refining estimates:
Iteration 0:   log likelihood = -10222.706

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      167,503                  Number of obs    =     167,503
No. of failures =        1,185
Time at risk    =     21222589
                                                LR chi2(20)      =      430.88
Log likelihood  =   -10222.706                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8688342   .0786676    -1.55   0.120      .727555    1.037547
      1.male |   1.059405   .0667801     0.92   0.360     .9362804     1.19872
        age1 |   1.006219   .0086735     0.72   0.472     .9893622    1.023363
        age2 |    .985847   .0165164    -0.85   0.395     .9540011    1.018756
        age3 |   1.221824   .0954062     2.57   0.010     1.048438    1.423885
  1.dmard_pc |   1.138309   .0695219     2.12   0.034     1.009888     1.28306
1.oral_pr~ne |   1.573621   .1068603     6.68   0.000     1.377519    1.797641
    1.nsaids |   1.002462   .0854357     0.03   0.977      .848249     1.18471
1.~c_disease |   1.370559   .0973019     4.44   0.000     1.192525    1.575173
1.resp_exc~a |   1.284878    .095803     3.36   0.001     1.110183    1.487062
             |
egfr_cat_n~s |
      30-59  |   1.086954   .0883574     1.03   0.305     .9268679     1.27469
        <30  |   2.269697   .3768816     4.94   0.000     1.639179    3.142746
             |
1.~r_disease |   1.178953   .2807238     0.69   0.489     .7392897    1.880089
             |
   obese4cat |
Obese I ..)  |   1.147239   .0870661     1.81   0.070     .9886773     1.33123
Obese II..)  |   1.133771    .127152     1.12   0.263     .9100463    1.412496
Obese II..)  |   1.544762   .2121699     3.17   0.002     1.180187    2.021959
             |
1.hyperten~n |   1.070039   .0706077     1.03   0.305     .9402259    1.217775
1.cancer_e~r |   1.233959   .1021765     2.54   0.011     1.049103    1.451388
1.neuro_co~s |   1.562285   .1392901     5.00   0.000     1.311804    1.860594
1.flu_vacc~e |   1.039108   .0739967     0.54   0.590     .9037433    1.194748
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ra, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_ra
> .ster saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* Restrict population=======================================================
> =*/ 
. preserve 

. keep if population == 1
(167,503 observations deleted)

. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |    19,781        106 |    19,887 
           |     99.47       0.53 |    100.00 
-----------+----------------------+----------
       HCQ |     6,795         41 |     6,836 
           |     99.40       0.60 |    100.00 
-----------+----------------------+----------
     Total |    26,576        147 |    26,723 
           |     99.45       0.55 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1493.9216
Iteration 1:   log likelihood = -1493.8179
Iteration 2:   log likelihood = -1493.8178
Refining estimates:
Iteration 0:   log likelihood = -1493.8178

Cox regression -- Breslow method for ties

No. of subjects =       26,723                  Number of obs    =      26,723
No. of failures =          147
Time at risk    =      3341359
                                                LR chi2(1)       =        0.21
Log likelihood  =   -1493.8178                  Prob > chi2      =      0.6488

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.087954   .2000909     0.46   0.647     .7586857    1.560124
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_sle.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1493.9216
Iteration 1:   log likelihood = -1487.3484
Iteration 2:   log likelihood = -1486.5612
Iteration 3:   log likelihood = -1486.5518
Iteration 4:   log likelihood = -1486.5518
Refining estimates:
Iteration 0:   log likelihood = -1486.5518

Cox regression -- Breslow method for ties

No. of subjects =       26,723                  Number of obs    =      26,723
No. of failures =          147
Time at risk    =      3341359
                                                LR chi2(5)       =       14.74
Log likelihood  =   -1486.5518                  Prob > chi2      =      0.0115

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.239454   .2331468     1.14   0.254     .8572658     1.79203
      1.male |   1.552791   .2987691     2.29   0.022     1.064965    2.264075
        age1 |   1.003115   .0158756     0.20   0.844     .9724769    1.034718
        age2 |   1.002646   .0375733     0.07   0.944     .9316432     1.07906
        age3 |   1.097135    .221121     0.46   0.646     .7391035    1.628601
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_sl
> e.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone, strata(stp)                          

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -766.14755
Iteration 1:   log likelihood = -746.53692
Iteration 2:   log likelihood = -744.44856
Iteration 3:   log likelihood =    -744.43
Iteration 4:   log likelihood = -744.42999
Refining estimates:
Iteration 0:   log likelihood = -744.42999

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,679                  Number of obs    =      20,679
No. of failures =          113
Time at risk    =      2584191
                                                LR chi2(11)      =       43.44
Log likelihood  =   -744.42999                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   1.070131   .2394958     0.30   0.762     .6901411    1.659344
      1.male |   1.622083   .3598247     2.18   0.029     1.050151    2.505498
        age1 |   .9965396   .0178868    -0.19   0.847     .9620916    1.032221
        age2 |   1.034625   .0445368     0.79   0.429     .9509149    1.125703
        age3 |   .9513526   .2209401    -0.21   0.830     .6034764    1.499764
             |
   ethnicity |
South Asian  |   1.554424   .4799734     1.43   0.153     .8486656    2.847099
      Black  |   2.141198   .7441242     2.19   0.028     1.083531    4.231286
      Mixed  |   1.627433   .9721547     0.82   0.415      .504701     5.24774
      Other  |   .4193285    .424892    -0.86   0.391     .0575519    3.055268
             |
  1.dmard_pc |   1.308316    .356631     0.99   0.324     .7668058    2.232235
1.oral_pr~ne |   2.370128   .4979281     4.11   0.000     1.570172    3.577638
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_sl
> e.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.male age1 age2 age3 i.ethnicity i.dmard_pc i.oral_predniso
> lone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egfr_cat_nomiss 
> i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever i.neuro_cond
> itions i.flu_vaccine, strata(stp)        

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -766.14755
Iteration 1:   log likelihood = -733.21466
Iteration 2:   log likelihood = -729.86032
Iteration 3:   log likelihood = -729.82911
Iteration 4:   log likelihood = -729.82908
Refining estimates:
Iteration 0:   log likelihood = -729.82908

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       20,679                  Number of obs    =      20,679
No. of failures =          113
Time at risk    =      2584191
                                                LR chi2(24)      =       72.64
Log likelihood  =   -729.82908                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9884603   .2230152    -0.05   0.959     .6352024    1.538177
      1.male |   1.632629   .3672862     2.18   0.029       1.0505    2.537342
        age1 |   .9855951   .0180352    -0.79   0.428     .9508731    1.021585
        age2 |    1.02403    .045121     0.54   0.590      .939305    1.116396
        age3 |   1.036923   .2469015     0.15   0.879     .6502301    1.653583
             |
   ethnicity |
South Asian  |   1.598189   .4971199     1.51   0.132     .8686809     2.94033
      Black  |   2.054229   .7221474     2.05   0.041     1.031374    4.091493
      Mixed  |   1.700183    1.01846     0.89   0.376     .5255334    5.500356
      Other  |   .4675624   .4745178    -0.75   0.454     .0639699     3.41746
             |
  1.dmard_pc |   1.293059   .3545505     0.94   0.349     .7554797    2.213164
1.oral_pr~ne |   2.058964   .4473949     3.32   0.001     1.344901    3.152154
    1.nsaids |   1.553303   .4417012     1.55   0.121     .8896242    2.712102
1.~c_disease |   1.236397   .3138194     0.84   0.403     .7518102    2.033331
1.resp_exc~a |   1.475171   .3756795     1.53   0.127     .8955057    2.430058
             |
egfr_cat_n~s |
      30-59  |   1.123416   .3311032     0.39   0.693     .6304736    2.001771
        <30  |   1.341869   .8124793     0.49   0.627     .4095641    4.396412
             |
1.~r_disease |   .5694487   .4098699    -0.78   0.434     .1389276    2.334107
             |
   obese4cat |
Obese I ..)  |   1.871873    .431875     2.72   0.007     1.190937    2.942145
Obese II..)  |   2.094909   .6532916     2.37   0.018     1.136895    3.860202
Obese II..)  |   2.334513   .9530411     2.08   0.038     1.048822    5.196257
             |
1.hyperten~n |   1.320109   .2906643     1.26   0.207     .8574137    2.032493
1.cancer_e~r |   1.781959   .4773375     2.16   0.031     1.054106    3.012389
1.neuro_co~s |   .9772782   .3325588    -0.07   0.946     .5016053    1.904032
1.flu_vacc~e |   1.244498   .2778078     0.98   0.327     .8034917    1.927555
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_sle, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_sl
> e.ster saved

. restore

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7a_sep.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7a: RA and SLE populations separately") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Rheumatoid arthritis (RA)") _n                     
>                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 0
  143,840

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 0
  1,041

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 0
  23,663

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 0
  144

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8315948   .0739375    -2.07   0.038      .698604    .9899026
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9142453   .0816742    -1.00   0.316     .7673978    1.089193
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8795991   .0795015    -1.42   0.156     .7368006    1.050073
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ra 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8688342   .0786676    -1.55   0.120      .727555    1.037547
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n _n

. 
. 
. /* Main Model  ==========================*/
. file write tablecontent ("Systemic lupus erythematosus (SLE)") _n            
>                            

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 & population == 1
  19,887

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 & population == 1
  106

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 & population == 1
  6,836

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 & population == 1
  41

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_sle 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.087954   .2000909     0.46   0.647     .7586857    1.560124
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.239454   .2331468     1.14   0.254     .8572658     1.79203
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.070131   .2394958     0.30   0.762     .6901411    1.659344
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_sle  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9884603   .2230152    -0.05   0.959     .6352024    1.538177
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n

. 
. file close tablecontent

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. /* INDICATOR VARIABLE========================================================
> */ 
. /* Sense check outcomes======================================================
> =*/ 
. tab exposure $outcome, missing row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Failure/censoring
           |     indicator for
           | outcome: primary care
       HCQ |     positive test
  Exposure |         0          1 |     Total
-----------+----------------------+----------
    No HCQ |   162,580      1,147 |   163,727 
           |     99.30       0.70 |    100.00 
-----------+----------------------+----------
       HCQ |    30,314        185 |    30,499 
           |     99.39       0.61 |    100.00 
-----------+----------------------+----------
     Total |   192,894      1,332 |   194,226 
           |     99.31       0.69 |    100.00 

. /* Main Model (additionally adjusted for ethnicity) =========================
> =*/
. /* Univariable model */ 
. stcox i.exposure 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16192.088
Iteration 2:   log likelihood = -16192.082
Iteration 3:   log likelihood = -16192.082
Refining estimates:
Iteration 0:   log likelihood = -16192.082

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(1)       =        4.13
Log likelihood  =   -16192.082                  Prob > chi2      =      0.0420

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8537861   .0676447    -2.00   0.046     .7309861    .9972155
------------------------------------------------------------------------------

. estimates save $Tempdir/univar_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/univar_ind.s
> ter saved

. /* Multivariable models */ 
. * Age and Sex 
. * Age fit as spline 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -16194.15
Iteration 1:   log likelihood = -16101.088
Iteration 2:   log likelihood = -16067.447
Iteration 3:   log likelihood = -16066.754
Iteration 4:   log likelihood = -16066.754
Refining estimates:
Iteration 0:   log likelihood = -16066.754

Cox regression -- Breslow method for ties

No. of subjects =      194,226                  Number of obs    =     194,226
No. of failures =        1,332
Time at risk    =     24563948
                                                LR chi2(5)       =      254.79
Log likelihood  =   -16066.754                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .9593525   .0765109    -0.52   0.603     .8205266    1.121667
      1.male |   1.143528   .0674122     2.28   0.023      1.01875     1.28359
        age1 |     1.0076    .007484     1.02   0.308     .9930377    1.022375
        age2 |   1.001323   .0148066     0.09   0.929     .9727191    1.030768
        age3 |    1.13617   .0795967     1.82   0.068     .9903997    1.303394
------------------------------------------------------------------------------

. estimates save $Tempdir/multivar1_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar1_in
> d.ster saved

. * DAG adjusted (age, sex, geographic region, other immunosuppressives (will i
> nclude biologics when we have them))  
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone, strata(stp)                             

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8559.9791
Iteration 1:   log likelihood = -8448.2327
Iteration 2:   log likelihood = -8411.4676
Iteration 3:   log likelihood = -8410.6003
Iteration 4:   log likelihood = -8410.5994
Iteration 5:   log likelihood = -8410.5994
Refining estimates:
Iteration 0:   log likelihood = -8410.5994

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,989                  Number of obs    =     148,989
No. of failures =          982
Time at risk    =     18843796
                                                LR chi2(12)      =      298.76
Log likelihood  =   -8410.5994                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8362358   .0809631    -1.85   0.065     .6916982    1.010976
             |
  population |
        SLE  |   .9769293   .1023269    -0.22   0.824     .7956194    1.199557
      1.male |   1.144428   .0793079     1.95   0.052     .9990817    1.310919
        age1 |   1.007113   .0087014     0.82   0.412     .9902019    1.024312
        age2 |   .9990255   .0172513    -0.06   0.955     .9657794    1.033416
        age3 |   1.165907   .0959262     1.87   0.062     .9922717    1.369927
             |
   ethnicity |
South Asian  |   1.404699   .1748981     2.73   0.006     1.100527     1.79294
      Black  |   1.377741   .2901932     1.52   0.128      .911757    2.081881
      Mixed  |   1.628079     .49914     1.59   0.112     .8927141    2.969195
      Other  |   .8107559   .2912455    -0.58   0.559     .4009733    1.639324
             |
  1.dmard_pc |   1.111794   .0758921     1.55   0.121     .9725688    1.270949
1.oral_pr~ne |   1.925906   .1364526     9.25   0.000     1.676202    2.212808
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar2_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar2_in
> d.ster saved

. * DAG+ other adjustments (NSAIDs, heart disease, lung disease, kidney disease
> , liver disease, BMI, hypertension, cancer, stroke, dementia, and respiratory
>  disease excl asthma (OCS capturing ashtma))
. stcox i.exposure i.population i.male age1 age2 age3 i.ethnicity i.dmard_pc i.
> oral_prednisolone i.nsaids i.chronic_cardiac_disease i.resp_excl_asthma i.egf
> r_cat_nomiss i.chronic_liver_disease i.obese4cat i.hypertension i.cancer_ever
>  i.neuro_conditions i.flu_vaccine, strata(stp)   

         failure _d:  firstpos_primcare
   analysis time _t:  (stime_firstpos_primcare-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8559.9791
Iteration 1:   log likelihood = -8460.6251
Iteration 2:   log likelihood = -8372.1845
Iteration 3:   log likelihood = -8363.8133
Iteration 4:   log likelihood = -8363.4333
Iteration 5:   log likelihood = -8363.4317
Refining estimates:
Iteration 0:   log likelihood = -8363.4317

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      148,989                  Number of obs    =     148,989
No. of failures =          982
Time at risk    =     18843796
                                                LR chi2(25)      =      393.09
Log likelihood  =   -8363.4317                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
        HCQ  |   .8214533   .0797173    -2.03   0.043     .6791703     .993544
             |
  population |
        SLE  |   .9737289   .1024544    -0.25   0.800     .7922748    1.196741
      1.male |   1.103167   .0776288     1.40   0.163      .961043    1.266308
        age1 |   1.002297   .0087202     0.26   0.792     .9853508    1.019535
        age2 |   .9913077    .017385    -0.50   0.619     .9578127    1.025974
        age3 |   1.211389   .1013114     2.29   0.022     1.028242    1.427157
             |
   ethnicity |
South Asian  |   1.426543    .178508     2.84   0.005     1.116275     1.82305
      Black  |    1.33796   .2826089     1.38   0.168     .8844009    2.024124
      Mixed  |   1.607503   .4931948     1.55   0.122     .8810417    2.932968
      Other  |    .844055   .3034626    -0.47   0.637     .4171947    1.707665
             |
  1.dmard_pc |   1.146539   .0792236     1.98   0.048     1.001319     1.31282
1.oral_pr~ne |   1.740016   .1279513     7.53   0.000      1.50647    2.009768
    1.nsaids |   .9502083   .0916073    -0.53   0.596     .7866047    1.147839
1.~c_disease |   1.332906   .1058429     3.62   0.000     1.140795    1.557369
1.resp_exc~a |   1.255815   .1038062     2.76   0.006     1.067985     1.47668
             |
egfr_cat_n~s |
      30-59  |   1.061306   .0972509     0.65   0.516     .8868336    1.270103
        <30  |   2.091489   .3864228     3.99   0.000     1.456089    3.004161
             |
1.~r_disease |   .9596735   .2590388    -0.15   0.879     .5654106    1.628858
             |
   obese4cat |
Obese I ..)  |   1.207887   .0999342     2.28   0.022     1.027076     1.42053
Obese II..)  |   1.305584   .1537432     2.26   0.024     1.036499    1.644526
Obese II..)  |   1.847289   .2627626     4.31   0.000     1.397842    2.441247
             |
1.hyperten~n |   1.104431   .0807923     1.36   0.175     .9569097    1.274696
1.cancer_e~r |   1.250818   .1155044     2.42   0.015     1.043738    1.498983
1.neuro_co~s |   1.421525   .1435508     3.48   0.000     1.166265    1.732655
1.flu_vacc~e |   1.085675   .0850726     1.05   0.294     .9311087      1.2659
------------------------------------------------------------------------------
                                                             Stratified by stp

. estimates save $Tempdir/multivar3_ind, replace 
file E:\analyses\hydroxychloroquine-research/output/sens3/tempdata/multivar3_in
> d.ster saved

. *****************************************************************************
> *****************************************************************************
> ******************************
. *****************************************************************************
> *****************************************************************************
> ******************************
. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table7b_ind.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Table 7b: RA and SLE populations as indicator varia
> ble") _n

. file write tablecontent _tab ("N") _tab ("Univariable") _tab _tab ("Age/Sex A
> djusted") _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab ("
> Fully Adjusted") _tab _tab  _n

. file write tablecontent _tab _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

.                                                 
. /* Main Model  ======*/
. file write tablecontent ("Indicator in DAG and Fully Adjusted only") _n      
>                                    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         cou if exposure == 0 
  163,727

.         local rowdenom = r(N)

.         cou if exposure == 0 & $outcome == 1 
  1,147

.         local pct = 100*(r(N)/`rowdenom') 

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab 
> _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 (comparator)
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         cou if exposure == 1 
  30,499

.         local rowdenom = r(N)

.         cou if exposure == 1 & $outcome == 1 
  185

.         local pct = 100*(r(N)/`rowdenom') 

.         file write tablecontent (r(N)) (" (") %3.1f (`pct') (")") _tab

. 
. /* Main Model */ 
. estimates use $Tempdir/univar_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8537861   .0676447    -2.00   0.046     .7309861    .9972155
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar1_ind 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9593525   .0765109    -0.52   0.603     .8205266    1.121667
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar2_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8362358   .0809631    -1.85   0.065     .6916982    1.010976
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _tab 

. 
. estimates use $Tempdir/multivar3_ind

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8214533   .0797173    -2.03   0.043     .6791703     .993544
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) ("-") %4
> .2f (r(ub)) (")") _n 

. 
. file write tablecontent _n 

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\hydroxychloroquine-research/output/sens3/log\11_an_mod
> els_sep_pops.log
  log type:  text
 closed on:  19 Jul 2020, 18:50:09
-------------------------------------------------------------------------------
